#ifndef UE4SS_SDK_IKAnimBP_HPP
#define UE4SS_SDK_IKAnimBP_HPP

class UIKAnimBP_C : public UIKSubAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0730 (size: 0x8)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_16;                                 // 0x0738 (size: 0x108)
    FAnimNode_Fabrik AnimGraphNode_Fabrik_11;                                         // 0x0840 (size: 0x190)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_15;                                 // 0x09D0 (size: 0x108)
    FAnimNode_LinkedInputPose AnimGraphNode_SubInput;                                 // 0x0AD8 (size: 0x118)
    FAnimNode_Fabrik AnimGraphNode_Fabrik_10;                                         // 0x0BF0 (size: 0x190)
    FAnimNode_Fabrik AnimGraphNode_Fabrik_9;                                          // 0x0D80 (size: 0x190)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_14;                                 // 0x0F10 (size: 0x108)
    FAnimNode_Fabrik AnimGraphNode_Fabrik_8;                                          // 0x1020 (size: 0x190)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_13;                                 // 0x11B0 (size: 0x108)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;     // 0x12B8 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_12;                                 // 0x12D8 (size: 0x108)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x13E0 (size: 0x30)
    FSCAnimNode_AimIK SCAnimGraphNode_AimIK_7;                                        // 0x1410 (size: 0x230)
    FSCAnimNode_AimIK SCAnimGraphNode_AimIK_6;                                        // 0x1640 (size: 0x230)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;     // 0x1870 (size: 0x20)
    FSCAnimNode_AimIK SCAnimGraphNode_AimIK_5;                                        // 0x1890 (size: 0x230)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;     // 0x1AC0 (size: 0x20)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_3;                                    // 0x1AE0 (size: 0x1E0)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;     // 0x1CC0 (size: 0x20)
    FSCAnimNode_AimIK SCAnimGraphNode_AimIK_4;                                        // 0x1CE0 (size: 0x230)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x1F10 (size: 0x20)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_2;                                    // 0x1F30 (size: 0x1E0)
    FSCAnimNode_SaveBoneTransformByName SCAnimGraphNode_SaveBoneTransformByName_1;    // 0x2110 (size: 0x58)
    FSCAnimNode_SaveBoneTransformByName SCAnimGraphNode_SaveBoneTransformByName;      // 0x2168 (size: 0x58)
    FSCAnimNode_AimIK SCAnimGraphNode_AimIK_3;                                        // 0x21C0 (size: 0x230)
    FSCAnimNode_AimIK SCAnimGraphNode_AimIK_2;                                        // 0x23F0 (size: 0x230)
    FSCAnimNode_AimIK SCAnimGraphNode_AimIK_1;                                        // 0x2620 (size: 0x230)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_1;                                    // 0x2850 (size: 0x1E0)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK;                                      // 0x2A30 (size: 0x1E0)
    FSCAnimNode_AimIK SCAnimGraphNode_AimIK;                                          // 0x2C10 (size: 0x230)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_11;                                 // 0x2E40 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_10;                                 // 0x2F48 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_9;                                  // 0x3050 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_8;                                  // 0x3158 (size: 0x108)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x3260 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7;                                  // 0x3280 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6;                                  // 0x3388 (size: 0x108)
    FAnimNode_Fabrik AnimGraphNode_Fabrik_7;                                          // 0x3490 (size: 0x190)
    FAnimNode_Fabrik AnimGraphNode_Fabrik_6;                                          // 0x3620 (size: 0x190)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5;                                  // 0x37B0 (size: 0x108)
    FAnimNode_Fabrik AnimGraphNode_Fabrik_5;                                          // 0x38C0 (size: 0x190)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4;                                  // 0x3A50 (size: 0x108)
    FAnimNode_Fabrik AnimGraphNode_Fabrik_4;                                          // 0x3B60 (size: 0x190)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3;                                  // 0x3CF0 (size: 0x108)
    FAnimNode_Fabrik AnimGraphNode_Fabrik_3;                                          // 0x3E00 (size: 0x190)
    FAnimNode_Fabrik AnimGraphNode_Fabrik_2;                                          // 0x3F90 (size: 0x190)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2;                                  // 0x4120 (size: 0x108)
    FAnimNode_Fabrik AnimGraphNode_Fabrik_1;                                          // 0x4230 (size: 0x190)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_1;                                  // 0x43C0 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x44C8 (size: 0x108)
    FAnimNode_Fabrik AnimGraphNode_Fabrik;                                            // 0x45D0 (size: 0x190)
    FIKPropertyEvaluation LeftArmInfos;                                               // 0x4760 (size: 0xE0)
    FIKPropertyEvaluation RightArmInfos;                                              // 0x4840 (size: 0xE0)
    FIKPropertyEvaluation RightArmInfos_Alt;                                          // 0x4920 (size: 0xE0)
    FIKPropertyEvaluation LeftArmInfos_Alt;                                           // 0x4A00 (size: 0xE0)
    bool Mirror;                                                                      // 0x4AE0 (size: 0x1)
    FIKPropertyEvaluation RightArmFromPelvis;                                         // 0x4AF0 (size: 0xE0)
    FIKPropertyEvaluation RightArmFromPelvis_Alt;                                     // 0x4BD0 (size: 0xE0)
    FIKPropertyEvaluation RightLeg;                                                   // 0x4CB0 (size: 0xE0)
    FIKPropertyEvaluation LeftArmAimIK;                                               // 0x4D90 (size: 0xE0)
    FIKPropertyEvaluation RightArmAimIK;                                              // 0x4E70 (size: 0xE0)
    FIKPropertyEvaluation LeftLegAimIK;                                               // 0x4F50 (size: 0xE0)
    FIKPropertyEvaluation RightLegAimIK;                                              // 0x5030 (size: 0xE0)
    FIKPropertyEvaluation LeftArmAimIK_Alt;                                           // 0x5110 (size: 0xE0)
    FIKPropertyEvaluation RightArmAimIK_Alt;                                          // 0x51F0 (size: 0xE0)
    FIKPropertyEvaluation LeftLegAimIK_Alt;                                           // 0x52D0 (size: 0xE0)
    FIKPropertyEvaluation RightLegAimIK_Alt;                                          // 0x53B0 (size: 0xE0)
    FIKPropertyEvaluation RightLeg_Alt;                                               // 0x5490 (size: 0xE0)
    FIKPropertyEvaluation LeftLeg;                                                    // 0x5570 (size: 0xE0)
    FIKPropertyEvaluation LeftLeg_Alt;                                                // 0x5650 (size: 0xE0)
    FPropertyFloorBoneRepartition PelvisRepartition;                                  // 0x5730 (size: 0x70)
    FPropertyFloorBoneRepartition Spine1Repartition;                                  // 0x57A0 (size: 0x70)
    FPropertyFloorBoneRepartition Spine2Repartition;                                  // 0x5810 (size: 0x70)
    FPropertyFloorBoneRepartition Spine3Repartition;                                  // 0x5880 (size: 0x70)
    FPropertyFloorBoneRepartition RootRepartition;                                    // 0x58F0 (size: 0x70)
    FIKPropertyEvaluation LeftArmNoSpine;                                             // 0x5960 (size: 0xE0)
    FIKPropertyEvaluation RightArmNoSpine;                                            // 0x5A40 (size: 0xE0)
    FIKPropertyEvaluation WeaponRightArm;                                             // 0x5B20 (size: 0xE0)
    FIKPropertyEvaluation WeaponLeftArm;                                              // 0x5C00 (size: 0xE0)

    void AnimGraph(FPoseLink InPose, FPoseLink& AnimGraph);
    void BindLimb(FIKPropertyEvaluation& _fProperty, uint8 _uiEnum, FIKPropertyEvaluation& _fProperty2, uint8 _uiEnum2, FIKPropertyEvaluation& _fProperty3, uint8 _uiEnum3, FIKPropertyEvaluation& _fProperty4, uint8 _uiEnum4);
    void BlueprintInitializeAnimation();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_IKAnimBP_AnimGraphNode_TwoBoneIK_EE900F5E4279364E8D5225BCC11138FE();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_IKAnimBP_AnimGraphNode_TwoBoneIK_BB446AE94E932D917D777A84E378874C();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_IKAnimBP_AnimGraphNode_TwoBoneIK_318A32014E1645B891434E84BB01A8B1();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_IKAnimBP_AnimGraphNode_TwoBoneIK_5A3C04D6472D0715FE7FFC9AF485152E();
    void ExecuteUbergraph_IKAnimBP(int32 EntryPoint);
}; // Size: 0x5CE0

#endif
