#ifndef UE4SS_SDK_Weapon_AnimationBlueprint_HPP
#define UE4SS_SDK_Weapon_AnimationBlueprint_HPP

class UWeapon_AnimationBlueprint_C : public UAnimInstanceWithDependancy
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0BE0 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x0BE8 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67;                     // 0x0C18 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66;                     // 0x0C40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65;                     // 0x0C68 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64;                     // 0x0C90 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63;                     // 0x0CB8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62;                     // 0x0CE0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61;                     // 0x0D08 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60;                     // 0x0D30 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59;                     // 0x0D58 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58;                     // 0x0D80 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57;                     // 0x0DA8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56;                     // 0x0DD0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55;                     // 0x0DF8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54;                     // 0x0E20 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53;                     // 0x0E48 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52;                     // 0x0E70 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51;                     // 0x0E98 (size: 0x28)
    FSCAnimNode_PlayBlendSpace SCAnimGraphNode_PlayBlendSpace_11;                     // 0x0EC0 (size: 0x110)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_10;                       // 0x0FD0 (size: 0xB0)
    FSCAnimNode_PlayAnim SCAnimGraphNode_PlayAnim_27;                                 // 0x1080 (size: 0xB8)
    FSCAnimNode_MirrorPose SCAnimGraphNode_MirrorPose_7;                              // 0x1138 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_32;                               // 0x1168 (size: 0x30)
    FSCAnimNode_PlayBlendSpace SCAnimGraphNode_PlayBlendSpace_10;                     // 0x1198 (size: 0x110)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_9;                        // 0x12A8 (size: 0xB0)
    FSCAnimNode_PlayAnim SCAnimGraphNode_PlayAnim_26;                                 // 0x1358 (size: 0xB8)
    FSCAnimNode_MirrorPose SCAnimGraphNode_MirrorPose_6;                              // 0x1410 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_31;                               // 0x1440 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50;                     // 0x1470 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49;                     // 0x1498 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48;                     // 0x14C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47;                     // 0x14E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46;                     // 0x1510 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45;                     // 0x1538 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44;                     // 0x1560 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43;                     // 0x1588 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42;                     // 0x15B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41;                     // 0x15D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40;                     // 0x1600 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39;                     // 0x1628 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38;                     // 0x1650 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37;                     // 0x1678 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36;                     // 0x16A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35;                     // 0x16C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34;                     // 0x16F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33;                     // 0x1718 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0x1740 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0x1768 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0x1790 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0x17B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0x17E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0x1808 (size: 0x28)
    FSCAnimNode_PlayAnim SCAnimGraphNode_PlayAnim_25;                                 // 0x1830 (size: 0xB8)
    FAnimNode_StateResult AnimGraphNode_StateResult_30;                               // 0x18E8 (size: 0x30)
    FSCAnimNode_PlayAnim SCAnimGraphNode_PlayAnim_24;                                 // 0x1918 (size: 0xB8)
    FAnimNode_StateResult AnimGraphNode_StateResult_29;                               // 0x19D0 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0x1A00 (size: 0x28)
    FSCAnimNode_PlayAnim SCAnimGraphNode_PlayAnim_23;                                 // 0x1A28 (size: 0xB8)
    FAnimNode_StateResult AnimGraphNode_StateResult_28;                               // 0x1AE0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_7;                              // 0x1B10 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_27;                               // 0x1BC0 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0x1BF0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0x1C18 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0x1C40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0x1C68 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0x1C90 (size: 0x28)
    FSCAnimNode_PlayAnim SCAnimGraphNode_PlayAnim_22;                                 // 0x1CB8 (size: 0xB8)
    FAnimNode_StateResult AnimGraphNode_StateResult_26;                               // 0x1D70 (size: 0x30)
    FSCAnimNode_PlayAnim SCAnimGraphNode_PlayAnim_21;                                 // 0x1DA0 (size: 0xB8)
    FAnimNode_StateResult AnimGraphNode_StateResult_25;                               // 0x1E58 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0x1E88 (size: 0x28)
    FSCAnimNode_PlayAnim SCAnimGraphNode_PlayAnim_20;                                 // 0x1EB0 (size: 0xB8)
    FAnimNode_StateResult AnimGraphNode_StateResult_24;                               // 0x1F68 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_6;                              // 0x1F98 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_23;                               // 0x2048 (size: 0x30)
    FSCAnimNode_PlayAnim SCAnimGraphNode_PlayAnim_19;                                 // 0x2078 (size: 0xB8)
    FAnimNode_StateResult AnimGraphNode_StateResult_22;                               // 0x2130 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x2160 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x2188 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x21B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x21D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x2200 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x2228 (size: 0x28)
    FSCAnimNode_PlayAnim SCAnimGraphNode_PlayAnim_18;                                 // 0x2250 (size: 0xB8)
    FAnimNode_StateResult AnimGraphNode_StateResult_21;                               // 0x2308 (size: 0x30)
    FSCAnimNode_PlayAnim SCAnimGraphNode_PlayAnim_17;                                 // 0x2338 (size: 0xB8)
    FAnimNode_StateResult AnimGraphNode_StateResult_20;                               // 0x23F0 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x2420 (size: 0x28)
    FSCAnimNode_PlayAnim SCAnimGraphNode_PlayAnim_16;                                 // 0x2448 (size: 0xB8)
    FAnimNode_StateResult AnimGraphNode_StateResult_19;                               // 0x2500 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_5;                              // 0x2530 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_18;                               // 0x25E0 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x2610 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x2638 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x2660 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x2688 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x26B0 (size: 0x28)
    FSCAnimNode_PlayAnim SCAnimGraphNode_PlayAnim_15;                                 // 0x26D8 (size: 0xB8)
    FAnimNode_StateResult AnimGraphNode_StateResult_17;                               // 0x2790 (size: 0x30)
    FSCAnimNode_PlayAnim SCAnimGraphNode_PlayAnim_14;                                 // 0x27C0 (size: 0xB8)
    FAnimNode_StateResult AnimGraphNode_StateResult_16;                               // 0x2878 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x28A8 (size: 0x28)
    FSCAnimNode_PlayAnim SCAnimGraphNode_PlayAnim_13;                                 // 0x28D0 (size: 0xB8)
    FAnimNode_StateResult AnimGraphNode_StateResult_15;                               // 0x2988 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_4;                              // 0x29B8 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_14;                               // 0x2A68 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x2A98 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x2AC0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x2AE8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x2B10 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x2B38 (size: 0x28)
    FSCAnimNode_PlayAnim SCAnimGraphNode_PlayAnim_12;                                 // 0x2B60 (size: 0xB8)
    FAnimNode_StateResult AnimGraphNode_StateResult_13;                               // 0x2C18 (size: 0x30)
    FSCAnimNode_PlayAnim SCAnimGraphNode_PlayAnim_11;                                 // 0x2C48 (size: 0xB8)
    FAnimNode_StateResult AnimGraphNode_StateResult_12;                               // 0x2D00 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x2D30 (size: 0x28)
    FSCAnimNode_PlayAnim SCAnimGraphNode_PlayAnim_10;                                 // 0x2D58 (size: 0xB8)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x2E10 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_3;                              // 0x2E40 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x2EF0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_2;                              // 0x2F20 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x2FD0 (size: 0x30)
    FSCAnimNode_MirrorPose SCAnimGraphNode_MirrorPose_5;                              // 0x3000 (size: 0x30)
    FSCAnimNode_PlayBlendSpace SCAnimGraphNode_PlayBlendSpace_9;                      // 0x3030 (size: 0x110)
    FSCAnimNode_PlayBlendSpace SCAnimGraphNode_PlayBlendSpace_8;                      // 0x3140 (size: 0x110)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_8;                        // 0x3250 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x3300 (size: 0x30)
    FSCAnimNode_PlayBlendSpace SCAnimGraphNode_PlayBlendSpace_7;                      // 0x3330 (size: 0x110)
    FSCAnimNode_PlayBlendSpace SCAnimGraphNode_PlayBlendSpace_6;                      // 0x3440 (size: 0x110)
    FSCAnimNode_MirrorPose SCAnimGraphNode_MirrorPose_4;                              // 0x3550 (size: 0x30)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_7;                        // 0x3580 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x3630 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x3660 (size: 0x28)
    FSCAnimNode_PlayBlendSpace SCAnimGraphNode_PlayBlendSpace_5;                      // 0x3688 (size: 0x110)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x3798 (size: 0xA0)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_6;                        // 0x3838 (size: 0xB0)
    FSCAnimNode_PlayBlendSpace SCAnimGraphNode_PlayBlendSpace_4;                      // 0x38E8 (size: 0x110)
    FSCAnimNode_PlayBlendSpace SCAnimGraphNode_PlayBlendSpace_3;                      // 0x39F8 (size: 0x110)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5;                        // 0x3B08 (size: 0xB0)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4;                        // 0x3BB8 (size: 0xB0)
    FSCAnimNode_PlayBlendSpace SCAnimGraphNode_PlayBlendSpace_2;                      // 0x3C68 (size: 0x110)
    FSCAnimNode_MirrorPose SCAnimGraphNode_MirrorPose_3;                              // 0x3D78 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x3DA8 (size: 0x30)
    FSCAnimNode_MirrorPose SCAnimGraphNode_MirrorPose_2;                              // 0x3DD8 (size: 0x30)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3;                        // 0x3E08 (size: 0xB0)
    FSCAnimNode_PlayAnim SCAnimGraphNode_PlayAnim_9;                                  // 0x3EB8 (size: 0xB8)
    FSCAnimNode_PlayAnim SCAnimGraphNode_PlayAnim_8;                                  // 0x3F70 (size: 0xB8)
    FSCAnimNode_PlayAnim SCAnimGraphNode_PlayAnim_7;                                  // 0x4028 (size: 0xB8)
    FSCAnimNode_PlayAnim SCAnimGraphNode_PlayAnim_6;                                  // 0x40E0 (size: 0xB8)
    FSCAnimNode_PlayAnim SCAnimGraphNode_PlayAnim_5;                                  // 0x4198 (size: 0xB8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2;                        // 0x4250 (size: 0xB0)
    FSCAnimNode_PlayAnim SCAnimGraphNode_PlayAnim_4;                                  // 0x4300 (size: 0xB8)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x43B8 (size: 0x30)
    FSCAnimNode_PlayAnim SCAnimGraphNode_PlayAnim_3;                                  // 0x43E8 (size: 0xB8)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x44A0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x44D0 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x4580 (size: 0x30)
    FSCAnimNode_PlayBlendSpace SCAnimGraphNode_PlayBlendSpace_1;                      // 0x45B0 (size: 0x110)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_1;                        // 0x46C0 (size: 0xB0)
    FSCAnimNode_PlayAnim SCAnimGraphNode_PlayAnim_2;                                  // 0x4770 (size: 0xB8)
    FSCAnimNode_MirrorPose SCAnimGraphNode_MirrorPose_1;                              // 0x4828 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x4858 (size: 0x30)
    FSCAnimNode_PlayBlendSpace SCAnimGraphNode_PlayBlendSpace;                        // 0x4888 (size: 0x110)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x4998 (size: 0xB0)
    FSCAnimNode_MirrorPose SCAnimGraphNode_MirrorPose;                                // 0x4A48 (size: 0x30)
    FSCAnimNode_PlayAnim SCAnimGraphNode_PlayAnim_1;                                  // 0x4A78 (size: 0xB8)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x4B30 (size: 0x30)
    FSCAnimNode_PlayAnim SCAnimGraphNode_PlayAnim;                                    // 0x4B60 (size: 0xB8)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x4C18 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x4C48 (size: 0xB0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x4CF8 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x4E50 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x4E78 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x4EA0 (size: 0x48)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend;                                  // 0x4EE8 (size: 0xC8)
    bool bUseFakie;                                                                   // 0x4FB0 (size: 0x1)
    class UWuguan_Character_AnimationBlueprint_C* MasterAnimBP;                       // 0x4FB8 (size: 0x8)
    TEnumAsByte<VerticalMovementDirection> VerticalMovementDir;                       // 0x4FC0 (size: 0x1)
    FMoveStatus MoveStatus;                                                           // 0x4FC1 (size: 0x4)
    EQuadrantTypes Quadrant;                                                          // 0x4FC5 (size: 0x1)
    bool FreemoveAsLockmove;                                                          // 0x4FC6 (size: 0x1)
    class UAnimSequence* V0DefaultSequence;                                           // 0x4FC8 (size: 0x8)
    class UBP_WeaponData_C* WeaponData;                                               // 0x4FD0 (size: 0x8)
    bool bIsInTransition;                                                             // 0x4FD8 (size: 0x1)
    FSpeedState SpeedState;                                                           // 0x4FD9 (size: 0x5)
    float OwnerVelocityLength;                                                        // 0x4FE0 (size: 0x4)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Weapon_AnimationBlueprint_SCAnimGraphNode_PlayAnim_D787FD484CB628A341E9309189FB749F();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Weapon_AnimationBlueprint_SCAnimGraphNode_PlayBlendSpace_89B1E77E4F3230F901B64EBB6FB81E85();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Weapon_AnimationBlueprint_SCAnimGraphNode_PlayBlendSpace_B8890BC540EE56B02D7AD9A3F0A29B8E();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Weapon_AnimationBlueprint_SCAnimGraphNode_PlayBlendSpace_1701AA634B65687F1940489DE129937B();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Weapon_AnimationBlueprint_SCAnimGraphNode_PlayBlendSpace_2B214BA94E87E23B739B37968EEE42E4();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Weapon_AnimationBlueprint_SCAnimGraphNode_PlayBlendSpace_89EC7E6E4535BA97EAFBEB89D4472430();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Weapon_AnimationBlueprint_SCAnimGraphNode_PlayBlendSpace_F79242E7475D0AFC7A9A74943A1EA956();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Weapon_AnimationBlueprint_SCAnimGraphNode_PlayAnim_61E7123546232B573E4857B512D45133();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Weapon_AnimationBlueprint_SCAnimGraphNode_PlayAnim_0FCF9DDA46DA2DD210F19A9D8903C32B();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Weapon_AnimationBlueprint_SCAnimGraphNode_PlayAnim_04F270F744B9E60B52942AA20BF50DC6();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Weapon_AnimationBlueprint_SCAnimGraphNode_PlayAnim_8B1723A34B720FBC917C90B50FF6E182();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Weapon_AnimationBlueprint_SCAnimGraphNode_PlayAnim_42343F1540A0126B151232AADFE43911();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Weapon_AnimationBlueprint_SCAnimGraphNode_PlayAnim_919F8626433DCC406BF030BA83099872();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Weapon_AnimationBlueprint_SCAnimGraphNode_PlayAnim_42A653CF4DC99A41FD26E995CCE2E1F1();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Weapon_AnimationBlueprint_SCAnimGraphNode_PlayAnim_0ED7FD2441D4044868E1459573D486B0();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Weapon_AnimationBlueprint_SCAnimGraphNode_PlayAnim_464CB3A74EACEC9834D16F83934DE028();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Weapon_AnimationBlueprint_SCAnimGraphNode_PlayAnim_39E5AB5B49618131497AF486DFDBB2CD();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Weapon_AnimationBlueprint_AnimGraphNode_TransitionResult_FB679412411B8ACABC53D0A1BC7310E6();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Weapon_AnimationBlueprint_AnimGraphNode_TransitionResult_045B590841F173B89EE59FB303A772E2();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Weapon_AnimationBlueprint_AnimGraphNode_TransitionResult_FD221B7E4D23F29E602E768E916E0FA9();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Weapon_AnimationBlueprint_AnimGraphNode_TransitionResult_3B08EA1F428F6FF24DC6E4B9FDC1414B();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Weapon_AnimationBlueprint_AnimGraphNode_TransitionResult_B39EF5F140BF254788EDF6B5299C24BF();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_Weapon_AnimationBlueprint_AnimGraphNode_TransitionResult_B87B0D364D9E6E50720260B218490162();
    void BlueprintUpdateAnimation(float DeltaTimeX);
    void BlueprintBeginPlay();
    void ExecuteUbergraph_Weapon_AnimationBlueprint(int32 EntryPoint);
}; // Size: 0x4FE4

#endif
