#ifndef UE4SS_SDK_ArchetypeTakedownAnims_HPP
#define UE4SS_SDK_ArchetypeTakedownAnims_HPP

struct FArchetypeTakedownAnims
{
    TArray<FTakedownAnim> GenericAnims_6_BEBD54AC406649D1C9848292ABAADAC0;            // 0x0000 (size: 0x10)
    TArray<FTakedownAnim> KnockdownAnims_7_7764EEE14CF3B7D28098D7AED4DD5F95;          // 0x0010 (size: 0x10)
    bool KnockdownAnimsMirrorable_23_C24AF92C4795612BE8B63AB244E2749A;                // 0x0020 (size: 0x1)
    TArray<FTakedownAnim> BladeAnims_17_425DE06E400F0740C873C28949FEBFAA;             // 0x0028 (size: 0x10)
    TArray<FTakedownAnim> StaffAnims_19_6856328A477381756DF2CF8645821C3F;             // 0x0038 (size: 0x10)
    TArray<FTakedownAnim> BatAnims_21_D29FCDA74419A201675B3B91B71DD177;               // 0x0048 (size: 0x10)
    TArray<FTakedownAnim> BladeKD_32_76184A134269D867E79F2D9AEA246197;                // 0x0058 (size: 0x10)
    TArray<FTakedownAnim> StaffKD_33_6920261E4EEF6388AD8C2BBBD454BE6D;                // 0x0068 (size: 0x10)
    TArray<FTakedownAnim> BatKD_34_A0B97D1E48E3A423623C4D820DA5293A;                  // 0x0078 (size: 0x10)

}; // Size: 0x88

#endif
