#ifndef UE4SS_SDK_BP_AdvancedPhysicalDetectiveBoard_HPP
#define UE4SS_SDK_BP_AdvancedPhysicalDetectiveBoard_HPP

class ABP_AdvancedPhysicalDetectiveBoard_C : public ABP_PhysicalDetectiveBoard_C
{
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent115; // 0x0330 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent114; // 0x0338 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent113; // 0x0340 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent112; // 0x0348 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent111; // 0x0350 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent110; // 0x0358 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent109; // 0x0360 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent108; // 0x0368 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent107; // 0x0370 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent106; // 0x0378 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent105; // 0x0380 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent104; // 0x0388 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent103; // 0x0390 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent102; // 0x0398 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent101; // 0x03A0 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent100; // 0x03A8 (size: 0x8)
    class USceneComponent* Hideout5Assets;                                            // 0x03B0 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent86; // 0x03B8 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent85; // 0x03C0 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent84; // 0x03C8 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent83; // 0x03D0 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent82; // 0x03D8 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent81; // 0x03E0 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent80; // 0x03E8 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent79; // 0x03F0 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent78; // 0x03F8 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent77; // 0x0400 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent76; // 0x0408 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent75; // 0x0410 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent74; // 0x0418 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent73; // 0x0420 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent72; // 0x0428 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent71; // 0x0430 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent70; // 0x0438 (size: 0x8)
    class USceneComponent* Hideout4Assets;                                            // 0x0440 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent57; // 0x0448 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent68; // 0x0450 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent67; // 0x0458 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent66; // 0x0460 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent65; // 0x0468 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent64; // 0x0470 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent63; // 0x0478 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent62; // 0x0480 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent61; // 0x0488 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent60; // 0x0490 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent59; // 0x0498 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent58; // 0x04A0 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent56; // 0x04A8 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent55; // 0x04B0 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent54; // 0x04B8 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent53; // 0x04C0 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent52; // 0x04C8 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent51; // 0x04D0 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent50; // 0x04D8 (size: 0x8)
    class USceneComponent* Hideout3Assets;                                            // 0x04E0 (size: 0x8)
    class USceneComponent* Hideout2Assets;                                            // 0x04E8 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent28; // 0x04F0 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent27; // 0x04F8 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent26; // 0x0500 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent25; // 0x0508 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent24; // 0x0510 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent23; // 0x0518 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent22; // 0x0520 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent17; // 0x0528 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent20; // 0x0530 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent19; // 0x0538 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent18; // 0x0540 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent32; // 0x0548 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent31; // 0x0550 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent30; // 0x0558 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent29; // 0x0560 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent21; // 0x0568 (size: 0x8)
    class USceneComponent* Hideout1Assets;                                            // 0x0570 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent16; // 0x0578 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent15; // 0x0580 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent14; // 0x0588 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent13; // 0x0590 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent12; // 0x0598 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent11; // 0x05A0 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent10; // 0x05A8 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent9; // 0x05B0 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent; // 0x05B8 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent7; // 0x05C0 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent6; // 0x05C8 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent5; // 0x05D0 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent4; // 0x05D8 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent3; // 0x05E0 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent2; // 0x05E8 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent1; // 0x05F0 (size: 0x8)
    class UBP_DetectiveItemStaticMeshComponent_C* BP_DetectiveItemStaticMeshComponent8; // 0x05F8 (size: 0x8)

    void UpdateDetectiveStaticMesh(class USCAbilitySystemComponent* InAbilityComponent, class UBP_DetectiveItemStaticMeshComponent_C* InMesh);
    void UpdateDetectiveBoardMaterials(class USCAbilitySystemComponent* InAbilityComponent);
}; // Size: 0x600

#endif
