#ifndef UE4SS_SDK_BP_City_Cluster_Dumpster_01_A_1_HPP
#define UE4SS_SDK_BP_City_Cluster_Dumpster_01_A_1_HPP

class ABP_City_Cluster_Dumpster_01_A_1_C : public AActor
{
    class UStaticMeshComponent* SM_DumpsterLid_01_A_1;                                // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* SM_BinBag_01_A_6;                                     // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* SM_BinBag_01_A_5;                                     // 0x02C0 (size: 0x8)
    class UStaticMeshComponent* SM_BinBag_01_A_4;                                     // 0x02C8 (size: 0x8)
    class UStaticMeshComponent* SM_BinBag_01_B_3;                                     // 0x02D0 (size: 0x8)
    class UStaticMeshComponent* SM_BinBag_01_A_3;                                     // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* SM_BinBag_01_A_2;                                     // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* SM_Plank_01_A_2;                                      // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* SM_BinBag_01_B_2;                                     // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* SM_Carpet_01_A_1;                                     // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* SM_Plank_01_A_1;                                      // 0x0300 (size: 0x8)
    class UStaticMeshComponent* SM_Box_01_A_1;                                        // 0x0308 (size: 0x8)
    class UStaticMeshComponent* SM_Box_01_B_1;                                        // 0x0310 (size: 0x8)
    class UStaticMeshComponent* SM_BinBag_01_B_1;                                     // 0x0318 (size: 0x8)
    class UStaticMeshComponent* SM_BinBag_01_A_1;                                     // 0x0320 (size: 0x8)
    class UStaticMeshComponent* SM_Dumpster_01_A_1;                                   // 0x0328 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0330 (size: 0x8)

}; // Size: 0x338

#endif
