#ifndef UE4SS_SDK_BP_Menu_Animations_HPP
#define UE4SS_SDK_BP_Menu_Animations_HPP

class UBP_Menu_Animations_C : public UUserWidget
{
    class UWidgetAnimation* AttacksInfos_contentApparition;                           // 0x0268 (size: 0x8)
    class UWidgetAnimation* BackgroundApparition;                                     // 0x0270 (size: 0x8)
    class UWidgetAnimation* Transition_Show_RightToLeft;                              // 0x0278 (size: 0x8)
    class UWidgetAnimation* Transition_Show_LeftToRight;                              // 0x0280 (size: 0x8)
    class UWidgetAnimation* SubMenu_Transition_Hide_RightToLeft;                      // 0x0288 (size: 0x8)
    class UWidgetAnimation* SubMenu_Transition_Hide_LeftToRight;                      // 0x0290 (size: 0x8)
    class UWidgetAnimation* SubMenu_Transition_Show_RightToLeft;                      // 0x0298 (size: 0x8)
    class UWidgetAnimation* SubMenu_Transition_Show_LeftToRight;                      // 0x02A0 (size: 0x8)
    class UWidgetAnimation* CloseMenu;                                                // 0x02A8 (size: 0x8)
    class UWidgetAnimation* RightPanel_contentApparition;                             // 0x02B0 (size: 0x8)
    class UWidgetAnimation* SubMenu_Transition_DowntoUp;                              // 0x02B8 (size: 0x8)
    class UWidgetAnimation* SubMenu_Transition_UptoDown;                              // 0x02C0 (size: 0x8)
    class UWidgetAnimation* Show;                                                     // 0x02C8 (size: 0x8)
    class UBorder* CharacterStatsWidget;                                              // 0x02D0 (size: 0x8)

}; // Size: 0x2D8

#endif
