#ifndef UE4SS_SDK_BP_Menu_Options_Remapping_Layout_HPP
#define UE4SS_SDK_BP_Menu_Options_Remapping_Layout_HPP

class UBP_Menu_Options_Remapping_Layout_C : public UGameplayOptionsMenu
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0870 (size: 0x8)
    class UWidgetSwitcher* Controller_Switcher;                                       // 0x0878 (size: 0x8)
    class UCanvasPanel* Keyboard_Canvas;                                              // 0x0880 (size: 0x8)
    class UImage* Keyboard_Controller;                                                // 0x0888 (size: 0x8)
    class UCanvasPanel* LIVE_Canvas;                                                  // 0x0890 (size: 0x8)
    class UWBP_SpinBoxEnum_C* Preset;                                                 // 0x0898 (size: 0x8)
    class UOverlay* PS_Additionnal;                                                   // 0x08A0 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* PS_AttackOnEnemyDown;              // 0x08A8 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* PS_Camera;                         // 0x08B0 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* PS_Camera_1;                       // 0x08B8 (size: 0x8)
    class UCanvasPanel* PS_Canvas;                                                    // 0x08C0 (size: 0x8)
    class UImage* PS_Controller;                                                      // 0x08C8 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* PS_DeflectParry;                   // 0x08D0 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* PS_DirDown;                        // 0x08D8 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* PS_DirDown_1;                      // 0x08E0 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* PS_DirLeft;                        // 0x08E8 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* PS_DirLeft_1;                      // 0x08F0 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* PS_DirRight;                       // 0x08F8 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* PS_DirRight_1;                     // 0x0900 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* PS_DirUp;                          // 0x0908 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* PS_DirUp_1;                        // 0x0910 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* PS_Dodge;                          // 0x0918 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* PS_Focus;                          // 0x0920 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* PS_Focus_1;                        // 0x0928 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* PS_Guard;                          // 0x0930 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* PS_HeavyAttack;                    // 0x0938 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* PS_HeavyAttack_1;                  // 0x0940 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* PS_HeavyAttack_2;                  // 0x0948 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* PS_HeavyAttack_3;                  // 0x0950 (size: 0x8)
    class UImage* PS_Inputs;                                                          // 0x0958 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* PS_InteractVault;                  // 0x0960 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* PS_InteractVault_1;                // 0x0968 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* PS_LightAttack;                    // 0x0970 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* PS_LightAttack_1;                  // 0x0978 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* PS_Move;                           // 0x0980 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* PS_Move_1;                         // 0x0988 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* PS_PickUpWeapon;                   // 0x0990 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* PS_Run;                            // 0x0998 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* PS_ThrowWeapon;                    // 0x09A0 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* PS_ThrowWeapon_1;                  // 0x09A8 (size: 0x8)
    class UOverlay* Switch_Additionnal;                                               // 0x09B0 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* Switch_AttackOnEnemyDown_1;        // 0x09B8 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* Switch_Camera;                     // 0x09C0 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* Switch_Camera_1;                   // 0x09C8 (size: 0x8)
    class UCanvasPanel* Switch_Canvas;                                                // 0x09D0 (size: 0x8)
    class UImage* Switch_Controller;                                                  // 0x09D8 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* Switch_DeflectParry;               // 0x09E0 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* Switch_DirDown;                    // 0x09E8 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* Switch_DirDown_1;                  // 0x09F0 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* Switch_DirLeft;                    // 0x09F8 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* Switch_DirLeft_1;                  // 0x0A00 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* Switch_DirRight;                   // 0x0A08 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* Switch_DirRight_1;                 // 0x0A10 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* Switch_DirUp;                      // 0x0A18 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* Switch_DirUp_1;                    // 0x0A20 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* Switch_Dodge;                      // 0x0A28 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* Switch_Focus;                      // 0x0A30 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* Switch_Focus_1;                    // 0x0A38 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* Switch_Guard_1;                    // 0x0A40 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* Switch_HeavyAttack;                // 0x0A48 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* Switch_HeavyAttack_1;              // 0x0A50 (size: 0x8)
    class UImage* Switch_Inputs;                                                      // 0x0A58 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* Switch_InteractVault;              // 0x0A60 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* Switch_InteractVault_1;            // 0x0A68 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* Switch_LightAttack_1;              // 0x0A70 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* Switch_LightAttack_2;              // 0x0A78 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* Switch_Move_1;                     // 0x0A80 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* Switch_Move_2;                     // 0x0A88 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* Switch_PickUpWeapon;               // 0x0A90 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* Switch_Run;                        // 0x0A98 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* Switch_ThrowWeapon;                // 0x0AA0 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* Switch_ThrowWeapon_1;              // 0x0AA8 (size: 0x8)
    class UCanvasPanel* SwitchPADPro_Canvas;                                          // 0x0AB0 (size: 0x8)
    class UOverlay* SwitchPro_Additionnal;                                            // 0x0AB8 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* SwitchPro_AttackOnEnemyDown;       // 0x0AC0 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* SwitchPro_Camera_1;                // 0x0AC8 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* SwitchPro_Camera_2;                // 0x0AD0 (size: 0x8)
    class UImage* SwitchPro_Controller;                                               // 0x0AD8 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* SwitchPro_DeflectParry;            // 0x0AE0 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* SwitchPro_DirDown;                 // 0x0AE8 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* SwitchPro_DirDown_1;               // 0x0AF0 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* SwitchPro_DirLeft;                 // 0x0AF8 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* SwitchPro_DirLeft_1;               // 0x0B00 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* SwitchPro_DirRight;                // 0x0B08 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* SwitchPro_DirRight_1;              // 0x0B10 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* SwitchPro_DirUp;                   // 0x0B18 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* SwitchPro_DirUp_1;                 // 0x0B20 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* SwitchPro_Dodge;                   // 0x0B28 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* SwitchPro_Focus;                   // 0x0B30 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* SwitchPro_Focus_1;                 // 0x0B38 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* SwitchPro_Guard;                   // 0x0B40 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* SwitchPro_HeavyAttack;             // 0x0B48 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* SwitchPro_HeavyAttack_1;           // 0x0B50 (size: 0x8)
    class UImage* SwitchPro_Inputs;                                                   // 0x0B58 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* SwitchPro_InteractVault;           // 0x0B60 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* SwitchPro_InteractVault_1;         // 0x0B68 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* SwitchPro_LightAttack;             // 0x0B70 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* SwitchPro_LightAttack_1;           // 0x0B78 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* SwitchPro_Move;                    // 0x0B80 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* SwitchPro_Move_1;                  // 0x0B88 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* SwitchPro_PickUpWeapon;            // 0x0B90 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* SwitchPro_Run;                     // 0x0B98 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* SwitchPro_ThrowWeapon;             // 0x0BA0 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* SwitchPro_ThrowWeapon_1;           // 0x0BA8 (size: 0x8)
    class UTextBlock* Text_Additional1;                                               // 0x0BB0 (size: 0x8)
    class UTextBlock* Text_Additional1_1;                                             // 0x0BB8 (size: 0x8)
    class UTextBlock* Text_Additional1_2;                                             // 0x0BC0 (size: 0x8)
    class UTextBlock* Text_Additional1_3;                                             // 0x0BC8 (size: 0x8)
    class UTextBlock* Text_Additional1_4;                                             // 0x0BD0 (size: 0x8)
    class UTextBlock* Text_Additional2;                                               // 0x0BD8 (size: 0x8)
    class UTextBlock* Text_Additional2_1;                                             // 0x0BE0 (size: 0x8)
    class UTextBlock* Text_Additional2_2;                                             // 0x0BE8 (size: 0x8)
    class UTextBlock* Text_Additional2_3;                                             // 0x0BF0 (size: 0x8)
    class UTextBlock* Text_Additional2_4;                                             // 0x0BF8 (size: 0x8)
    class UOverlay* XBOX_Additionnal;                                                 // 0x0C00 (size: 0x8)
    class UOverlay* XBOX_Additionnal_1;                                               // 0x0C08 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_AttackOnEnemyDown;            // 0x0C10 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_AttackOnEnemyDown_1;          // 0x0C18 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_Camera;                       // 0x0C20 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_Camera_1;                     // 0x0C28 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_Camera_2;                     // 0x0C30 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_Camera_3;                     // 0x0C38 (size: 0x8)
    class UImage* XBOX_Controller;                                                    // 0x0C40 (size: 0x8)
    class UImage* XBOX_Controller_1;                                                  // 0x0C48 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_DeflectParry;                 // 0x0C50 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_DeflectParry_1;               // 0x0C58 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_DirDown;                      // 0x0C60 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_DirDown_1;                    // 0x0C68 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_DirDown_2;                    // 0x0C70 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_DirDown_3;                    // 0x0C78 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_DirLeft;                      // 0x0C80 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_DirLeft_1;                    // 0x0C88 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_DirLeft_2;                    // 0x0C90 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_DirLeft_3;                    // 0x0C98 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_DirRight;                     // 0x0CA0 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_DirRight_1;                   // 0x0CA8 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_DirRight_2;                   // 0x0CB0 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_DirRight_3;                   // 0x0CB8 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_DirUp;                        // 0x0CC0 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_DirUp_1;                      // 0x0CC8 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_DirUp_2;                      // 0x0CD0 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_DirUp_3;                      // 0x0CD8 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_Dodge;                        // 0x0CE0 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_Dodge_1;                      // 0x0CE8 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_Focus;                        // 0x0CF0 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_Focus_1;                      // 0x0CF8 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_Focus_2;                      // 0x0D00 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_Focus_3;                      // 0x0D08 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_Guard;                        // 0x0D10 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_Guard_1;                      // 0x0D18 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_HeavyAttack;                  // 0x0D20 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_HeavyAttack_1;                // 0x0D28 (size: 0x8)
    class UImage* XBOX_Inputs;                                                        // 0x0D30 (size: 0x8)
    class UImage* XBOX_Inputs_1;                                                      // 0x0D38 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_InteractVault;                // 0x0D40 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_InteractVault_1;              // 0x0D48 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_InteractVault_2;              // 0x0D50 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_InteractVault_3;              // 0x0D58 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_LightAttack;                  // 0x0D60 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_LightAttack_1;                // 0x0D68 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_LightAttack_2;                // 0x0D70 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_LightAttack_3;                // 0x0D78 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_Move;                         // 0x0D80 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_Move_1;                       // 0x0D88 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_Move_2;                       // 0x0D90 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_Move_3;                       // 0x0D98 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_PickUpWeapon;                 // 0x0DA0 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_PickUpWeapon_1;               // 0x0DA8 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_Run;                          // 0x0DB0 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_Run_1;                        // 0x0DB8 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_ThrowWeapon;                  // 0x0DC0 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_ThrowWeapon_1;                // 0x0DC8 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_ThrowWeapon_2;                // 0x0DD0 (size: 0x8)
    class UBP_Menu_Options_Remappin_Action_Text_C* XBOX_ThrowWeapon_3;                // 0x0DD8 (size: 0x8)
    class UCanvasPanel* XINPUT_Canvas;                                                // 0x0DE0 (size: 0x8)
    class UInputMappingWidgetData* Model;                                             // 0x0DE8 (size: 0x8)
    bool IsBlack;                                                                     // 0x0DF0 (size: 0x1)
    TArray<FName> Controller_Lookup;                                                  // 0x0DF8 (size: 0x10)
    int32 Switcher_Index;                                                             // 0x0E08 (size: 0x4)

    void SetBlack(bool Black);
    void ParseChildrenAndSetBlack(bool Black, TArray<class UWidget*>& NewParam);
    void GetMapping();
    void PreConstruct(bool IsDesignTime);
    void Construct();
    void BPE_OnDataUpdated();
    void ExecuteUbergraph_BP_Menu_Options_Remapping_Layout(int32 EntryPoint);
}; // Size: 0xE0C

#endif
