#ifndef UE4SS_SDK_BP_Tuto_Window_HPP
#define UE4SS_SDK_BP_Tuto_Window_HPP

class UBP_Tuto_Window_C : public UUserWidget
{
    class UBP_Btn_Input_C* BP_Button_InputIcon;                                       // 0x0268 (size: 0x8)
    class UBP_Btn_Input_C* BP_Button_InputIcon1;                                      // 0x0270 (size: 0x8)
    class UBP_Btn_Input_C* BP_Button_InputIcon2;                                      // 0x0278 (size: 0x8)
    class UBP_Btn_Input_C* BP_Button_InputIcon3;                                      // 0x0280 (size: 0x8)
    class UBP_Btn_Input_C* BP_Button_InputIcon_Add1;                                  // 0x0288 (size: 0x8)
    class UBP_Btn_Input_C* BP_Button_InputIcon_Add2;                                  // 0x0290 (size: 0x8)
    class UBP_Btn_Input_C* BP_Button_InputIcon_Add3;                                  // 0x0298 (size: 0x8)
    class UHorizontalBox* HorizontalBox_6;                                            // 0x02A0 (size: 0x8)
    class UHorizontalBox* HorizontalBox_7;                                            // 0x02A8 (size: 0x8)
    class UHorizontalBox* HorizontalBox_8;                                            // 0x02B0 (size: 0x8)
    class UImage* Image1;                                                             // 0x02B8 (size: 0x8)
    class UImage* Image2;                                                             // 0x02C0 (size: 0x8)
    class UTextBlock* Text_Add;                                                       // 0x02C8 (size: 0x8)
    class UTextBlock* TextBlock_1;                                                    // 0x02D0 (size: 0x8)
    class UTextBlock* TextBlock_4;                                                    // 0x02D8 (size: 0x8)
    class UTextBlock* TextBlock_7;                                                    // 0x02E0 (size: 0x8)
    class UTextBlock* TextBlock_8;                                                    // 0x02E8 (size: 0x8)
    class UTextBlock* TextBlock_9;                                                    // 0x02F0 (size: 0x8)
    class UTextBlock* TextBlock_10;                                                   // 0x02F8 (size: 0x8)
    class UTextBlock* TextBlock_11;                                                   // 0x0300 (size: 0x8)
    FText Text1;                                                                      // 0x0308 (size: 0x18)
    FText Text2_Input1;                                                               // 0x0320 (size: 0x18)
    FText Text3;                                                                      // 0x0338 (size: 0x18)
    FText Text2_Input2;                                                               // 0x0350 (size: 0x18)
    FText Text2_Input3;                                                               // 0x0368 (size: 0x18)
    bool Input1_LeftDisplay;                                                          // 0x0380 (size: 0x1)
    bool Input1_RightDisplay;                                                         // 0x0381 (size: 0x1)
    bool Input2_LeftDisplay;                                                          // 0x0382 (size: 0x1)
    bool Input2_RightDisplay;                                                         // 0x0383 (size: 0x1)
    bool Input3_LeftDisplay;                                                          // 0x0384 (size: 0x1)
    bool Input3_RightDisplay;                                                         // 0x0385 (size: 0x1)

    ESlateVisibility GetVisibility_5();
    ESlateVisibility GetVisibility_3();
    ESlateVisibility GetVisibility_2();
    ESlateVisibility GetVisibility_1();
    ESlateVisibility GetVisibility_0();
    ESlateVisibility Get_BP_Button_InputIcon_C_8_Visibility_0();
    ESlateVisibility Get_BP_Button_InputIcon_C_6_Visibility_0();
    ESlateVisibility Get_BP_Button_InputIcon_C_4_Visibility_0();
    ESlateVisibility Get_TextBlock_10_Visibility_0();
    ESlateVisibility Get_BP_Button_InputIcon_C_7_Visibility_0();
    ESlateVisibility Get_TextBlock_8_Visibility_0();
    ESlateVisibility Get_BP_Button_InputIcon_C_5_Visibility_0();
    ESlateVisibility Get_Text_Add_Visibility_0();
    ESlateVisibility Get_BP_Button_InputIcon_Add_Visibility_0();
}; // Size: 0x386

#endif
