#ifndef UE4SS_SDK_Sifu_HPP
#define UE4SS_SDK_Sifu_HPP

#include "Sifu_enums.hpp"

struct FAIActionAttackClassInstance
{
    TSubclassOf<class UAIActionAttack> m_DefaultClassObject;                          // 0x0000 (size: 0x8)
    class UAIActionAttack* m_Instance;                                                // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FAIActionReaction : public FAIConditionedAction
{
    float m_fTestFrequency;                                                           // 0x0038 (size: 0x4)
    bool m_bCanCancelPendingActions;                                                  // 0x003C (size: 0x1)
    bool m_bOnlyWhenAlerted;                                                          // 0x003D (size: 0x1)

}; // Size: 0x40

struct FAIActionTraversalMemory : public FSCAIActionMemoryEntry
{
}; // Size: 0x28

struct FAIActionWallJumpAttackMemory : public FSCAIActionMemoryEntry
{
}; // Size: 0xA0

struct FAIArchetypeBankRow : public FTableRowBase
{
    EAIArchetype m_eAIArchetype;                                                      // 0x0008 (size: 0x1)
    TArray<FAICharacterSpawnParams> m_SpawnParams;                                    // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FAIAttackHitDetectionCone
{
    FFloatRange m_fRange;                                                             // 0x0000 (size: 0x10)
    float m_fAngle;                                                                   // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FAIAttackHitDetectionVolume
{
    TArray<FAIAttackHitDetectionCone> m_RangedCones;                                  // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FAIAttackJokerSituationConfig
{
    bool m_bEnabled;                                                                  // 0x0000 (size: 0x1)
    float m_fJokerDuration;                                                           // 0x0004 (size: 0x4)
    float m_fCooldown;                                                                // 0x0008 (size: 0x4)
    bool m_bShouldBeDeactivatedByTargetAttack;                                        // 0x000C (size: 0x1)
    EAIJokerBehaviorAgainstAttacks m_eJokerBehaviorOnAIAttacks;                       // 0x000D (size: 0x1)
    FSCAITicketEnum m_FallbackTicket;                                                 // 0x0010 (size: 0x50)

}; // Size: 0x60

struct FAIAttackJokerSituationConfigsPerDominationStep
{
    FAIAttackJokerSituationConfig m_Configs;                                          // 0x0000 (size: 0x180)

}; // Size: 0x180

struct FAIAttackReaction
{
    TArray<class UComboTransitionCondition*> m_Conditions;                            // 0x0000 (size: 0x10)
    TArray<FAIConditionClassInstance> m_ConditionsArray;                              // 0x0010 (size: 0x10)
    bool m_bCanInterruptMoveToAttack;                                                 // 0x0020 (size: 0x1)
    bool m_bCanInterruptAttackWhenAvailable;                                          // 0x0021 (size: 0x1)
    bool m_bCanEndComboAfterOnGoingAttack;                                            // 0x0022 (size: 0x1)
    bool m_bCanInterruptPassiveTicket;                                                // 0x0023 (size: 0x1)
    FSCAITicketEnum m_TicketNameEnumValue;                                            // 0x0028 (size: 0x50)

}; // Size: 0x78

struct FAICancelCondition
{
    float m_fTestFrequency;                                                           // 0x0000 (size: 0x4)
    FAIConditionClassInstance m_condition;                                            // 0x0008 (size: 0x10)
    bool m_bInvert;                                                                   // 0x0018 (size: 0x1)

}; // Size: 0x20

struct FAICharacterSpawnParams
{
    FName m_ParamsName;                                                               // 0x0000 (size: 0x8)
    TSubclassOf<class ABaseCharacter> m_SpawningClass;                                // 0x0008 (size: 0x8)
    class UAIPhaseScenario* m_PhaseScenarios;                                         // 0x0010 (size: 0x18)
    TArray<FCarriedProps> m_carriedProps;                                             // 0x0028 (size: 0x10)
    TSubclassOf<class ABaseWeapon> m_carriedWeapon;                                   // 0x0038 (size: 0x8)
    FName m_CharacterPoolName;                                                        // 0x0040 (size: 0x8)
    FName m_CarriedWeaponPoolName;                                                    // 0x0048 (size: 0x8)
    FName m_CustomImpostorName;                                                       // 0x0050 (size: 0x8)

}; // Size: 0x58

struct FAIComboLaunchParameters
{
    bool m_bCheckCanAttack;                                                           // 0x0000 (size: 0x1)
    bool m_bCheckTicketAvailable;                                                     // 0x0001 (size: 0x1)
    FSCAITicketEnum m_Ticket;                                                         // 0x0008 (size: 0x50)
    bool m_bMoveToTargetRange;                                                        // 0x0058 (size: 0x1)
    class AActor* m_Target;                                                           // 0x0060 (size: 0x8)
    int32 m_iRepeats;                                                                 // 0x0068 (size: 0x4)
    bool m_bCancelPendingActions;                                                     // 0x006C (size: 0x1)
    bool m_bTestInputActionAvailable;                                                 // 0x006D (size: 0x1)

}; // Size: 0x80

struct FAIConditionClassInstance
{
    TSubclassOf<class UComboTransitionCondition> m_DefaultClassObject;                // 0x0000 (size: 0x8)
    class UComboTransitionCondition* m_Instance;                                      // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FAIConditionTraceOffset
{
    EAIConditionTraceOffsetContext m_eRelativeTo;                                     // 0x0000 (size: 0x1)
    FVector m_vOffset;                                                                // 0x0004 (size: 0xC)

}; // Size: 0x10

struct FAIConditionedAction
{
    TArray<class UComboTransitionCondition*> m_Conditions;                            // 0x0000 (size: 0x10)
    TSubclassOf<class USCAiAction> m_ActionClass;                                     // 0x0010 (size: 0x8)
    TArray<FAIConditionClassInstance> m_ConditionsArray;                              // 0x0018 (size: 0x10)
    FSCAiActionClassInstance m_Action;                                                // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FAIConditionedActionArray
{
    TArray<FAIConditionedAction> m_Actions;                                           // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FAICustomBehaviorTree
{
    FGameplayTag m_DynamicBehaviorGameplayTag;                                        // 0x0000 (size: 0x8)
    class UBehaviorTree* m_BehaviorToUse;                                             // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FAICustomBehaviorTreeList
{
    TArray<FAICustomBehaviorTree> m_DynamicBehaviorList;                              // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FAIDebugSpawnerInstance
{
    class AAISpawner* m_Spawner;                                                      // 0x0000 (size: 0x8)
    class UArchetypeAsset* m_Archetype;                                               // 0x0008 (size: 0x8)

}; // Size: 0x28

struct FAIDefenseTargetAttackInfos
{
    EAIDefendedAttackType m_eType;                                                    // 0x0000 (size: 0x1)
    uint8 m_uiHitBoxIndex;                                                            // 0x0001 (size: 0x1)
    uint8 m_uiOrderID;                                                                // 0x0002 (size: 0x1)

}; // Size: 0xC

struct FAIDifficultyLevel
{
    FName m_DifficultyName;                                                           // 0x0000 (size: 0x8)
    FInt32Range m_DifficultyGaugeRange;                                               // 0x0008 (size: 0x10)
    float m_fDifficultyVariationMultFactor;                                           // 0x0018 (size: 0x4)
    class UCombo* m_Combo;                                                            // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FAIDominationGaugeSteps
{
    float m_Steps;                                                                    // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FAIInfo
{
}; // Size: 0x1

struct FAILocalizedConditionedAction : public FAIConditionedAction
{
    FSCMathExpressionFloat m_DistanceTestExpression;                                  // 0x0038 (size: 0x20)

}; // Size: 0x58

struct FAIPhaseNodeHardLink : public FAIPhaseNodeLink
{
    class UAIPhaseScenario* m_Scenario;                                               // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FAIPhaseNodeLink
{
    FGuid m_Guid;                                                                     // 0x0000 (size: 0x10)
    FName m_Name;                                                                     // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FAIPhaseNodeSoftLink : public FAIPhaseNodeLink
{
    TSoftObjectPtr<UAIPhaseScenario> m_PhaseScenario;                                 // 0x0018 (size: 0x28)

}; // Size: 0x40

struct FAIPhaseNodeSoftLinkByMCDomination
{
    FAIPhaseNodeSoftLink m_PhaseLink;                                                 // 0x0000 (size: 0x40)
    uint32 m_uiMCDominationFlags;                                                     // 0x0040 (size: 0x4)

}; // Size: 0x48

struct FAIPhaseTransitionData
{
    int32 m_iNewPhase;                                                                // 0x0000 (size: 0x4)
    int32 m_iPreviousPhase;                                                           // 0x0004 (size: 0x4)
    FName m_ArchetypeName;                                                            // 0x0008 (size: 0x8)
    class ALevelSequenceActor* m_SequenceActor;                                       // 0x0010 (size: 0x8)

}; // Size: 0x40

struct FAIPositionningPOI
{
    FFloatRange m_EnemyDistanceRange;                                                 // 0x0000 (size: 0x10)
    float m_fEnemyDistanceZTolerance;                                                 // 0x0010 (size: 0x4)
    bool m_bUseRotation;                                                              // 0x0014 (size: 0x1)
    bool m_bKeepLockMoveOnWayToPOI;                                                   // 0x0015 (size: 0x1)
    bool m_bCanUseAttackTickets;                                                      // 0x0016 (size: 0x1)
    bool m_bCanBecomeDirectOpponent;                                                  // 0x0017 (size: 0x1)
    bool m_bJiggle;                                                                   // 0x0018 (size: 0x1)
    int32 m_eCombatRolesMask;                                                         // 0x001C (size: 0x4)
    float m_fCooldownWhenOccupantLeaves;                                              // 0x0020 (size: 0x4)
    FSCGestureContainer m_GestureAnimations;                                          // 0x0028 (size: 0x10)
    ESCAICombatRoles m_eRoleOnTargetCloserToMinRange;                                 // 0x0038 (size: 0x1)

}; // Size: 0x60

struct FAIRangePerCircleIndex
{
    TMap<int32, FFloatRange> m_RangePerCircle;                                        // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FAIResistanceActions
{
    TArray<FAITimedConditionedAction> m_OnTick;                                       // 0x0000 (size: 0x10)
    TArray<FAIConditionedAction> m_OnEnd;                                             // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FAISituationNamedActor
{
    FName m_Name;                                                                     // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FAISpawnedDescription
{
    uint8 m_uiSpawnerGroupIndex;                                                      // 0x0000 (size: 0x1)
    int32 m_iSpawnerIndexInLayer;                                                     // 0x0004 (size: 0x4)
    bool m_bKilled;                                                                   // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FAISuperDizzyParams
{
    bool m_bCanBeSuperDizzy;                                                          // 0x0000 (size: 0x1)
    float m_fSuperDizzyResistance;                                                    // 0x0004 (size: 0x4)
    float m_fSuperDizzyRecoveryCooldown;                                              // 0x0008 (size: 0x4)
    float m_fSuperDizzyRecoveryCooldownWhenComplete;                                  // 0x000C (size: 0x4)
    float m_fSuperDizzyGaugeRatioAfterSuperDizzy;                                     // 0x0010 (size: 0x4)
    float m_fSuperDizzyRecoveryPerSec;                                                // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FAITicketCooldowns
{
    FTimerAndOffset m_Cooldowns;                                                      // 0x0000 (size: 0x20)

}; // Size: 0x20

struct FAITimedConditionedAction
{
    FFloatRange m_TimeRange;                                                          // 0x0000 (size: 0x10)
    FAIConditionedAction m_Action;                                                    // 0x0010 (size: 0x38)

}; // Size: 0x48

struct FAIWaveBucketDescription
{
    int32 m_iNumberInBucket;                                                          // 0x0000 (size: 0x4)
    int32 m_iMaxInCombat;                                                             // 0x0004 (size: 0x4)
    TArray<FAIWeaponBucketDescription> m_WeaponBuckets;                               // 0x0008 (size: 0x10)
    FInt32Range m_iWeaponSpawnFrequency;                                              // 0x0018 (size: 0x10)

}; // Size: 0x40

struct FAIWaveParams
{
    FName m_WaveName;                                                                 // 0x0000 (size: 0x8)
    TMap<class EAIArchetype, class FAIWaveBucketDescription> m_ArchetypesBuckets;     // 0x0008 (size: 0x50)
    FInt32Range m_iMinMaxInCombat;                                                    // 0x0058 (size: 0x10)
    EStartWaveType m_eStartWaveType;                                                  // 0x0068 (size: 0x1)
    FGameplayTag m_WaveTag;                                                           // 0x006C (size: 0x8)
    FGameplayTagContainer m_WaveTags;                                                 // 0x0078 (size: 0x20)
    FFloatRange m_fDelayBeforeWave;                                                   // 0x0098 (size: 0x10)
    TSoftObjectPtr<AAISituationActor> m_RelatedAISituation;                           // 0x00A8 (size: 0x28)

}; // Size: 0xD0

struct FAIWaveParamsRow : public FTableRowBase
{
    TMap<class EAIArchetype, class FAIWaveBucketDescription> m_ArchetypesBuckets;     // 0x0008 (size: 0x50)
    int32 m_iMaxAIInCombatDuringWave;                                                 // 0x0058 (size: 0x4)

}; // Size: 0x60

struct FAIWeaponBucketDescription
{
    TSubclassOf<class ABaseWeapon> m_WeaponClass;                                     // 0x0000 (size: 0x8)
    int32 m_iWeaponNumber;                                                            // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FAIWeaponInfo
{
    class UWeaponInfoForAIDataAsset* m_WeaponInfoForAI;                               // 0x0000 (size: 0x8)
    bool m_bCanFetch;                                                                 // 0x0008 (size: 0x1)
    bool m_bUseThiWeaponAtStart;                                                      // 0x0009 (size: 0x1)
    bool m_bWeaponShouldBreakWhenDropped;                                             // 0x000A (size: 0x1)
    bool m_bWeaponShouldRegenerateAfterThrown;                                        // 0x000B (size: 0x1)
    bool m_bWeaponCanTakeDamage;                                                      // 0x000C (size: 0x1)
    FWeaponOverrideInfo m_WeaponOverride;                                             // 0x0010 (size: 0x118)

}; // Size: 0x128

struct FAbandoningAnimations
{
    FAnimContainer m_GoingDown;                                                       // 0x0000 (size: 0x18)
    FAnimContainer m_Loop;                                                            // 0x0018 (size: 0x18)

}; // Size: 0x30

struct FAbilityDelegateHandler
{
    TArray<FAbilityDelegateHandler_OnActivated> m_OnActivated;                        // 0x0000 (size: 0x10)
    TArray<FAbilityDelegateHandler_OnDeactivated> m_OnDeactivated;                    // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FAbsorbWindow
{
    FFrameRange m_FrameRange;                                                         // 0x0000 (size: 0x10)
    int32 m_iAbsorbID;                                                                // 0x0010 (size: 0x4)
    class UAbsorbPropertyDB* m_AbsorbPropertyDB;                                      // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FActionConditions
{
    bool bAllowedOnEmptyGauge;                                                        // 0x0000 (size: 0x1)
    bool bAllowedOnBrokenGuard;                                                       // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FActionMappingCompatibilityRule
{
    EInputMappingCompatibilityRuleType m_eRule;                                       // 0x0000 (size: 0x4)
    TSet<InputAction> m_Actions;                                                      // 0x0008 (size: 0x50)

}; // Size: 0x58

struct FAddVariableWeightInfo
{
    FName m_Name;                                                                     // 0x0000 (size: 0x8)
    bool m_bMirror;                                                                   // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FAimOffsetStruct
{
    class UAimOffsetBlendSpace* m_aimOffset;                                          // 0x0000 (size: 0x8)
    bool m_bMirror;                                                                   // 0x0008 (size: 0x1)
    float m_fMaxHeadDiffYaw;                                                          // 0x000C (size: 0x4)
    float m_fMaxHeadDiffPitch;                                                        // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FAlternativeAttackComboDB
{
    FName m_Attacks;                                                                  // 0x0000 (size: 0x20)

}; // Size: 0x20

struct FAlternativeAttackComboRealNamesDB
{
    FText m_Attacks;                                                                  // 0x0000 (size: 0x60)

}; // Size: 0x60

struct FAlwaysCollidingActions
{
    TArray<InputAction> m_Actions;                                                    // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FAnalogInputSequenceStep
{
    FFloatRange m_SizeTolerance;                                                      // 0x0000 (size: 0x10)
    FFloatRange m_VelocityFromRefDirTolerance;                                        // 0x0010 (size: 0x10)
    bool m_bAbsAngle;                                                                 // 0x0020 (size: 0x1)
    FFloatRange m_AngleDegTolerance;                                                  // 0x0024 (size: 0x10)
    FFloatRange m_fHoldDuration;                                                      // 0x0034 (size: 0x10)
    float m_fMaxValidityDuration;                                                     // 0x0044 (size: 0x4)
    bool m_bIsReferenceDirection;                                                     // 0x0048 (size: 0x1)
    EAnalogInputReferenceDirection m_eReferenceDirBehavior;                           // 0x0049 (size: 0x1)
    bool m_bIsResultDirection;                                                        // 0x004A (size: 0x1)
    bool m_bParallelizeOnValidation;                                                  // 0x004B (size: 0x1)

}; // Size: 0x4C

struct FAngleRange
{
    float m_fMinAngle;                                                                // 0x0000 (size: 0x4)
    float m_fAngleSize;                                                               // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FAnimByCardinalThenHeight
{
    FAnimByHeight m_Array;                                                            // 0x0000 (size: 0x60)

}; // Size: 0x60

struct FAnimByHeight
{
    class UAnimSequence* m_Array;                                                     // 0x0000 (size: 0x18)

}; // Size: 0x18

struct FAnimInfo
{
    bool m_bActionInProgress;                                                         // 0x0000 (size: 0x1)
    EWeaponAnimType m_eWeaponAnimType;                                                // 0x0001 (size: 0x1)
    class UAnimSequence* m_AnimToPlay;                                                // 0x0008 (size: 0x8)
    class UBlendSpaceBase* m_BlendSpaceToPlay;                                        // 0x0010 (size: 0x8)
    FVector m_vBlendSpaceValue;                                                       // 0x0018 (size: 0xC)
    float m_fPlayRate;                                                                // 0x0024 (size: 0x4)
    bool m_bMirror;                                                                   // 0x0028 (size: 0x1)
    bool m_bWeaponInFakieAtStart;                                                     // 0x0029 (size: 0x1)
    float m_fStartRatio;                                                              // 0x002C (size: 0x4)
    bool m_bLoop;                                                                     // 0x0030 (size: 0x1)
    float m_fBlendSpaceAngle;                                                         // 0x0034 (size: 0x4)
    float m_fOwnerVelocityLength;                                                     // 0x0038 (size: 0x4)

}; // Size: 0x40

struct FAnimQuadrantStruct
{
    bool m_bIsInFrontLeft;                                                            // 0x0000 (size: 0x1)
    bool m_bIsInFrontRight;                                                           // 0x0001 (size: 0x1)
    bool m_bIsInBackRight;                                                            // 0x0002 (size: 0x1)
    bool m_bIsInBackLeft;                                                             // 0x0003 (size: 0x1)

}; // Size: 0x4

struct FAnimSequenceDBCache
{
    TMap<class TSubclassOf<ABaseWeapon>, class UAnimSequenceEntryDB*> m_Sequences;    // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FAnimSequenceDBEntry
{
    class UAnimSequence* m_AnimSequence;                                              // 0x0000 (size: 0x8)
    FText m_DisplayText;                                                              // 0x0008 (size: 0x18)
    TArray<float> m_Positions;                                                        // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FAnimStruct4
{
    bool m_bInProgress1;                                                              // 0x0008 (size: 0x1)
    bool m_bInProgress2;                                                              // 0x0009 (size: 0x1)
    bool m_bInProgress3;                                                              // 0x000A (size: 0x1)
    bool m_bInProgress4;                                                              // 0x000B (size: 0x1)
    bool m_bInProgress1Or2Or3Or4;                                                     // 0x000C (size: 0x1)
    FVariableWeightInfo m_variableWeightLayers1;                                      // 0x0010 (size: 0x20)
    FVariableWeightInfo m_variableWeightLayers2;                                      // 0x0030 (size: 0x20)
    FVariableWeightInfo m_variableWeightLayers3;                                      // 0x0050 (size: 0x20)
    FVariableWeightInfo m_variableWeightLayers4;                                      // 0x0070 (size: 0x20)

}; // Size: 0x90

struct FAnimStructAttack : public FAnimStructBase
{
    bool m_bStartBlendOut1;                                                           // 0x0088 (size: 0x1)
    bool m_bStartBlendOut2;                                                           // 0x0089 (size: 0x1)

}; // Size: 0x90

struct FAnimStructBase : public FSwapperStructBase
{
    FAnimContainer m_AnimContainer1;                                                  // 0x0058 (size: 0x18)
    FAnimContainer m_AnimContainer2;                                                  // 0x0070 (size: 0x18)

}; // Size: 0x90

struct FAnimStructDeath : public FAnimStructBase
{
    bool m_bCancelled;                                                                // 0x0088 (size: 0x1)

}; // Size: 0x90

struct FAnimStructEmote : public FAnimStructBase
{
}; // Size: 0x90

struct FAnimStructHandPose : public FAnimStructBase
{
    EHandPoseBlendInTypes m_eHandPoseBlendInType1;                                    // 0x0088 (size: 0x1)
    EHandPoseBlendInTypes m_eHandPoseBlendInType2;                                    // 0x0089 (size: 0x1)
    EHandPoseBlendOutTypes m_eHandPoseBlendOutType1;                                  // 0x008A (size: 0x1)
    EHandPoseBlendOutTypes m_eHandPoseBlendOutType2;                                  // 0x008B (size: 0x1)

}; // Size: 0x90

struct FAnimStructItemUse : public FAnimStructBase
{
}; // Size: 0x90

struct FAnimStructMoveTransition : public FAnimStructBase
{
    EMoveTransitionType m_eTransitionType1;                                           // 0x0088 (size: 0x1)
    EMoveTransitionType m_eTransitionType2;                                           // 0x0089 (size: 0x1)

}; // Size: 0x90

struct FAnimStructOverride : public FAnimStructBase
{
    int32 m_iAnimIndex;                                                               // 0x0088 (size: 0x4)

}; // Size: 0x90

struct FAnimStructSpawn : public FAnimStructBase
{
    float m_fPlayRate;                                                                // 0x0088 (size: 0x4)

}; // Size: 0x90

struct FAnimStructTraversal
{
    bool m_bTraversalInProgress;                                                      // 0x0000 (size: 0x1)
    ETraversalPhase m_eTraversalPhase;                                                // 0x0001 (size: 0x1)
    FAnimContainer m_animationContainersPerPhase;                                     // 0x0008 (size: 0x78)

}; // Size: 0x80

struct FAnimStructVariableWeight : public FAnimStructBase
{
}; // Size: 0x90

struct FAnimStructWeaponAction : public FAnimStructBase
{
}; // Size: 0x90

struct FAnimSyncContainer
{
    FAnimContainer m_InstigatorAnim;                                                  // 0x0000 (size: 0x18)
    FAnimContainer m_VictimAnim;                                                      // 0x0018 (size: 0x18)

}; // Size: 0x30

struct FAppliedDeflectImpact : public FAppliedHitImpact
{
    class UCurveFloat* m_KnockBackDynamic;                                            // 0x0018 (size: 0x8)
    float m_fSelfStructureDamage;                                                     // 0x0020 (size: 0x4)
    float m_fSelfSuperDizzyDamage;                                                    // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FAppliedHitImpact
{
    float m_fDamage;                                                                  // 0x0000 (size: 0x4)
    float m_fStructureDamage;                                                         // 0x0004 (size: 0x4)
    float m_fSuperDizzyDamage;                                                        // 0x0008 (size: 0x4)
    uint8 m_iNbFrameStuned;                                                           // 0x000C (size: 0x1)
    bool m_bUseKnockBackDistance;                                                     // 0x000D (size: 0x1)
    float m_fKnockBackDistance;                                                       // 0x0010 (size: 0x4)
    int32 m_iFreezeFrames;                                                            // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FApplyImpactStruct
{
    FHitDescription m_hitDescription;                                                 // 0x0000 (size: 0x568)
    bool m_bUseForcedHittedAnim;                                                      // 0x0568 (size: 0x1)
    FHittedAnimContainer m_ForcedAnim;                                                // 0x0570 (size: 0x68)
    bool m_bPlayOrderHitted;                                                          // 0x05D8 (size: 0x1)
    bool m_bEnterRagdoll;                                                             // 0x05D9 (size: 0x1)
    bool m_bDropWeaponOnDeath;                                                        // 0x05DA (size: 0x1)
    bool m_bPlayOrderFightingState;                                                   // 0x05DB (size: 0x1)
    uint8 m_uiPlayFightingStateOrderAfter;                                            // 0x05DC (size: 0x1)
    class UAttackPropertiesResistanceDB* m_specialResistanceDB;                       // 0x05E0 (size: 0x8)
    uint8 m_uiSpecificOrderIDToPlayBeforeFightingStateOrder;                          // 0x05E8 (size: 0x1)
    bool m_bUseForcedFightingStateAnim;                                               // 0x05E9 (size: 0x1)
    FAnimContainer m_ForcedFightingStateAnim;                                         // 0x05F0 (size: 0x18)
    bool m_bInstantPlayStructureBrokenOrder;                                          // 0x0608 (size: 0x1)
    bool m_bUseForcedFightingStateRecoveryAnim;                                       // 0x0609 (size: 0x1)
    FAnimContainer m_ForcedFightingStateAnimRecovery;                                 // 0x0610 (size: 0x18)
    bool m_bUseForceMirrorFightingState;                                              // 0x0628 (size: 0x1)
    bool m_bForceMirrorFightingState;                                                 // 0x0629 (size: 0x1)
    bool m_bNotifyInstigator;                                                         // 0x062A (size: 0x1)

}; // Size: 0x630

struct FArchetypeSituationDescription
{
    class UArchetypeAsset* m_Archetype;                                               // 0x0000 (size: 0x8)
    int32 m_iLevelMin;                                                                // 0x0008 (size: 0x4)
    int32 m_iLevelMax;                                                                // 0x000C (size: 0x4)
    uint8 m_uiWeightLevel;                                                            // 0x0010 (size: 0x1)
    uint32 m_uiAppearanceProbabilities;                                               // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FArenaBatch
{
    TArray<class TSubclassOf<UArenaChallengeDescription>> m_ChallengesList;           // 0x0000 (size: 0x10)
    FText m_Name;                                                                     // 0x0010 (size: 0x18)
    FGameplayTag m_IdentifierTag;                                                     // 0x0028 (size: 0x8)
    FGameplayTag m_ContentRestrictionTag;                                             // 0x0030 (size: 0x8)
    int32 m_iStarsCountToUnlock;                                                      // 0x0038 (size: 0x4)
    FGameplayTag m_WorldMapPathTag;                                                   // 0x003C (size: 0x8)

}; // Size: 0x48

struct FArenaBatchProgressionInfo
{
    int32 m_iCurrentStarsCount;                                                       // 0x0000 (size: 0x4)
    int32 m_iTotalStarsCount;                                                         // 0x0004 (size: 0x4)
    bool m_bIsUnlocked;                                                               // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FArenaChallengeRefillDescription
{
    TSoftObjectPtr<AAIWaveRefillDirector> m_RefillDirector;                           // 0x0000 (size: 0x28)
    TArray<FAIWaveParams> m_Waves;                                                    // 0x0028 (size: 0x10)
    TSoftObjectPtr<UDataTable> m_ArchetypeBank;                                       // 0x0038 (size: 0x28)
    bool m_bUseDistanceForSpawnerEvaluation;                                          // 0x0060 (size: 0x1)
    FFloatRange m_fDistanceRangeForSpawnerScore;                                      // 0x0064 (size: 0x10)

}; // Size: 0x78

struct FArenaChallengeSave
{
    int32 m_iHighScore;                                                               // 0x0000 (size: 0x4)
    int32 m_iBestStarCount;                                                           // 0x0004 (size: 0x4)
    bool m_bHasBeenSeen;                                                              // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FArenaParams
{
    TArray<class TSubclassOf<UArenaChallengeDescription>> m_ChallengesList;           // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FArenaProgressionInfo
{
    int32 m_iCurrentStarsCount;                                                       // 0x0000 (size: 0x4)
    int32 m_iTotalStarsCount;                                                         // 0x0004 (size: 0x4)
    TArray<FArenaBatchProgressionInfo> m_ArenaBatchesInfo;                            // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAsyncTextureStruct
{
    TSoftObjectPtr<UTexture2D> m_AsyncAsset;                                          // 0x0000 (size: 0x28)

}; // Size: 0x28

struct FAttackComboDB
{
    FMainAttackComboDB m_MainAttacksComboDB;                                          // 0x0000 (size: 0x80)
    FAlternativeAttackComboDB m_AlternativeAttacksComboDB;                            // 0x0080 (size: 0xA0)

}; // Size: 0x120

struct FAttackComboRealNamesDB
{
    FMainAttackComboRealNamesDB m_MainAttacksComboNamesDB;                            // 0x0000 (size: 0x80)
    FAlternativeAttackComboRealNamesDB m_AlternativeAttacksComboNamesDB;              // 0x0080 (size: 0x1E0)

}; // Size: 0x260

struct FAttackDataRow : public FBaseAttackDataRow
{
    TSoftObjectPtr<UAnimationAsset> m_Anim;                                           // 0x0028 (size: 0x28)
    bool m_bCanBeMirrored;                                                            // 0x0050 (size: 0x1)
    EAttackMirroringMethod m_eMirroringMethod;                                        // 0x0054 (size: 0x4)
    float m_fMirrorUseNextFootMarkerThreshold;                                        // 0x0058 (size: 0x4)
    EQuadrantTypes m_eStartQuadrant;                                                  // 0x005C (size: 0x1)
    EQuadrantTypes m_eEndQuadrant;                                                    // 0x005D (size: 0x1)
    float m_fMeasuredForwardMovement;                                                 // 0x0060 (size: 0x4)
    float m_fMovementRightLength;                                                     // 0x0064 (size: 0x4)
    bool m_bDirectRightMovementFollow;                                                // 0x0068 (size: 0x1)
    int32 m_iLastBuildupFrame;                                                        // 0x006C (size: 0x4)
    float m_fHitFrame;                                                                // 0x0070 (size: 0x4)
    bool m_bStrikelessAttack;                                                         // 0x0074 (size: 0x1)

}; // Size: 0x78

struct FAttackFilter
{
    EQuadrantTypes m_eStartQuadrant;                                                  // 0x0000 (size: 0x1)
    EQuadrantTypes m_eEndQuadrant;                                                    // 0x0001 (size: 0x1)
    bool m_bIsAlternativeAttack;                                                      // 0x0002 (size: 0x1)
    bool m_bExcludeUsedAttacks;                                                       // 0x0003 (size: 0x1)
    FName m_AllowedAttack;                                                            // 0x0004 (size: 0x8)
    bool m_bIgnoreUknownAttacks;                                                      // 0x000C (size: 0x1)
    bool m_bIgnoreLearningAttacks;                                                    // 0x000D (size: 0x1)
    bool m_bIgnoreUnlockedAttacks;                                                    // 0x000E (size: 0x1)
    bool m_bExcludeOtherWeaponFamilies;                                               // 0x000F (size: 0x1)
    bool m_bNewAttacksOnly;                                                           // 0x0010 (size: 0x1)
    int32 m_iAttackStyle;                                                             // 0x0014 (size: 0x4)
    int32 m_iSpecialAbilityMask;                                                      // 0x0018 (size: 0x4)
    bool m_bIgnoreMirrored;                                                           // 0x001C (size: 0x1)
    EAttackLearningState m_eLearningState;                                            // 0x001D (size: 0x1)

}; // Size: 0x20

struct FAttackHitRequest : public FHitRequest
{
}; // Size: 0x418

struct FAttackIKLimbProfiles
{
    FAttackIKProfileInfos m_Profiles;                                                 // 0x0000 (size: 0xB0)

}; // Size: 0xB0

struct FAttackIKProfileInfos
{
    FSCUserDefinedEnumHandler m_Profile;                                              // 0x0000 (size: 0x50)
    FName m_AnimCurveName;                                                            // 0x0050 (size: 0x8)

}; // Size: 0x58

struct FAttackMemoryData
{
    TWeakObjectPtr<class AActor> m_Instigator;                                        // 0x0000 (size: 0x8)
    uint8 m_uiOderId;                                                                 // 0x0008 (size: 0x1)
    EGuardType m_eGuardType;                                                          // 0x0009 (size: 0x1)
    TSoftClassPtr<AThrowableActor> m_ThrowableActorClass;                             // 0x0010 (size: 0x28)
    FGameplayTagContainer m_AttackProperties;                                         // 0x0038 (size: 0x20)
    int32 m_iComboID;                                                                 // 0x0058 (size: 0x4)
    bool m_bHasHit;                                                                   // 0x0068 (size: 0x1)
    bool m_bDodged;                                                                   // 0x0069 (size: 0x1)
    bool m_bAvoided;                                                                  // 0x006A (size: 0x1)

}; // Size: 0x70

struct FAttackPropertyLevel
{
    uint32 m_Level;                                                                   // 0x0000 (size: 0xC)
    bool m_bUseCustomDuration;                                                        // 0x000C (size: 0x1)
    float m_fCustomDuration;                                                          // 0x0010 (size: 0x4)
    bool m_bUseHitAnimDuration;                                                       // 0x0014 (size: 0x1)
    bool m_bKeepCurrentStateDuration;                                                 // 0x0015 (size: 0x1)
    float m_fKeepCurrentStateThresold;                                                // 0x0018 (size: 0x4)
    bool m_bUseCustomDistance;                                                        // 0x001C (size: 0x1)
    float m_fCustomDistance;                                                          // 0x0020 (size: 0x4)

}; // Size: 0x24

struct FAttackPropertyResistanceMatrixByFightingState
{
    FAttackPropertyLevel m_Matrix;                                                    // 0x0000 (size: 0x144)

}; // Size: 0x144

struct FAttackRequest
{
    InputAction m_eInputAction;                                                       // 0x0000 (size: 0x1)
    EQuadrantTypes m_eCurrentQuadrant;                                                // 0x0001 (size: 0x1)
    FName m_AttackName;                                                               // 0x0004 (size: 0x8)
    FName m_ComboState;                                                               // 0x000C (size: 0x8)
    class UCombo* m_Combo;                                                            // 0x0028 (size: 0x8)
    int32 m_iComboNodeID;                                                             // 0x0030 (size: 0x4)
    float m_fStartRatio;                                                              // 0x0038 (size: 0x4)
    class UAttackDB* m_AttackDB;                                                      // 0x0040 (size: 0x8)

}; // Size: 0x48

struct FAttackTicketConfig
{
    FAttackTicketBehavior m_eBehavior;                                                // 0x0000 (size: 0x1)
    bool m_bTicketIsAlwaysAvailable;                                                  // 0x0001 (size: 0x1)
    ESCAICombatRoles m_eCombatRole;                                                   // 0x0002 (size: 0x1)
    int32 m_eCombatRolesMask;                                                         // 0x0004 (size: 0x4)
    int32 m_iCount;                                                                   // 0x0008 (size: 0x4)
    FTimerAndOffset m_Cooldowns;                                                      // 0x000C (size: 0x20)
    bool m_bUsePerDifficultyCounters;                                                 // 0x002C (size: 0x1)
    int32 m_iCountPerDifficulty;                                                      // 0x0030 (size: 0xC)
    FAITicketCooldowns m_CooldownsPerDifficulty;                                      // 0x003C (size: 0x60)
    float m_fCooldownOffsetOnSynchedFires;                                            // 0x009C (size: 0x4)
    float m_fCooldownSynchFiresTolerance;                                             // 0x00A0 (size: 0x4)
    float m_fForcedCooldownOnDirectOpponentDeath;                                     // 0x00A4 (size: 0x4)
    bool m_bIsRepeated;                                                               // 0x00A8 (size: 0x1)
    FInt32Range m_Repeats;                                                            // 0x00AC (size: 0x10)
    bool m_bUseMinDistanceToPosition;                                                 // 0x00BC (size: 0x1)
    float m_fMinDistanceToPosition;                                                   // 0x00C0 (size: 0x4)
    bool m_bEnableIneligibleTimerOnRelease;                                           // 0x00C4 (size: 0x1)
    bool m_bIsNotUsedInCombo;                                                         // 0x00C5 (size: 0x1)
    float m_fMoveToTimeoutValue;                                                      // 0x00C8 (size: 0x4)
    EPassiveTicketBehaviorAginstJoker m_eBehaviorAgainstJoker;                        // 0x00CC (size: 0x1)
    FSCAITicketEnum m_FallbackTicket;                                                 // 0x00D0 (size: 0x50)

}; // Size: 0x120

struct FAttackUnlockProgress
{
    int32 m_iXP;                                                                      // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FAudioOutput
{
    FText m_DisplayText;                                                              // 0x0000 (size: 0x18)
    AkChannelConfiguration m_eChannelConfig;                                          // 0x0018 (size: 0x1)
    bool m_bUse3DOutput;                                                              // 0x0019 (size: 0x1)

}; // Size: 0x20

struct FAutoAvoidInfos
{
    class AFightingCharacter* m_AttackerChar;                                         // 0x0000 (size: 0x8)
    FHitBox m_AttackerHitBox;                                                         // 0x0008 (size: 0x298)
    ESCCardinalPoints m_eAttackerCardinalPoint;                                       // 0x02A0 (size: 0x1)

}; // Size: 0x2A8

struct FAvailabilityLayerCache
{
    class UGenericAvailabilityLayerDB* m_DB;                                          // 0x0000 (size: 0x8)
    int32 m_iPriority;                                                                // 0x0008 (size: 0x4)

}; // Size: 0x28

struct FAvailabilityLayerCaches
{
    int32 m_iPriority;                                                                // 0x0000 (size: 0x4)
    TArray<FAvailabilityLayerCache> m_layers;                                         // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAvailabilityLayerCombinations
{
    class UAvailabilityLayerData* m_LayerData;                                        // 0x0000 (size: 0x8)
    EALBinaryOperation m_eOperator;                                                   // 0x0008 (size: 0x1)

}; // Size: 0x10

struct FAvailabilityLayerContainer
{
    class UAvailabilityLayerData* m_availabilityLayerData;                            // 0x0000 (size: 0x8)
    EALBinaryOperation m_eOperation;                                                  // 0x0008 (size: 0x1)
    int32 m_iPriority;                                                                // 0x000C (size: 0x4)

}; // Size: 0x10

struct FAvailabilityLayerPushParams
{
    class UAvailabilityLayerData* m_availabilityLayerData;                            // 0x0000 (size: 0x8)
    EALBinaryOperation m_eOperation;                                                  // 0x0008 (size: 0x1)
    int32 m_iPriority;                                                                // 0x000C (size: 0x4)

}; // Size: 0x10

struct FAvailabilityLayerWindow
{
    int32 m_uiHitConditions;                                                          // 0x0000 (size: 0x4)
    FFrameRange m_FrameRange;                                                         // 0x0004 (size: 0x10)
    class UAvailabilityLayerData* m_Layer;                                            // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FAvoidPropertyContainer
{
    class UAvoidPropertyDB* m_AvoidPropertyDB;                                        // 0x0000 (size: 0x38)

}; // Size: 0x38

struct FAvoidWindow
{
    FFrameRange m_FrameRange;                                                         // 0x0000 (size: 0x10)
    int32 m_iAvoidID;                                                                 // 0x0010 (size: 0x4)
    EAvoidType m_eAvoidType;                                                          // 0x0014 (size: 0x1)
    class UAvoidPropertyDB* m_AvoidPropertyDB;                                        // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FBPOrderServiceInstance
{
    TWeakObjectPtr<class ABaseCharacter> m_Owner;                                     // 0x0000 (size: 0x8)

}; // Size: 0x28

struct FBTTaskNodeRelevancyCondition
{
    FBaseActorConditionInstance m_RelevancyCondition;                                 // 0x0000 (size: 0x10)
    TEnumAsByte<EBTNodeResult::Type> m_eResultWhenIrrelevant;                         // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FBaseActorConditionInstance
{
    TSubclassOf<class UBaseActorCondition> m_DefaultClassObject;                      // 0x0000 (size: 0x8)
    class UBaseActorCondition* m_Instance;                                            // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FBaseActorTargetConditionInstance
{
    TSubclassOf<class UBaseActorTargetCondition> m_DefaultClassObject;                // 0x0000 (size: 0x8)
    class UBaseActorTargetCondition* m_Instance;                                      // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FBaseAttackDataRow : public FTableRowBase
{
    FName m_Name;                                                                     // 0x0008 (size: 0x8)
    FText m_RealAttackName;                                                           // 0x0010 (size: 0x18)

}; // Size: 0x28

struct FBaseFightingStateBehavior
{
    bool m_bIsPersistent;                                                             // 0x0000 (size: 0x1)
    int32 m_iPersistencePriority;                                                     // 0x0004 (size: 0x4)
    class UAvailabilityLayerData* m_SuperAvailabilityLayer;                           // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FBaseHitBoxConditionInstance
{
    TSubclassOf<class UHitBoxCondition> m_DefaultClassObject;                         // 0x0000 (size: 0x8)
    class UHitBoxCondition* m_Instance;                                               // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FBaseStatBindings
{
    FText m_Text;                                                                     // 0x0008 (size: 0x18)
    FSlateColor m_ComparisonColor;                                                    // 0x0020 (size: 0x28)

}; // Size: 0x48

struct FBaseWeaponOverrideInfo
{
    float m_fLifeDamageModiferOnGuard;                                                // 0x0000 (size: 0x4)
    float m_fStructureDamageModifierOnGuard;                                          // 0x0004 (size: 0x4)
    TArray<class TSubclassOf<UGameplayEffect>> m_GrantedEffects;                      // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FBlendProfileBySpeedStateStruct
{
    class UBlendProfile* m_BlendProfileBySpeedState;                                  // 0x0000 (size: 0x20)

}; // Size: 0x20

struct FBlendProfileBySpeedStateTableRow : public FTableRowBase
{
    class UBlendProfile* m_BlendProfileBySpeedState;                                  // 0x0008 (size: 0x20)

}; // Size: 0x28

struct FBlendSpaceContainer
{
    class UBlendSpaceBase* m_BlendSpace;                                              // 0x0000 (size: 0x8)
    bool m_bMirror;                                                                   // 0x0008 (size: 0x1)

}; // Size: 0x10

struct FBlendSpaceDirectionContainer
{
    FBlendSpaceContainer m_BlendSpaceFront;                                           // 0x0000 (size: 0x10)
    FBlendSpaceContainer m_BlendSpaceBack;                                            // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FBlendSpaceHitRequestAdditionalInfo : public FHitRequestAdditionalInfo
{
}; // Size: 0x20

struct FBlendSpaceStructBase : public FSwapperStructBase
{
    class UBlendSpaceBase* m_BlendSpace1;                                             // 0x0058 (size: 0x8)
    float m_fPlayRate1;                                                               // 0x0060 (size: 0x4)
    FVector m_Coordinates1;                                                           // 0x0064 (size: 0xC)
    class UBlendSpaceBase* m_BlendSpace2;                                             // 0x0070 (size: 0x8)
    float m_fPlayRate2;                                                               // 0x0078 (size: 0x4)
    FVector m_Coordinates2;                                                           // 0x007C (size: 0xC)

}; // Size: 0x90

struct FBoneHitDBInfo
{
    FBoneReference m_boneRef;                                                         // 0x0000 (size: 0x10)
    EHitShapeType m_eShapeType;                                                       // 0x0010 (size: 0x1)
    float m_fHalfHeight;                                                              // 0x0024 (size: 0x4)
    int32 m_iNumLines;                                                                // 0x0028 (size: 0x4)
    bool m_bOneSided;                                                                 // 0x002C (size: 0x1)
    FVector m_Extent;                                                                 // 0x0030 (size: 0xC)
    float m_fRadius;                                                                  // 0x003C (size: 0x4)
    float m_fCapsuleHalfHeight;                                                       // 0x0040 (size: 0x4)
    FRotator m_RotationOffset;                                                        // 0x0044 (size: 0xC)
    FVector m_vPositionOffset;                                                        // 0x0050 (size: 0xC)
    float m_fChainHitBoxSpacing;                                                      // 0x005C (size: 0x4)
    float m_fChainValidDistance;                                                      // 0x0060 (size: 0x4)
    TArray<FBoneReference> m_bonesInChain;                                            // 0x0068 (size: 0x10)

}; // Size: 0x78

struct FBoneIK
{
    FBoneReference m_Bone;                                                            // 0x0010 (size: 0x10)
    float m_fWeight;                                                                  // 0x0020 (size: 0x4)

}; // Size: 0x90

struct FBuffer
{
    TArray<uint8> m_BufferArray;                                                      // 0x0000 (size: 0x10)
    TArray<FName> m_BufferFnames;                                                     // 0x0010 (size: 0x10)
    TArray<class AActor*> m_BufferActors;                                             // 0x0020 (size: 0x10)
    TArray<class UObject*> m_BufferUObjects;                                          // 0x0030 (size: 0x10)

}; // Size: 0x48

struct FButtonAction
{
    FText m_Text;                                                                     // 0x0000 (size: 0x18)
    InputAction m_eAction;                                                            // 0x0018 (size: 0x1)
    EUIInputModes m_eInputMode;                                                       // 0x0019 (size: 0x1)
    EControllerIconAxisTypes m_eAxisType;                                             // 0x001A (size: 0x1)
    TArray<class UGenericInputData*> m_InputDatas;                                    // 0x0020 (size: 0x10)
    EActionMouseButtons m_Mouse;                                                      // 0x0030 (size: 0x1)
    class UTexture2D* m_MouseModeTexture;                                             // 0x0038 (size: 0x8)

}; // Size: 0x40

struct FCameraCollisionSideRaycast
{
    FVector m_vStartLocal;                                                            // 0x0000 (size: 0xC)
    FVector m_vEndLocal;                                                              // 0x000C (size: 0xC)

}; // Size: 0x18

struct FCameraCollisionSideRaycastList
{
    TArray<FCameraCollisionSideRaycast> m_ListOfRayCast;                              // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FCameraDataModifierWithBehavior
{
    TSubclassOf<class UCameraDataModifier> m_Modifier;                                // 0x0000 (size: 0x8)
    ECameraDataModifierTickBehavior m_eBehavior;                                      // 0x0008 (size: 0x1)

}; // Size: 0x10

struct FCameraLookAtServiceBehavior
{
    ELookAtType m_eLookATType;                                                        // 0x0000 (size: 0x1)
    TWeakObjectPtr<class AActor> m_Target;                                            // 0x0004 (size: 0x8)
    FVector m_vTargetPosition;                                                        // 0x000C (size: 0xC)
    FCameraLookAtServiceBehaviorTime m_timeParams;                                    // 0x0018 (size: 0x20)
    FCameraLookAtServiceBehaviorConfig m_configParams;                                // 0x0038 (size: 0xA8)

}; // Size: 0xE0

struct FCameraLookAtServiceBehaviorConfig
{
    bool m_bLookAtUsePitch;                                                           // 0x0000 (size: 0x1)
    bool m_bLookAtUseYaw;                                                             // 0x0001 (size: 0x1)
    bool m_bUseForcePitch;                                                            // 0x0002 (size: 0x1)
    float m_fForcePitch;                                                              // 0x0004 (size: 0x4)
    bool m_bUseForceYaw;                                                              // 0x0008 (size: 0x1)
    float m_fForceYaw;                                                                // 0x000C (size: 0x4)
    bool m_bStayLock;                                                                 // 0x0010 (size: 0x1)
    bool m_bDeactivateOnManual;                                                       // 0x0011 (size: 0x1)
    float m_fMinYawDiffAbsoluteToCancelLookAtLaunch;                                  // 0x0014 (size: 0x4)
    bool m_bUseYawDampingBasedOnDistance;                                             // 0x0018 (size: 0x1)
    bool m_bUseRepulsionAngleToComputeYaw;                                            // 0x0019 (size: 0x1)
    bool m_bRelaunchLookAtIfYawDampingNonZeroAgain;                                   // 0x001A (size: 0x1)
    class UCurveFloat* m_YawOrientationDampingFromDistanceCurve;                      // 0x0020 (size: 0x8)
    class UCurveFloat* m_YawNearOrientationDampingFromDistanceCurve;                  // 0x0028 (size: 0x8)
    class UCurveFloat* m_YawOrientationDampingCurveRatioFromDist;                     // 0x0030 (size: 0x8)
    bool m_bUsePitchDampingBasedOnDistance;                                           // 0x0038 (size: 0x1)
    class UCurveFloat* m_PitchOrientationDampingFromDistanceCurve;                    // 0x0040 (size: 0x8)
    class UCurveFloat* m_PitchNearOrientationDampingFromDistanceCurve;                // 0x0048 (size: 0x8)
    class UCurveFloat* m_PitchOrientationDampingCurveRatioFromDist;                   // 0x0050 (size: 0x8)
    bool m_bUsePitchComputedWithSlope;                                                // 0x0058 (size: 0x1)
    class UCurveFloat* m_PitchValuePerSlopeAngleMinDist;                              // 0x0060 (size: 0x8)
    class UCurveFloat* m_PitchValuePerSlopeAngleMaxDist;                              // 0x0068 (size: 0x8)
    FFloatRange m_PitchWithSlopeRangeMinMaxDist;                                      // 0x0070 (size: 0x10)
    bool m_bTeleportPointComputation;                                                 // 0x0080 (size: 0x1)
    bool m_bUseCollisionAnticipationCorrection;                                       // 0x0081 (size: 0x1)
    bool m_bUsePositionToLockDamping;                                                 // 0x0082 (size: 0x1)
    float m_fTargetPosDampingValue;                                                   // 0x0084 (size: 0x4)
    bool m_bUsePositionZOffset;                                                       // 0x0088 (size: 0x1)
    float m_fLookAtUpOffset;                                                          // 0x008C (size: 0x4)
    bool m_bUsePositionRatio;                                                         // 0x0090 (size: 0x1)
    float m_fPositionRatioToTarget;                                                   // 0x0094 (size: 0x4)
    float m_fPositionRatioDistanceMaxToComputeRatioForLockRange;                      // 0x0098 (size: 0x4)
    float m_fPositionRatioLockDistMin;                                                // 0x009C (size: 0x4)
    float m_fPositionRatioLockDistMax;                                                // 0x00A0 (size: 0x4)
    float m_fPositionRatioLookAtUpOffsetCompensation;                                 // 0x00A4 (size: 0x4)

}; // Size: 0xA8

struct FCameraLookAtServiceBehaviorTime
{
    float m_fReachDuration;                                                           // 0x0000 (size: 0x4)
    class UCurveFloat* m_CurveReachDurationPerAngleDiff;                              // 0x0008 (size: 0x8)
    ESCBlendType m_eReachBlendType;                                                   // 0x0010 (size: 0x1)
    class UCurveFloat* m_ReachCurveDynamic;                                           // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FCameraMirrorManagementConfig
{
    ECameraMirrorManagementType m_eMirrorType;                                        // 0x0000 (size: 0x1)
    float m_fTargetValue;                                                             // 0x0004 (size: 0x4)
    float m_fSpringSpeed;                                                             // 0x0008 (size: 0x4)
    bool m_bInstantSpring;                                                            // 0x000C (size: 0x1)
    ESCBlendType m_eBlenderBlendType;                                                 // 0x000D (size: 0x1)
    class UCurveFloat* m_BlenderCustomCurve;                                          // 0x0010 (size: 0x8)
    float m_fBlenderDuration;                                                         // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FCameraNodeStruct
{
    ECameraTrackingMode m_eTrackingTranslationMode;                                   // 0x0000 (size: 0x1)
    ECameraTrackingMode m_eTrackingRotationMode;                                      // 0x0001 (size: 0x1)
    FVector4 m_vFulcrumOffset;                                                        // 0x0010 (size: 0x10)
    bool m_bDynamicFulcrumOffsetEnabled;                                              // 0x0020 (size: 0x1)
    FVector4 m_vSafeOffset;                                                           // 0x0030 (size: 0x10)
    bool m_bUseAboveIdealOffset;                                                      // 0x0040 (size: 0x1)
    FVector m_vAboveIdealOffset;                                                      // 0x0044 (size: 0xC)
    FVector4 m_vIdealOffset;                                                          // 0x0050 (size: 0x10)
    bool m_bUseBelowIdealOffset;                                                      // 0x0060 (size: 0x1)
    FVector m_vBelowIdealOffset;                                                      // 0x0064 (size: 0xC)
    bool m_bIsCollisionEnabled;                                                       // 0x0070 (size: 0x1)
    float m_fFov;                                                                     // 0x0074 (size: 0x4)
    bool m_bIsFovVertical;                                                            // 0x0078 (size: 0x1)
    bool m_bConstraintAspectRatio;                                                    // 0x0079 (size: 0x1)
    float m_fContraintAspectRatio;                                                    // 0x007C (size: 0x4)
    bool m_bIsAnimDriven;                                                             // 0x0080 (size: 0x1)
    bool m_bAllowAnimDrivenFov;                                                       // 0x0081 (size: 0x1)
    bool m_bFovFromPreviousCameraData;                                                // 0x0082 (size: 0x1)
    bool m_bSnapRefLocation;                                                          // 0x0083 (size: 0x1)
    float m_fRefDampingFactor;                                                        // 0x0084 (size: 0x4)
    float m_fCoolDownAfterManualCameraTouch;                                          // 0x0088 (size: 0x4)
    bool m_bAllowComfortService;                                                      // 0x008C (size: 0x1)
    float m_fHorizontalSpeed;                                                         // 0x0090 (size: 0x4)
    float m_fVerticalSpeed;                                                           // 0x0094 (size: 0x4)
    bool m_bFixedYaw;                                                                 // 0x0098 (size: 0x1)
    bool m_bFixedPitch;                                                               // 0x0099 (size: 0x1)
    bool m_bFixedRoll;                                                                // 0x009A (size: 0x1)
    float m_fFixedYaw;                                                                // 0x009C (size: 0x4)
    float m_fFixedPitch;                                                              // 0x00A0 (size: 0x4)
    float m_fFixedRoll;                                                               // 0x00A4 (size: 0x4)
    float m_fAboveLimitPitch;                                                         // 0x00A8 (size: 0x4)
    float m_fBelowLimitPitch;                                                         // 0x00AC (size: 0x4)
    class UCurveFloat* m_curveCameraShakeFactorByDistToOwner;                         // 0x00B0 (size: 0x8)
    bool m_bFollow;                                                                   // 0x00B8 (size: 0x1)
    float m_fFollowPitchOffset;                                                       // 0x00BC (size: 0x4)
    float m_fFollowPitchDampingFactor;                                                // 0x00C0 (size: 0x4)
    float m_fFollowPitchMultiplier;                                                   // 0x00C4 (size: 0x4)
    class UCurveFloat* m_followYawDampingFactorCurve;                                 // 0x00C8 (size: 0x8)
    float m_fFollowWakeUpMaxPitchDiffAngle;                                           // 0x00D0 (size: 0x4)
    float m_fFollowWakeUpMaxYawDiffAngle;                                             // 0x00D4 (size: 0x4)
    bool m_bIsCamOverTheShoulderDisabled;                                             // 0x00D8 (size: 0x1)
    bool m_bLockOnTarget;                                                             // 0x00DA (size: 0x1)
    float m_fLockOnTargetWakeUpMaxPitchDiffAngle;                                     // 0x00DC (size: 0x4)
    float m_fLockOnTargetWakeUpMaxYawDiffAngle;                                       // 0x00E0 (size: 0x4)
    bool m_bLockFollowing;                                                            // 0x00E4 (size: 0x1)
    float m_fLockFollowingWakeUpMaxPitchDiffAngle;                                    // 0x00E8 (size: 0x4)
    float m_fLockFollowingWakeUpMaxYawDiffAngle;                                      // 0x00EC (size: 0x4)
    bool m_bLockFramingContainer;                                                     // 0x00F0 (size: 0x1)
    float m_fLockFraimingContainerDeadZonenCenterX;                                   // 0x00F4 (size: 0x4)
    float m_fLockFraimingContainerDeadZonenCenterY;                                   // 0x00F8 (size: 0x4)
    float m_fScreenPercentSoftEdgeX;                                                  // 0x00FC (size: 0x4)
    float m_fScreenPercentSoftEdgeY;                                                  // 0x0100 (size: 0x4)
    float m_fScreenPercentHardEdgeX;                                                  // 0x0104 (size: 0x4)
    float m_fScreenPercentHardEdgeY;                                                  // 0x0108 (size: 0x4)
    float m_fMinRangeDistanceToOwner;                                                 // 0x010C (size: 0x4)
    float m_fMaxRangeDistanceToOwner;                                                 // 0x0110 (size: 0x4)
    float m_fDistanceDampingFactor;                                                   // 0x0114 (size: 0x4)
    bool m_bCameraFramingLerpOnDistance;                                              // 0x0118 (size: 0x1)
    float m_fHeightAboveOwner;                                                        // 0x011C (size: 0x4)
    float m_fCameraFramingHeightDampingFactor;                                        // 0x0120 (size: 0x4)
    bool m_bCameraFramingLerpOnHeight;                                                // 0x0124 (size: 0x1)
    bool m_bUsePitchAtRest;                                                           // 0x0125 (size: 0x1)
    bool m_bPitchAtRestComputationMethodSlope;                                        // 0x0126 (size: 0x1)
    bool m_bPitchAtRestComputationMethodTarget;                                       // 0x0127 (size: 0x1)
    bool m_bPitchAtRestComputationMethodTargetThenSlope;                              // 0x0128 (size: 0x1)
    float m_fPitchAtRestSprintSpeedValue;                                             // 0x012C (size: 0x4)
    class UCurveFloat* m_PitchAtRestValuePerSlopeAngle;                               // 0x0130 (size: 0x8)
    class UCurveFloat* m_PitchAtRestOffsetPerSafeZoneSize;                            // 0x0138 (size: 0x8)
    class UCurveFloat* m_PitchAtRestOffsetFactorByDistToTarget;                       // 0x0140 (size: 0x8)
    float m_fPitchAtRestOffsetSpringSpeedValue;                                       // 0x0148 (size: 0x4)
    float m_fPitchAtRestWakeUpMaxPitchDiffAngle;                                      // 0x014C (size: 0x4)
    bool m_bUseAboveHeadIdealOffset;                                                  // 0x0150 (size: 0x1)
    class UCurveFloat* m_AboveHeadIdealOffsetOffsetPerSafeZoneSize;                   // 0x0158 (size: 0x8)
    class UCurveFloat* m_AboveHeadIdealOffsetFactorByDistToTarget;                    // 0x0160 (size: 0x8)
    float m_fAboveHeadIdealOffsetSpringSpeedValue;                                    // 0x0168 (size: 0x4)
    bool m_bAboveHeadIdealOffsetApplyOnAbove;                                         // 0x016C (size: 0x1)
    bool m_bAboveHeadIdealOffsetApplyOnBelow;                                         // 0x016D (size: 0x1)
    bool m_bUseRepulsionFromDeadZone;                                                 // 0x016E (size: 0x1)
    float m_fCollisionRatioToConsideredAsNearInRepulsion;                             // 0x0170 (size: 0x4)
    bool m_bCanBeMirrored;                                                            // 0x0174 (size: 0x1)
    bool m_bUseCameraSideCollisionMirror;                                             // 0x0175 (size: 0x1)
    bool m_bUseCameraCombatMirrorService;                                             // 0x0176 (size: 0x1)
    float m_fCameraCombatMirrorCursorAvoidRangeAroundMiddle;                          // 0x0178 (size: 0x4)
    float m_fCameraCombatMirrorCursorAvoidRangeMinRailCollisionRatio;                 // 0x017C (size: 0x4)
    float m_fCameraCombatMirrorCursorAvoidRangeMinCamDist;                            // 0x0180 (size: 0x4)
    class UCurveFloat* m_CombatMirrorWeightWhiskerCastByAngularDistToRight;           // 0x0188 (size: 0x8)
    float m_fCombatMirrorCachedAngleDistAtWeightZero;                                 // 0x0190 (size: 0x4)
    class UCurveFloat* m_CameraCombatMirrorProjRemapNotInMirror;                      // 0x0198 (size: 0x8)
    class UCurveFloat* m_CameraCombatMirrorSideTraceDistRatioRemap;                   // 0x01A0 (size: 0x8)
    float m_fCombatMirrorProjSpringSpeedInsideCollisionBoundary;                      // 0x01A8 (size: 0x4)
    float m_fCombatMirrorProjSpringSpeedOutsideCollisionBoundary;                     // 0x01AC (size: 0x4)
    bool m_bAllowCameraLookAtToExtractCollision;                                      // 0x01B0 (size: 0x1)
    bool m_bAllowDodgeToTriggerMirrorChange;                                          // 0x01B1 (size: 0x1)

}; // Size: 0x1C0

struct FCameraNodeStructInherited
{
}; // Size: 0x1

struct FCameraRepulsionConfig
{
    float m_fRepulsionSleepTimerAfterManualCam;                                       // 0x0000 (size: 0x4)
    TArray<FCameraRepulsionConfigElement> m_RepulsionsElements;                       // 0x0008 (size: 0x10)
    float m_fDeadZoneHidingTargetPositionSpringSpeed;                                 // 0x0018 (size: 0x4)
    float m_fCollidingDeadZoneExtraAngleOffset;                                       // 0x001C (size: 0x4)
    float m_fLookAtYawDampingValueThisFrameToDisableRepulsion;                        // 0x0020 (size: 0x4)
    float m_fCollisionRailRatioToActivateRepulsionFromCollidingDeadZone;              // 0x0024 (size: 0x4)
    bool m_bUseMergedDeadZonesWhenRepulsingFromOnlyHidingZone;                        // 0x0028 (size: 0x1)

}; // Size: 0x30

struct FCameraRepulsionConfigElement
{
    TArray<FBaseActorConditionInstance> m_Conditions;                                 // 0x0000 (size: 0x10)
    TArray<FBaseActorTargetConditionInstance> m_ActorTargetConditions;                // 0x0010 (size: 0x10)
    class UCurveFloat* m_DeadZoneHidingAngleSizePerSafeZoneSizeFront;                 // 0x0020 (size: 0x8)
    class UCurveFloat* m_DeadZoneHidingAngleSizePerSafeZoneSizeBack;                  // 0x0028 (size: 0x8)
    class UCurveFloat* m_DeadZoneHidingSizeFactorPerDistanceToTargetFront;            // 0x0030 (size: 0x8)
    class UCurveFloat* m_DeadZoneHidingSizeFactorPerDistanceToTargetBack;             // 0x0038 (size: 0x8)
    class UCurveFloat* m_RepulsionSpringValuePerCameraRailCollisionRatio;             // 0x0040 (size: 0x8)

}; // Size: 0x48

struct FCameraSafePointCondition
{
    bool m_bUseDeadZoneCountRange;                                                    // 0x0000 (size: 0x1)
    FInt32Range m_iDeadZoneCountRange;                                                // 0x0004 (size: 0x10)
    bool m_bUseDeadZoneAngleRange;                                                    // 0x0014 (size: 0x1)
    FFloatRange m_fDeadZoneAngleRange;                                                // 0x0018 (size: 0x10)
    bool m_bUseSafeZoneAngleRange;                                                    // 0x0028 (size: 0x1)
    FFloatRange m_fSafeZoneAngleRange;                                                // 0x002C (size: 0x10)

}; // Size: 0x3C

struct FCameraSafePointConditionalPlacement
{
    FCameraSafePointCondition m_condition;                                            // 0x0000 (size: 0x3C)
    FCameraSafePointPlacement m_placement;                                            // 0x003C (size: 0x1C)

}; // Size: 0x58

struct FCameraSafePointPlacement
{
    FFloatRange m_fSafePointDistRange;                                                // 0x0000 (size: 0x10)
    bool m_bOrientateTowardsCamForward;                                               // 0x0010 (size: 0x1)
    bool m_bUseDeadZoneBissector;                                                     // 0x0011 (size: 0x1)
    float m_fSafeZoneAngleOffset;                                                     // 0x0014 (size: 0x4)
    float m_fBlendInTime;                                                             // 0x0018 (size: 0x4)

}; // Size: 0x1C

struct FCameraTargetPosition
{
    class AActor* m_Actor;                                                            // 0x0000 (size: 0x8)
    FVector m_vPreProcessedTargetPosition;                                            // 0x0008 (size: 0xC)
    FVector m_vRawTargetPosition;                                                     // 0x0014 (size: 0xC)
    float m_fLifeTime;                                                                // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FCameraTransitionEventStruct
{
    float m_fRatio;                                                                   // 0x0000 (size: 0x4)
    TSubclassOf<class UCameraTransitionEvent> m_Event;                                // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FCameraTransitionInfoPairStruct
{
    class UAbstractCameraData* m_CameraData;                                          // 0x0000 (size: 0x8)
    class UCameraTransitionInfo* m_CameraTransitionInfo;                              // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FCancelAnimContainerQuadrantArray
{
    FAnimContainer m_Array;                                                           // 0x0000 (size: 0x60)

}; // Size: 0x60

struct FCaptureInputResult
{
    TArray<FInputMappingKeySlot> m_Slots;                                             // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FCardinalAnimContainer
{
    FAnimContainer m_Anims;                                                           // 0x0000 (size: 0x60)

}; // Size: 0x60

struct FCardinalChangementAnimContainer
{
    FCardinalAnimContainer m_Cardinals;                                               // 0x0000 (size: 0x180)

}; // Size: 0x180

struct FCardinalMatchArray
{
    TArray<ESCCardinalPoints> m_Array;                                                // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FCardinalSpeed
{
    bool m_bUseCommonSpeed;                                                           // 0x0000 (size: 0x1)
    FFloatRange m_CommonSpeed;                                                        // 0x0004 (size: 0x10)
    FFloatRange m_CardinalSpeeds;                                                     // 0x0014 (size: 0x40)

}; // Size: 0x54

struct FCarriedPropDataRow : public FTableRowBase
{
    FName m_LocatorName;                                                              // 0x0008 (size: 0x8)
    TSubclassOf<class AActor> m_ClassToSpawn;                                         // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FCarriedProps
{
    FDataTableRowHandle m_props;                                                      // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FCarriedPropsContainer
{
    FCarriedProps m_CarriedProp;                                                      // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FCarriedWeaponContainer
{
    TSubclassOf<class ABaseWeapon> m_carriedWeapon;                                   // 0x0000 (size: 0x8)
    FName m_CarriedWeaponPoolName;                                                    // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FCharacterProgressionReward
{
    ECharacterProgressionRewardConditions m_eUnlockCondition;                         // 0x0000 (size: 0x1)
    int32 m_iUnlockParameter;                                                         // 0x0004 (size: 0x4)
    TArray<class UCharacterProgressionUnlockDB*> m_Unlocks;                           // 0x0008 (size: 0x10)
    bool m_bAddToNewRewards;                                                          // 0x0018 (size: 0x1)
    FText m_NotificationText;                                                         // 0x0020 (size: 0x18)
    TSoftObjectPtr<UTexture2D> m_NotificationIcon;                                    // 0x0038 (size: 0x28)

}; // Size: 0x60

struct FCharacterStatsBindings
{
    FAsyncTextureStruct m_FightingStyleIcon;                                          // 0x0000 (size: 0x28)
    FIntStatBinding m_CurrentLevelXP;                                                 // 0x0028 (size: 0x50)
    FIntStatBinding m_XPToNextLevel;                                                  // 0x0078 (size: 0x50)
    float m_fLevelProgress;                                                           // 0x00C8 (size: 0x4)
    FIntStatBinding m_AttributePoints;                                                // 0x00D0 (size: 0x50)
    FIntStatBinding m_PrestigePoints;                                                 // 0x0120 (size: 0x50)
    FIntStatBinding m_PrestigeGrade;                                                  // 0x0170 (size: 0x50)
    FIntStatBinding m_Fragments;                                                      // 0x01C0 (size: 0x50)
    FIntStatBinding m_Level;                                                          // 0x0210 (size: 0x50)
    FFloatStatBinding m_BareHandsWeightRatio;                                         // 0x0260 (size: 0x50)
    FFloatStatBinding m_WeaponWeightRatio;                                            // 0x02B0 (size: 0x50)

}; // Size: 0x300

struct FCharacterStatsValues
{
    TMap<ECharacterStat, float> m_Values;                                             // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FChargedAttackNameByQuadrants
{
    FName m_Attacks;                                                                  // 0x0000 (size: 0x20)
    float m_StartRatio;                                                               // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FChargedBuildUpStructByQuadrant
{
    FAnimContainer m_BuildUpByQuadrant;                                               // 0x0000 (size: 0x60)
    FChargedBuildUpStructGenericInfos m_Infos;                                        // 0x0060 (size: 0xC)

}; // Size: 0x70

struct FChargedBuildUpStructGenericInfos
{
    float m_fDurationOfCharging;                                                      // 0x0000 (size: 0x4)
    float m_fExtraHoldingTimeAfterChargeIscomplete;                                   // 0x0004 (size: 0x4)
    bool m_bAllowQuadrantToRecompute;                                                 // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FChargedCap
{
    FFrameRange m_FrameRange;                                                         // 0x0000 (size: 0x10)
    float m_fDuration;                                                                // 0x0010 (size: 0x4)
    TArray<FChargedOverridingHitBox> m_HitBoxes;                                      // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FChargedOverridingHitBox
{
    uint8 m_uiHitBoxToOverride;                                                       // 0x0000 (size: 0x1)
    FDataTableRowHandle m_HitRow;                                                     // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FCheckPointStruct
{
    FName m_SpawnPoint;                                                               // 0x0000 (size: 0x8)
    TArray<FName> m_LevelToStreams;                                                   // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FChosenAttackProperties
{
}; // Size: 0x2

struct FClusterStruct
{
    class UStaticMeshComponent* m_MeshComp;                                           // 0x0000 (size: 0x8)
    TSubclassOf<class AThrowableActor> m_ThrowableSubClass;                           // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FCombatCircleDescription
{
    float m_fRadius;                                                                  // 0x0000 (size: 0x4)
    float m_fOffsetRotation;                                                          // 0x0004 (size: 0x4)
    int32 m_NbPositionsToGenerate;                                                    // 0x0008 (size: 0x4)
    float m_fPositionGenerationThreshold;                                             // 0x000C (size: 0x4)
    bool m_bAllowSnapAfterRaycast;                                                    // 0x0010 (size: 0x1)
    float m_fSnapSafeDistance;                                                        // 0x0014 (size: 0x4)
    float m_fNavPickingTolerance;                                                     // 0x0018 (size: 0x4)

}; // Size: 0x1C

struct FCombatDeckDetails
{
    FCombatDeckStat m_TotalDamage;                                                    // 0x0000 (size: 0x88)
    FCombatDeckStat m_StatsDamage;                                                    // 0x0088 (size: 0x88)
    FCombatDeckStat m_WeaponDamage;                                                   // 0x0110 (size: 0x88)
    FCombatDeckStat m_WeaponDamageScale;                                              // 0x0198 (size: 0x88)
    FCombatDeckStat m_BaseAttackDamage;                                               // 0x0220 (size: 0x88)
    FCombatDeckStat m_AttackBonus;                                                    // 0x02A8 (size: 0x88)
    FCombatDeckStat m_Range;                                                          // 0x0330 (size: 0x88)
    FCombatDeckStat m_Speed;                                                          // 0x03B8 (size: 0x88)
    FCombatDeckStat m_StrengthScale;                                                  // 0x0440 (size: 0x88)
    FCombatDeckStat m_AgilityScale;                                                   // 0x04C8 (size: 0x88)
    FCombatDeckStat m_WRScale;                                                        // 0x0550 (size: 0x88)
    TSoftObjectPtr<UTexture2D> m_eWeaponFamilyMiniIcon;                               // 0x05D8 (size: 0x28)
    FAsyncTextureStruct m_eWeaponFamilyMiniIconAsync;                                 // 0x0600 (size: 0x28)
    FEquipmentCategoryInfos m_WeaponFamilyInfos;                                      // 0x0628 (size: 0xC0)
    FText m_ComboName;                                                                // 0x06E8 (size: 0x18)
    TArray<FName> m_Attacks;                                                          // 0x0700 (size: 0x10)
    float m_fTotatDamageWithCoef;                                                     // 0x0710 (size: 0x4)

}; // Size: 0x718

struct FCombatDeckStat
{
    float m_fAverage;                                                                 // 0x0014 (size: 0x4)
    FString m_AverageString;                                                          // 0x0018 (size: 0x10)
    float m_fRating;                                                                  // 0x0028 (size: 0x4)
    FSlateColor m_ComparisonColor;                                                    // 0x0030 (size: 0x28)
    FSlateColor m_RatingComparisonColor;                                              // 0x0058 (size: 0x28)

}; // Size: 0x88

struct FCombatSpeedTransitionsAnimContainer : public FSpeedTransitionsAnimContainer
{
    FCardinalChangementAnimContainer m_Start_FR;                                      // 0x02D0 (size: 0x180)

}; // Size: 0x450

struct FCombinationInput
{
    class UGenericInputData* m_Input;                                                 // 0x0000 (size: 0x8)
    float m_fLifeSpan;                                                                // 0x0008 (size: 0x4)
    bool m_bRegisterPressTimeOnStack;                                                 // 0x000C (size: 0x1)
    bool m_bRemovePressedTimeFromTimeLeft;                                            // 0x000D (size: 0x1)

}; // Size: 0x10

struct FComboAIConditionFindActorsEnvQueryResult
{
    TWeakObjectPtr<class AActor> m_Actor;                                             // 0x0000 (size: 0x8)
    FVector m_vLocation;                                                              // 0x0008 (size: 0xC)

}; // Size: 0x14

struct FComboAttack
{
    FDataTableRowHandle m_AnimationRow;                                               // 0x0000 (size: 0x10)
    class UAnimationAsset* m_animation;                                               // 0x0010 (size: 0x8)
    FWeaponAnimInfo m_weaponAnimInfoAssociated;                                       // 0x0018 (size: 0x90)
    bool m_bUsePreviousAttackFakieState;                                              // 0x00A8 (size: 0x1)
    float m_fAnimFrameRate;                                                           // 0x00AC (size: 0x4)
    float m_fAnimFrameDeltaTime;                                                      // 0x00B0 (size: 0x4)
    int32 m_iWantedBuildupFrames;                                                     // 0x00B4 (size: 0x4)
    bool m_bOverrideMinBuildupForwardDisplacement;                                    // 0x00B8 (size: 0x1)
    float m_fMinBuildupForwardDisplacement;                                           // 0x00BC (size: 0x4)
    bool m_bOverrideAnimRange;                                                        // 0x00C0 (size: 0x1)
    float m_fGameplayRange;                                                           // 0x00C4 (size: 0x4)
    bool m_bIgnoreRange;                                                              // 0x00C8 (size: 0x1)
    bool m_bWantCustomMaxDisSnap;                                                     // 0x00C9 (size: 0x1)
    float m_fCustomMaxDisSnap;                                                        // 0x00CC (size: 0x4)
    float m_fSnapbackMargin;                                                          // 0x00D0 (size: 0x4)
    bool m_bWantSnap;                                                                 // 0x00D4 (size: 0x1)
    bool m_bWantSnapBack;                                                             // 0x00D5 (size: 0x1)
    bool m_bWantSnapDuringStrike;                                                     // 0x00D6 (size: 0x1)
    bool m_bIsRushAttack;                                                             // 0x00D7 (size: 0x1)
    bool m_bAlwaysTrackHittedTarget;                                                  // 0x00D8 (size: 0x1)
    float m_fMaxTrackingAngle;                                                        // 0x00DC (size: 0x4)
    bool m_bApplyHitWithoutAttack;                                                    // 0x00E0 (size: 0x1)
    TArray<FHitBox> m_HitBoxes;                                                       // 0x00E8 (size: 0x10)
    EApplyDamageOnWeaponType m_eApplyDamageOnWeaponType;                              // 0x00F8 (size: 0x4)
    TArray<FAvailabilityLayerWindow> m_AvailabilityLayerWindows;                      // 0x0100 (size: 0x10)
    TArray<FAvoidWindow> m_AvoidWindows;                                              // 0x0110 (size: 0x10)
    TArray<FAbsorbWindow> m_AbsorbWindows;                                            // 0x0120 (size: 0x10)
    FGameplayTagContainer m_AttackProperties;                                         // 0x0130 (size: 0x20)

}; // Size: 0x150

struct FComboConditionValueToNodeMap
{
    TMap<uint8, uint8> m_Map;                                                         // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FComboNode
{
    FGameplayTagContainer m_RequiredTags;                                             // 0x0000 (size: 0x20)
    FComboNodeAttackInfos m_AttackInfos;                                              // 0x0020 (size: 0x40)
    TMap<class FGameplayTag, class FComboNodeAttackInfos> m_ConditionalAttacks;       // 0x0060 (size: 0x50)
    UClass* m_AIAttackActionClass;                                                    // 0x00B0 (size: 0x8)
    FAIActionAttackClassInstance m_AIAttackAction;                                    // 0x00B8 (size: 0x10)
    FComboTransitions m_Transitions;                                                  // 0x00C8 (size: 0x18)
    int32 m_NodeRedirect;                                                             // 0x00E0 (size: 0x4)
    FAvailabilityLayerContainer m_NodeRedirectAvailabilityLayer;                      // 0x00E8 (size: 0x10)
    TArray<EComboTransition> m_NodeRedirectIgnoredTransitions;                        // 0x00F8 (size: 0x10)
    class UComboEvent* m_Event;                                                       // 0x0108 (size: 0x8)
    FName m_Name;                                                                     // 0x0110 (size: 0x8)
    bool m_bSkip;                                                                     // 0x0118 (size: 0x1)

}; // Size: 0x120

struct FComboNodeAttackInfos
{
    FName m_Attacks;                                                                  // 0x0000 (size: 0x20)
    TArray<FChargedAttackNameByQuadrants> m_ChargedAttacks;                           // 0x0020 (size: 0x10)
    TArray<FChargedBuildUpStructByQuadrant> m_BuildUpForChargedAttack;                // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FComboOverride
{
    FName m_DifficultyName;                                                           // 0x0000 (size: 0x8)
    class UCombo* m_ComboOverride;                                                    // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FComboStartNode
{
    FSCUserDefinedEnumHandler m_EnumState;                                            // 0x0000 (size: 0x50)
    FComboTransitions m_ComboTransitions;                                             // 0x0050 (size: 0x18)
    FName m_PhaseName;                                                                // 0x0068 (size: 0x8)
    uint32 m_uiMCDominationFlags;                                                     // 0x0070 (size: 0x4)

}; // Size: 0x78

struct FComboTransition
{
    EComboTransition m_eInputTransition;                                              // 0x0000 (size: 0x1)
    class UComboTransitionCondition* m_ConditionInstance;                             // 0x0008 (size: 0x8)
    TMap<uint8, int32> m_TargetNodes;                                                 // 0x0010 (size: 0x50)
    float m_fProbability;                                                             // 0x0060 (size: 0x4)

}; // Size: 0x68

struct FComboTransitions
{
    TArray<FComboTransition> m_Transitions;                                           // 0x0000 (size: 0x10)
    FName m_ParentNodeName;                                                           // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FConditionOnTargetWeightEvaluation
{
    FBaseActorTargetConditionInstance m_condition;                                    // 0x0000 (size: 0x10)
    float m_fBonus;                                                                   // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FContainedCameraDataModifierWithBehavior
{
}; // Size: 0x1

struct FContainedCameraTransitionInfoPairStruct
{
}; // Size: 0x1

struct FContainedCameraTransitionInfoStruct
{
}; // Size: 0x1

struct FControllerAxisIcons
{
    TArray<FKey> m_Keys;                                                              // 0x0000 (size: 0x10)
    FControllerAxisTypeIcons m_AxisIcons;                                             // 0x0010 (size: 0x3C0)
    bool m_bShowText;                                                                 // 0x03D0 (size: 0x1)
    FText m_ReplacementText;                                                          // 0x03D8 (size: 0x18)

}; // Size: 0x3F0

struct FControllerAxisTypeIcons
{
    TSoftObjectPtr<UTexture2D> m_AxisTypeIcons;                                       // 0x0000 (size: 0x140)

}; // Size: 0x140

struct FControllerIcons
{
    TArray<FName> m_Controllers;                                                      // 0x0000 (size: 0x10)
    TArray<EPlatform> m_Platforms;                                                    // 0x0010 (size: 0x10)
    TArray<FControllerKeyIcons> m_KeyIcons;                                           // 0x0020 (size: 0x10)
    TArray<FControllerAxisIcons> m_AxisIcons;                                         // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FControllerKeyIcons
{
    FKey m_Key;                                                                       // 0x0000 (size: 0x18)
    TSoftObjectPtr<UTexture2D> m_Icons;                                               // 0x0018 (size: 0x78)
    bool m_bShowText;                                                                 // 0x0090 (size: 0x1)
    FText m_ReplacementText;                                                          // 0x0098 (size: 0x18)

}; // Size: 0xB0

struct FCoopGroup
{
    TArray<FCoopGroupMemberInfo> m_GroupMemberInfos;                                  // 0x0000 (size: 0x10)
    EGameModeTypes m_eGameModeType;                                                   // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FCoopGroupMemberInfo
{
    FUniqueNetIdRepl m_UniqueNetId;                                                   // 0x0000 (size: 0x28)
    ECoopGameModeAnswerStatus m_eAnswerStatus;                                        // 0x0034 (size: 0x1)

}; // Size: 0x38

struct FCreditCategoryStruct
{
    FText m_CategoryName;                                                             // 0x0000 (size: 0x18)
    TArray<FCreditContributorStruct> m_Contributors;                                  // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FCreditCompanyStruct
{
    FName m_CompanyName;                                                              // 0x0000 (size: 0x8)
    TArray<FCreditCategoryStruct> m_Categories;                                       // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FCreditContributorStruct
{
    FName m_FirstName;                                                                // 0x0000 (size: 0x8)
    FName m_LastName;                                                                 // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FCustomUIInfosPerSlot
{
    int32 m_iSlotIndex;                                                               // 0x0000 (size: 0x4)
    EControllerIconAxisTypes m_AxisTypes;                                             // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FCustomWidgetNavigationData
{
    bool m_bAnalogNavigation;                                                         // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FDLCContent
{
    TArray<FName> m_entitlements;                                                     // 0x0000 (size: 0x10)
    TArray<FInventoryItem> m_Gears;                                                   // 0x0010 (size: 0x10)
    TArray<FName> m_Emotes;                                                           // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FDamageInfos
{
    TWeakObjectPtr<class AActor> m_Instigator;                                        // 0x0008 (size: 0x8)
    bool m_bTakenDown;                                                                // 0x0013 (size: 0x1)

}; // Size: 0x28

struct FDamagedWeaponInfo
{
    TSubclassOf<class UBaseWeaponData> m_WeaponDataToApplyOnBrokenWeapon;             // 0x0000 (size: 0x8)
    TSubclassOf<class UWeaponGameplayData> m_WeaponGameplayDataToApplyOnBrokenWeapon; // 0x0008 (size: 0x8)
    float m_fDamagedWeaponHealth;                                                     // 0x0010 (size: 0x4)
    class USkeletalMesh* m_StateSkeletalMesh;                                         // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FDeadZone
{
    FAngleRange m_angleRange;                                                         // 0x0000 (size: 0x8)
    float m_fMinDistance;                                                             // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FDeathAnimAttackCardinalArray
{
    class UAnimSequence* m_Array;                                                     // 0x0000 (size: 0x20)

}; // Size: 0x20

struct FDeathAnimAttackHeightArray
{
    FDeathAnimAttackCardinalArray m_Array;                                            // 0x0000 (size: 0x60)

}; // Size: 0x60

struct FDeathAnimAttackPowerArray
{
    FDeathAnimAttackHeightArray m_Array;                                              // 0x0000 (size: 0x120)

}; // Size: 0x120

struct FDeathAnimQuadrantArray
{
    FDeathAnimAttackPowerArray m_Array;                                               // 0x0000 (size: 0x480)

}; // Size: 0x480

struct FDeathRadialImpulse
{
    float Radius;                                                                     // 0x0000 (size: 0x4)
    TEnumAsByte<ERadialImpulseFalloff> Falloff;                                       // 0x0004 (size: 0x1)
    float ImpulseStrength;                                                            // 0x0008 (size: 0x4)
    TArray<TEnumAsByte<EObjectTypeQuery>> ObjectTypesToAffect;                        // 0x0010 (size: 0x10)
    bool bImpulseVelChange;                                                           // 0x0020 (size: 0x1)
    float DestructibleDamage;                                                         // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FDeathStandupAnimationFromAnimation
{
    class UAnimSequence* m_DeathAnim;                                                 // 0x0000 (size: 0x8)
    FAnimContainer m_StandAnim;                                                       // 0x0008 (size: 0x18)

}; // Size: 0x20

struct FDeathStandupAnimations
{
    FAnimContainer m_FaceDown;                                                        // 0x0000 (size: 0x18)
    FAnimContainer m_FaceUp;                                                          // 0x0018 (size: 0x18)
    FAnimContainer m_SideLeft;                                                        // 0x0030 (size: 0x18)
    FAnimContainer m_SideRight;                                                       // 0x0048 (size: 0x18)
    float m_fMinFaceAngle;                                                            // 0x0060 (size: 0x4)
    TArray<FDeathStandupAnimationFromAnimation> m_SpecialCases;                       // 0x0068 (size: 0x10)

}; // Size: 0x78

struct FDefenderAnimInfos : public FDefenseAnimInfos
{
    bool m_bParryToStructureBrokenDisableReorient;                                    // 0x01A8 (size: 0x1)
    bool m_bParryToDizzyDisableReorient;                                              // 0x01A9 (size: 0x1)
    bool m_bParrySuccessDisableReorient;                                              // 0x01AA (size: 0x1)

}; // Size: 0x1B0

struct FDefenseAnimInfos
{
    FAnimContainer m_Anim;                                                            // 0x0000 (size: 0x18)
    FHittedAnimContainer m_ParryToStructureBrokenAnim;                                // 0x0018 (size: 0x68)
    FHittedAnimContainer m_ParryToDizzyAnim;                                          // 0x0080 (size: 0x68)
    bool m_bMirrorFightingStateLoop;                                                  // 0x00E8 (size: 0x1)
    TMap<class ESCCardinalPoints, class FAnimContainer> m_PushFromGrabAnims;          // 0x00F0 (size: 0x50)
    TMap<class ESCCardinalPoints, class FAnimContainer> m_PushFromGrabCloseWallAnims; // 0x0140 (size: 0x50)
    FAnimContainer m_ParrySuccessAnim;                                                // 0x0190 (size: 0x18)

}; // Size: 0x1A8

struct FDefenseGauge
{
    float m_fMaxValue;                                                                // 0x0000 (size: 0x4)
    float m_fCooldownBeforeRecovery;                                                  // 0x0004 (size: 0x4)
    float m_fRecoveryRatePerSec;                                                      // 0x0008 (size: 0x4)
    float m_fRecoveryRatePerSecWhenComplete;                                          // 0x000C (size: 0x4)

}; // Size: 0x18

struct FDeflectImpact : public FHitImpact
{
    class UCurveFloat* m_KnockBackDynamic;                                            // 0x0030 (size: 0x8)
    bool m_bSelfStructureDamageCanGuardBreak;                                         // 0x0038 (size: 0x1)
    bool m_bUseSelfStructureDamage;                                                   // 0x0039 (size: 0x1)
    float m_fSelfStructureDamage;                                                     // 0x003C (size: 0x4)
    bool m_bUseSelfSuperDizzyDamage;                                                  // 0x0040 (size: 0x1)
    float m_fSelfSuperDizzyDamage;                                                    // 0x0044 (size: 0x4)

}; // Size: 0x48

struct FDeltaTransformAudioStep
{
    float m_fMinDistance;                                                             // 0x0000 (size: 0x4)
    float m_fMinDeltaAngle;                                                           // 0x0004 (size: 0x4)
    class UAkAudioEvent* m_akEvent;                                                   // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FDestructibleStateInfo
{
    int32 m_iHealthThreshold;                                                         // 0x0000 (size: 0x4)
    class UStaticMesh* m_StateStaticMesh;                                             // 0x0008 (size: 0x8)
    class USkeletalMesh* m_StateSkeletalMesh;                                         // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FDetailedMoveTransition
{
    ESpeedState m_eInSpeedState;                                                      // 0x0000 (size: 0x1)
    bool m_bAllowAllInCardinal;                                                       // 0x0001 (size: 0x1)
    ESCCardinalPoints m_eInCardinalPoint;                                             // 0x0002 (size: 0x1)
    ESpeedState m_eOutSpeedState;                                                     // 0x0003 (size: 0x1)
    ESCCardinalPoints m_eOutCardinalPoint;                                            // 0x0004 (size: 0x1)
    bool m_bFilterByVelocityRotation;                                                 // 0x0005 (size: 0x1)
    ETransitionRotation m_eVelocityRotation;                                          // 0x0006 (size: 0x1)
    bool m_bOverrideVelocityRotationRange;                                            // 0x0007 (size: 0x1)
    FFloatRange m_fVelocityRotationRangeOverride;                                     // 0x0008 (size: 0x10)
    ETransitionRotationDirection m_eVelocityRotationDirection;                        // 0x0018 (size: 0x1)
    EMoveTransitionType m_eResultingTransition;                                       // 0x0019 (size: 0x1)
    FString m_Description;                                                            // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FDisabledTargetInfos
{
    EActionType m_eActionType;                                                        // 0x0000 (size: 0x1)
    bool m_bTargettableWhenAlone;                                                     // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FDizzyReaction : public FPropertyReaction
{
    FAnimContainer m_Loop;                                                            // 0x00D0 (size: 0x18)
    bool m_bMirrorableLoop;                                                           // 0x00E8 (size: 0x1)
    bool m_bAllowDizzyOnTopOfDizzy;                                                   // 0x00E9 (size: 0x1)

}; // Size: 0xF0

struct FDodgeConfigStruct
{
    float m_fMinDuration;                                                             // 0x0000 (size: 0x4)
    float m_fMaxDurationArray;                                                        // 0x0004 (size: 0x10)
    float m_fMovementLengthArray;                                                     // 0x0014 (size: 0x10)
    bool m_bOverrideAnimDynamicByCurve;                                               // 0x0024 (size: 0x1)
    class UCurveFloat* m_OverrideDodgeDynamicCurve;                                   // 0x0028 (size: 0x8)
    int32 m_iFrameBuildUp;                                                            // 0x0030 (size: 0x4)
    int32 m_iNbFrameDodgeWindowMiddle;                                                // 0x0034 (size: 0x4)
    int32 m_iFrameInterruptibleRelease;                                               // 0x0038 (size: 0x4)
    int32 m_iFrameRelease;                                                            // 0x003C (size: 0x4)
    bool m_bHasImpactOnGuardGauge;                                                    // 0x0040 (size: 0x1)
    float m_fGuardGaugeCost;                                                          // 0x0044 (size: 0x4)
    bool m_bForceDirOnNeutralDodge;                                                   // 0x0048 (size: 0x1)
    ESCCardinalPoints m_eForcedCardinalDirOnNeutralDodge;                             // 0x0049 (size: 0x1)

}; // Size: 0x50

struct FDuplicatedSaveData
{
    ECharacterGender m_eGender;                                                       // 0x0000 (size: 0x1)
    TArray<class TSubclassOf<UGameplayEffect>> m_ShrineEffects;                       // 0x0008 (size: 0x10)
    TArray<class TSubclassOf<USkillGameplayEffect>> m_UnlockedSkills;                 // 0x0018 (size: 0x10)
    TMap<TSubclassOf<USkillGameplayEffect>, int32> m_SkillConsolidationLevel;         // 0x0028 (size: 0x50)
    TMap<ECharacterStat, float> m_DefaultStats;                                       // 0x0078 (size: 0x50)
    FGameplayTagContainer m_PlayerTags;                                               // 0x00C8 (size: 0x20)
    FGameplayTagContainer m_GameplayTagContainer;                                     // 0x00E8 (size: 0x20)
    float m_fMCDominationGauge;                                                       // 0x0108 (size: 0x4)
    int32 m_iLastManGauge;                                                            // 0x010C (size: 0x4)
    TArray<uint8> m_duplicatedSaveEntries;                                            // 0x0110 (size: 0x10)

}; // Size: 0x120

struct FDynamicMaterialInput
{
    FName m_ParameterToUpdate;                                                        // 0x0000 (size: 0x8)
    float m_fValue;                                                                   // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FDynamicMaterialsPerType
{
    TArray<class UMaterialInstanceDynamic*> m_DynamicMaterials;                       // 0x0008 (size: 0x10)
    TArray<class UMaterialInstance*> m_RefMaterials;                                  // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FETS_NextHitExtraInfos
{
    FHitBox m_HitBox;                                                                 // 0x0000 (size: 0x298)
    bool m_bMirror;                                                                   // 0x0298 (size: 0x1)
    float m_fHitTime;                                                                 // 0x029C (size: 0x4)

}; // Size: 0x2A0

struct FEditableOrderType
{
    EOrderType m_eOrderType;                                                          // 0x0000 (size: 0x1)
    FSCUserDefinedEnumHandler m_BPOrderID;                                            // 0x0008 (size: 0x50)

}; // Size: 0x58

struct FEmoteDataRow : public FTableRowBase
{
    FName m_Name;                                                                     // 0x0008 (size: 0x8)
    FText m_RealName;                                                                 // 0x0010 (size: 0x18)
    FText m_Description;                                                              // 0x0028 (size: 0x18)
    TSoftObjectPtr<UTexture2D> m_Icon;                                                // 0x0040 (size: 0x28)
    class UAnimSequence* m_Anim;                                                      // 0x0068 (size: 0x8)
    class UAnimSequence* m_AnimWoman;                                                 // 0x0070 (size: 0x8)
    EEmoteAction m_eEmoteAction;                                                      // 0x0078 (size: 0x1)

}; // Size: 0x80

struct FEmoteShopDataRow : public FTableRowBase
{
    FName m_RowName;                                                                  // 0x0008 (size: 0x8)
    int32 m_iGMLevelRequired;                                                         // 0x0010 (size: 0x4)
    int32 m_iGleamLevelRequired;                                                      // 0x0014 (size: 0x4)
    int32 m_iFragmentPrice;                                                           // 0x0018 (size: 0x4)
    int32 m_iPrestigePointPrice;                                                      // 0x001C (size: 0x4)

}; // Size: 0x20

struct FEnvPushInfos
{
}; // Size: 0x1030

struct FEquipmentCategoryInfos
{
    FText m_Name;                                                                     // 0x0000 (size: 0x18)
    FText m_Description;                                                              // 0x0018 (size: 0x18)
    FText m_Lore;                                                                     // 0x0030 (size: 0x18)
    FAsyncTextureStruct m_SelectedIcon;                                               // 0x0048 (size: 0x28)
    FAsyncTextureStruct m_Icon;                                                       // 0x0070 (size: 0x28)
    FAsyncTextureStruct m_MiniIcon;                                                   // 0x0098 (size: 0x28)

}; // Size: 0xC0

struct FEquipmentPreset
{
    FEquipmentStruct m_Items;                                                         // 0x0000 (size: 0x438)
    uint8 m_IsEmpty;                                                                  // 0x0438 (size: 0x9)
    bool m_Init;                                                                      // 0x0441 (size: 0x1)

}; // Size: 0x448

struct FEquipmentShopDataRow : public FTableRowBase
{
    class UBaseItemData* m_Equipment;                                                 // 0x0008 (size: 0x8)
    int32 m_iGMLevelRequired;                                                         // 0x0010 (size: 0x4)
    int32 m_iGleamLevelRequired;                                                      // 0x0014 (size: 0x4)
    bool m_bAbsolverRequired;                                                         // 0x0018 (size: 0x1)
    int32 m_iFragmentPrice;                                                           // 0x001C (size: 0x4)
    int32 m_iPrestigePointPrice;                                                      // 0x0020 (size: 0x4)
    int32 m_iMaterialIndex;                                                           // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FEquipmentStruct
{
    class ABaseWeapon* m_EquipmentActor;                                              // 0x0000 (size: 0x8)
    class UBaseItemData* m_EquipmentDataAsset;                                        // 0x0008 (size: 0x8)
    int32 m_iMaterialIndex;                                                           // 0x0010 (size: 0x4)
    ESchoolItemType m_eSchoolItemType;                                                // 0x0014 (size: 0x1)
    class UMaterialInterface* m_BaseFXMaterials;                                      // 0x0018 (size: 0x50)
    TArray<class UMaterialInterface*> m_VariationChosenMaterials;                     // 0x0068 (size: 0x10)

}; // Size: 0x78

struct FEquipmentValues
{
    int32 m_iFragmentValue;                                                           // 0x0000 (size: 0x4)
    int32 m_iDirtValue;                                                               // 0x0004 (size: 0x4)
    int32 m_iDyeCost;                                                                 // 0x0008 (size: 0x4)
    int32 m_iRepairCost;                                                              // 0x000C (size: 0x4)

}; // Size: 0x10

struct FFXInfo
{
    class UParticleSystem* m_ParticleSystem;                                          // 0x0000 (size: 0x8)
    FVector m_vScale;                                                                 // 0x0008 (size: 0xC)

}; // Size: 0x18

struct FFallOnSlopeConfiguration
{
    float m_fWakeVelocityThreshold;                                                   // 0x0000 (size: 0x4)
    float m_fMaxDuration;                                                             // 0x0004 (size: 0x4)
    class UCurveFloat* m_ImpulseCurve;                                                // 0x0008 (size: 0x8)
    float m_fAngularDamping;                                                          // 0x0010 (size: 0x4)
    float m_fLinearDamping;                                                           // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FFallOnSlopeSetup
{
    TArray<class AActor*> m_IgnoredActors;                                            // 0x0458 (size: 0x10)

}; // Size: 0x468

struct FFidgetDBDescription
{
    class UFidgetDB* m_FidgetDB;                                                      // 0x0000 (size: 0x8)
    class UFidgetDB* m_OnAlertLevelChangedFidgetDB;                                   // 0x0008 (size: 0x8)
    uint32 m_uiAllowedSpeedState;                                                     // 0x0010 (size: 0x4)
    FBlendProfileBySpeedStateStruct m_BlendProfiles;                                  // 0x0018 (size: 0x20)

}; // Size: 0x38

struct FFightingStateElement
{
    bool m_bPause;                                                                    // 0x0000 (size: 0x1)
    float m_fStateDuration;                                                           // 0x0004 (size: 0x4)
    float m_fElapsedTime;                                                             // 0x0008 (size: 0x4)
    bool m_bInfinite;                                                                 // 0x000C (size: 0x1)
    float m_fMaxAccumulatedDamages;                                                   // 0x0010 (size: 0x4)
    float m_fAccumulatedDamages;                                                      // 0x0014 (size: 0x4)
    int32 m_iMaxAccumulatedHits;                                                      // 0x0018 (size: 0x4)
    bool m_bGroupMaxAccumulatedHitsByAttack;                                          // 0x001C (size: 0x1)
    int32 m_iAccumulatedHits;                                                         // 0x0020 (size: 0x4)
    FName m_LastAttackName;                                                           // 0x0024 (size: 0x8)
    EFightingState m_eState;                                                          // 0x002C (size: 0x1)
    ESubFightingState m_eSubFightingState;                                            // 0x002D (size: 0x1)
    TWeakObjectPtr<class UAttackPropertiesResistanceDB> m_specialResistanceDB;        // 0x0080 (size: 0x8)

}; // Size: 0x90

struct FFilterPresetCache
{
    TArray<FFilterPresetData> m_Filters;                                              // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FFilterPresetData
{
    FPostProcessSettings m_PostProcessSettings;                                       // 0x0000 (size: 0x560)
    FText m_DisplayText;                                                              // 0x0560 (size: 0x18)

}; // Size: 0x580

struct FFilterProperties
{
    bool m_bUserConfigured;                                                           // 0x0000 (size: 0x1)
    FText m_FilterText;                                                               // 0x0008 (size: 0x18)
    float m_fExposure;                                                                // 0x0020 (size: 0x4)
    float m_fVignette;                                                                // 0x0024 (size: 0x4)
    float m_fGrain;                                                                   // 0x0028 (size: 0x4)
    float m_fFilterWeight;                                                            // 0x002C (size: 0x4)
    float m_fFogDensity;                                                              // 0x0030 (size: 0x4)
    uint8 m_uiAspectRatioIndex;                                                       // 0x0034 (size: 0x1)
    uint8 m_uiLogoIndex;                                                              // 0x0035 (size: 0x1)
    EScreenLocation m_eLogoScreenLocation;                                            // 0x0036 (size: 0x1)

}; // Size: 0x38

struct FFloatStatBinding : public FBaseStatBindings
{
    float m_fValue;                                                                   // 0x0048 (size: 0x4)

}; // Size: 0x50

struct FFocusPointsGainStruct
{
    FSCUserDefinedEnumHandler m_FocusGainEnum;                                        // 0x0000 (size: 0x50)
    float m_fGainValue;                                                               // 0x0050 (size: 0x4)

}; // Size: 0x58

struct FFrameRange
{
    FFloatRange m_Anim;                                                               // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FGameOptionMappingRange
{
    FFloatRange m_Range;                                                              // 0x0000 (size: 0x10)
    float m_fDefaultValue;                                                            // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FGameOptionOverride
{
}; // Size: 0x10

struct FGameSaveData
{
    ECharacterGender m_eGender;                                                       // 0x0000 (size: 0x1)
    int32 m_iOutfitIndex;                                                             // 0x0004 (size: 0x4)
    TArray<class TSubclassOf<UGameplayEffect>> m_ShrineEffects;                       // 0x0008 (size: 0x10)
    TArray<class TSubclassOf<USkillGameplayEffect>> m_UnlockedSkills;                 // 0x0018 (size: 0x10)
    TMap<TSubclassOf<USkillGameplayEffect>, int32> m_SkillConsolidationLevel;         // 0x0028 (size: 0x50)
    TMap<ECharacterStat, float> m_DefaultStats;                                       // 0x0078 (size: 0x50)
    TMap<class FName, class FCheckPointStruct> m_CheckPointPerLevel;                  // 0x00C8 (size: 0x50)
    FGameplayTagContainer m_PlayerTags;                                               // 0x0118 (size: 0x20)
    FGameplayTagContainer m_GameplayTagContainer;                                     // 0x0138 (size: 0x20)
    float m_fMCDominationGauge;                                                       // 0x0158 (size: 0x4)
    int32 m_iLastManGauge;                                                            // 0x015C (size: 0x4)
    FName m_CurrentMapTagName;                                                        // 0x0160 (size: 0x8)
    FName m_LastStoryMapTagName;                                                      // 0x0168 (size: 0x8)
    float m_fMCHealth;                                                                // 0x0170 (size: 0x4)
    float m_fMCFocusGauge;                                                            // 0x0174 (size: 0x4)
    FGameplayTagContainer m_CurrentMapOptions;                                        // 0x0178 (size: 0x20)
    TMap<int32, FDuplicatedSaveData> m_duplicatedSaveData;                            // 0x0198 (size: 0x50)
    TMap<FName, float> m_iHighscorePerLevel;                                          // 0x01E8 (size: 0x50)
    TArray<float> m_EfficiencyQueue;                                                  // 0x0238 (size: 0x10)
    float m_fFloorScore;                                                              // 0x0248 (size: 0x4)
    bool m_bLevelScoringComplete;                                                     // 0x024C (size: 0x1)

}; // Size: 0x250

struct FGearUpdateStruct
{
    TArray<FEquipmentStruct> m_Outfits;                                               // 0x0000 (size: 0x10)
    class UBaseWeaponData* m_weaponData;                                              // 0x0010 (size: 0x8)
    ECharacterGender m_eGender;                                                       // 0x0018 (size: 0x1)
    uint8 m_uiSkinTone;                                                               // 0x0019 (size: 0x1)

}; // Size: 0x20

struct FGeneratedWallInfos
{
    class UCustomBoundingBoxComponent* m_Component;                                   // 0x0000 (size: 0x8)

}; // Size: 0x48

struct FGenericPushActorInfo
{
}; // Size: 0x7A0

struct FGuardUpdateStruct
{
    float m_fGuardGaugePercentageTargetValue;                                         // 0x0000 (size: 0x4)
    int64 m_iGuardGuageTargetTime;                                                    // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FHandPoseBlendStruct
{
    float m_fLength;                                                                  // 0x0000 (size: 0x4)
    ESCBlendType m_eBlendType;                                                        // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FHandledWeaponInfo
{
    TWeakObjectPtr<class UVisibleWeaponData> m_Data;                                  // 0x0000 (size: 0x8)
    TWeakObjectPtr<class AActor> m_WeaponOwner;                                       // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FHardpointInfos
{
    FName m_HardpointAreaName;                                                        // 0x0000 (size: 0x8)
    TSoftObjectPtr<AArenaHardpointAreaActor> m_HardPointAreaActor;                    // 0x0008 (size: 0x28)
    TSoftObjectPtr<AAISituationActor> m_AISituationLinkedToHardpoint;                 // 0x0030 (size: 0x28)

}; // Size: 0x58

struct FHitActionLauncherContext : public FGameplayEffectContext
{
    FHitDescription m_hitDescription;                                                 // 0x0070 (size: 0x568)

}; // Size: 0x5D8

struct FHitAnimsPerDataTable
{
    TMap<class FName, class FHitAnimsPerHitbox> m_HitAnimsPerHitboxMap;               // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FHitAnimsPerDataTableContainer
{
    TMap<class UDataTable*, class FHitAnimsPerDataTable> m_Data;                      // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FHitAnimsPerHitbox
{
    FDataTableRowHandle m_HitRow;                                                     // 0x0000 (size: 0x10)
    bool m_bUseCustomHit;                                                             // 0x0010 (size: 0x1)
    FHittedAnimContainer m_Hit;                                                       // 0x0018 (size: 0x68)
    bool m_bUseCustomGuard;                                                           // 0x0080 (size: 0x1)
    FHittedAnimContainer m_OnGuard;                                                   // 0x0088 (size: 0x68)
    bool m_bUseCustomDeath;                                                           // 0x00F0 (size: 0x1)
    FHittedAnimContainer m_OnDeath;                                                   // 0x00F8 (size: 0x68)

}; // Size: 0x160

struct FHitBox
{
    FBaseHitBoxConditionInstance m_activationCondition;                               // 0x0000 (size: 0x10)
    FHitBoxMetaDataClassInstance m_MetaData;                                          // 0x0010 (size: 0x10)
    FDataTableRowHandle m_HitRow;                                                     // 0x0020 (size: 0x10)
    FFrameRange m_FrameRange;                                                         // 0x0030 (size: 0x10)
    class UBaseHitDetectionDB* m_HitDetectionDB;                                      // 0x0040 (size: 0x8)
    EAttackTarget m_eHitTarget;                                                       // 0x0048 (size: 0x1)
    EAttackTarget m_eAltHitTarget;                                                    // 0x0049 (size: 0x1)
    EIKAnimTargetTypes m_eAimTarget;                                                  // 0x004A (size: 0x1)
    EAttackMovementType m_eMovementType;                                              // 0x004B (size: 0x1)
    EAttackOrigin m_eOrigin;                                                          // 0x004C (size: 0x1)
    EAttackOrigin m_eAvoidCustomOrigin;                                               // 0x004D (size: 0x1)
    EAttackTarget m_eAvoidCustomHitTarget;                                            // 0x004E (size: 0x1)
    EAttackMovementType m_eAvoidCustomMovementType;                                   // 0x004F (size: 0x1)
    FHitboxDataRow m_CachedRow;                                                       // 0x0050 (size: 0x240)

}; // Size: 0x298

struct FHitBoxMetaDataClassInstance
{
    TSubclassOf<class UHitBoxMetaData> m_DefaultClassObject;                          // 0x0000 (size: 0x8)
    class UHitBoxMetaData* m_Instance;                                                // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FHitDefenseResult
{
    EOrderType m_eDefenseOrder;                                                       // 0x0000 (size: 0x1)
    uint8 m_uiOrderID;                                                                // 0x0001 (size: 0x1)
    uint8 m_uiDefenseType;                                                            // 0x0002 (size: 0x1)
    bool m_bHitDismissed;                                                             // 0x0003 (size: 0x1)
    bool m_bResultRemoved;                                                            // 0x0004 (size: 0x1)
    bool m_bIsPlayingOrder;                                                           // 0x0005 (size: 0x1)
    class USpecialAbilityPropertyDB* m_DB;                                            // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FHitDescription
{
    FHitRequest m_Request;                                                            // 0x0000 (size: 0x418)
    FHitResult m_Result;                                                              // 0x0418 (size: 0x8C)
    FImpactResult m_ImpactResult;                                                     // 0x04A8 (size: 0xC0)

}; // Size: 0x568

struct FHitImpact
{
    bool m_bUseDamage;                                                                // 0x0009 (size: 0x1)
    float m_fDamage;                                                                  // 0x000C (size: 0x4)
    bool m_bUseStructureDamage;                                                       // 0x0010 (size: 0x1)
    float m_fStructureDamage;                                                         // 0x0014 (size: 0x4)
    bool m_bUseSuperDizzyDamage;                                                      // 0x0018 (size: 0x1)
    float m_fSuperDizzyDamage;                                                        // 0x001C (size: 0x4)
    bool m_bUseNbFrameStuned;                                                         // 0x0020 (size: 0x1)
    uint8 m_iNbFrameStuned;                                                           // 0x0021 (size: 0x1)
    bool m_bUseKnockBackDistance;                                                     // 0x0022 (size: 0x1)
    float m_fKnockBackDistance;                                                       // 0x0024 (size: 0x4)
    bool m_bUseFreezeFrames;                                                          // 0x0028 (size: 0x1)
    int32 m_iFreezeFrames;                                                            // 0x002C (size: 0x4)

}; // Size: 0x30

struct FHitRequest
{
    FAttackRequest m_AttackRequest;                                                   // 0x0010 (size: 0x48)
    FHitResult m_EnvironmentImpact;                                                   // 0x0058 (size: 0x8C)
    TWeakObjectPtr<class AActor> m_Instigator;                                        // 0x00E4 (size: 0x8)
    TWeakObjectPtr<class AActor> m_InstigatorItem;                                    // 0x00EC (size: 0x8)
    FVector m_InstigatorDirection;                                                    // 0x00F4 (size: 0xC)
    EInstigatorType m_eInstigatorType;                                                // 0x0100 (size: 0x1)
    TWeakObjectPtr<class AActor> m_Target;                                            // 0x0104 (size: 0x8)
    FHitBox m_HitBox;                                                                 // 0x0110 (size: 0x298)
    ELimbs m_eAttackerLimb;                                                           // 0x03A8 (size: 0x1)
    uint8 m_uiDamageID;                                                               // 0x03C8 (size: 0x1)
    uint8 m_uiAttackOrderID;                                                          // 0x03C9 (size: 0x1)
    FVector m_vDamageDir;                                                             // 0x03CC (size: 0xC)
    bool m_bCastBoundariesRelativeToInstigator;                                       // 0x03D8 (size: 0x1)
    TWeakObjectPtr<class AUsableItem> m_UsableItemIntermediate;                       // 0x03DC (size: 0x8)
    bool m_bMirror;                                                                   // 0x03E4 (size: 0x1)
    FGameplayTagContainer m_AttackProperties;                                         // 0x03E8 (size: 0x20)
    uint8 m_uiHitBoxID;                                                               // 0x0408 (size: 0x1)
    bool m_bCanBeDefended;                                                            // 0x0409 (size: 0x1)

}; // Size: 0x418

struct FHitRequestAdditionalInfo
{
}; // Size: 0x8

struct FHitboxDataRow : public FTableRowBase
{
    int32 m_iHitboxGroupID;                                                           // 0x0008 (size: 0x4)
    float m_fMaxImpactAngle;                                                          // 0x000C (size: 0x4)
    bool m_bIgnoreImpactAngleWhenPenetrating;                                         // 0x0010 (size: 0x1)
    int32 m_uiTargetFilters;                                                          // 0x0014 (size: 0x4)
    FGameplayTagContainer m_HitboxGameplayTags;                                       // 0x0018 (size: 0x20)
    bool m_bOnlyHitCharacterWithRequiredHitboxGameplayTags;                           // 0x0038 (size: 0x1)
    FGameplayTagContainer m_AdditionalHitboxGameplayTagsOnTarget;                     // 0x0040 (size: 0x20)
    FGameplayTagContainer m_RequiredGameplayTags;                                     // 0x0060 (size: 0x20)
    bool m_bHitTargetOnly;                                                            // 0x0080 (size: 0x1)
    bool m_bIgnoreTarget;                                                             // 0x0081 (size: 0x1)
    bool m_bHitAnyCharacterOnAvoid;                                                   // 0x0082 (size: 0x1)
    bool m_bCanTouchMultipleTargetAtOnce;                                             // 0x0083 (size: 0x1)
    bool m_bCanBeLethal;                                                              // 0x0084 (size: 0x1)
    bool m_bCanBreakStructure;                                                        // 0x0085 (size: 0x1)
    FHitImpact m_OnHitImpact;                                                         // 0x0088 (size: 0x30)
    class UCurveFloat* m_KnockBackDynamicOnHit;                                       // 0x00B8 (size: 0x8)
    FHitImpact m_OnGuardImpact;                                                       // 0x00C0 (size: 0x30)
    class UCurveFloat* m_KnockBackDynamicOnGuard;                                     // 0x00F0 (size: 0x8)
    FDeflectImpact m_OnDeflectImpact;                                                 // 0x00F8 (size: 0x48)
    EHittedReaction m_eHittedReaction;                                                // 0x0140 (size: 0x1)
    TSubclassOf<class UHitActionLauncher> m_hitAction;                                // 0x0148 (size: 0x8)
    bool m_bNotifyHittedOnHitAction;                                                  // 0x0150 (size: 0x1)
    bool m_bApplyFreezeFramesOnHitAction;                                             // 0x0151 (size: 0x1)
    bool m_bPlayRumbleOnHitAction;                                                    // 0x0152 (size: 0x1)
    bool m_bPlayRumbleOnNormalHit;                                                    // 0x0153 (size: 0x1)
    EHitType m_eHitType;                                                              // 0x0154 (size: 0x1)
    FSCUserDefinedEnumHandler m_HitContext;                                           // 0x0158 (size: 0x50)
    EAttackPowers m_eAttackPower;                                                     // 0x01A8 (size: 0x1)
    bool m_bOverrideResilience;                                                       // 0x01A9 (size: 0x1)
    int32 m_iOverrideResilienceValue;                                                 // 0x01AC (size: 0x4)
    bool m_bDizzyOnAvoid;                                                             // 0x01B0 (size: 0x1)
    bool m_bDizzyOnParry;                                                             // 0x01B1 (size: 0x1)
    bool m_bParriable;                                                                // 0x01B2 (size: 0x1)
    bool m_bPlayAvoidedOrder;                                                         // 0x01B3 (size: 0x1)
    FAttackPropertyLevel m_AttackPropertyLevel;                                       // 0x01B4 (size: 0x24)
    TMap<class EFightingState, class FAttackPropertyLevel> m_AttackPropertyLevelOverrides; // 0x01D8 (size: 0x50)
    float m_fMinKnockbackAngleFromHit;                                                // 0x0228 (size: 0x4)
    EKnockbackBehavior m_eKnockBackBehavior;                                          // 0x022C (size: 0x1)
    float m_fKnockbackEastWestAngle;                                                  // 0x0230 (size: 0x4)
    int32 m_iHitboxDefenseMatrix;                                                     // 0x0234 (size: 0x4)
    int32 m_iAvoidableDefenseMatrix;                                                  // 0x0238 (size: 0x4)

}; // Size: 0x240

struct FHittedAnimCardinalOnlyArray
{
    FAnimContainer m_Array;                                                           // 0x0000 (size: 0x60)

}; // Size: 0x60

struct FHittedAnimContainer : public FAnimContainer
{
    bool m_bLockAttacker;                                                             // 0x0018 (size: 0x1)
    EKnockbackReorientationBehaviour m_eReorientationBehaviour;                       // 0x0019 (size: 0x1)
    bool m_bInterruptible;                                                            // 0x001A (size: 0x1)
    bool m_bInterruptAnimationOnEnd;                                                  // 0x001B (size: 0x1)
    bool m_bScaleAnimationToHitDuration;                                              // 0x001C (size: 0x1)
    bool m_bInvertReorientationFromBehind;                                            // 0x001D (size: 0x1)
    ESCCardinalPoints m_eOrientationOffset;                                           // 0x001E (size: 0x1)
    bool m_bUseRootMotion;                                                            // 0x001F (size: 0x1)
    bool m_bIgnoreHitKnockbackDistance;                                               // 0x0020 (size: 0x1)
    FAnimContainer m_FightingStateLoopAnim;                                           // 0x0028 (size: 0x18)
    TArray<FHittedOrderServiceInfos> m_OrderServices;                                 // 0x0040 (size: 0x10)
    bool m_bOverrideHitDuration;                                                      // 0x005C (size: 0x1)
    float m_fOverrideHitDuration;                                                     // 0x0060 (size: 0x4)

}; // Size: 0x68

struct FHittedOrderServiceInfos
{
    float m_fStartDelayFrames;                                                        // 0x0000 (size: 0x4)
    bool m_bUseCustomEnabledDuration;                                                 // 0x0004 (size: 0x1)
    float m_fEnabledFrames;                                                           // 0x0008 (size: 0x4)
    TSubclassOf<class UOrderService> m_OrderService;                                  // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FHittedServiceInfos
{
    bool m_bDiscardHitOrderOnSurvive;                                                 // 0x0000 (size: 0x1)
    bool m_bDiscardHitOrderOnKill;                                                    // 0x0001 (size: 0x1)
    bool m_bDropWeaponOnKill;                                                         // 0x0002 (size: 0x1)
    bool m_bDiscardFightingStatesOrders;                                              // 0x0003 (size: 0x1)
    bool m_bEnqueueFightingStateOrder;                                                // 0x0004 (size: 0x1)
    class UAnimSequence* m_DeathAnimationOnStop;                                      // 0x0008 (size: 0x8)
    bool m_bMirrorDeathAnimation;                                                     // 0x0010 (size: 0x1)
    bool m_bGenerateImpactOnStop;                                                     // 0x0011 (size: 0x1)
    bool m_bUseCustomHitAnimOnKill;                                                   // 0x0012 (size: 0x1)
    FHittedAnimContainer m_CustomHitAnimOnKill;                                       // 0x0018 (size: 0x68)
    bool m_bUseCustomHitAnimOnSurvive;                                                // 0x0080 (size: 0x1)
    FHittedAnimContainer m_CustomHitAnimOnSurvive;                                    // 0x0088 (size: 0x68)
    bool m_bForceDamageToHitBox;                                                      // 0x00F0 (size: 0x1)
    bool m_bForceStructureDamageToHitBox;                                             // 0x00F1 (size: 0x1)
    bool m_bLaunchFightingStateOrderAfterCurrentAnim;                                 // 0x00F2 (size: 0x1)
    bool m_bStructureBrokenOrderWaitForEndOfAnim;                                     // 0x00F3 (size: 0x1)
    bool m_bDelayKillToNextHit;                                                       // 0x00F4 (size: 0x1)
    bool m_bUseCustomFightingStateLoopAnim;                                           // 0x00F5 (size: 0x1)
    FHittedAnimContainer m_CustomFightingStateLoopAnim;                               // 0x00F8 (size: 0x68)
    bool m_bUseCustomFightingStateRecoveryAnim;                                       // 0x0160 (size: 0x1)
    FHittedAnimContainer m_CustomFightingStateRecoveryAnim;                           // 0x0168 (size: 0x68)
    FBoneReference m_OptionalImpactBone;                                              // 0x01D0 (size: 0x10)
    bool m_bPlayHitSFX;                                                               // 0x01E0 (size: 0x1)
    bool m_bPlayDeathSFX;                                                             // 0x01E1 (size: 0x1)
    bool m_bPlayHitVFX;                                                               // 0x01E2 (size: 0x1)

}; // Size: 0x1E8

struct FIKProfileBlendInfos
{
    float m_fValueCoef;                                                               // 0x0000 (size: 0x4)
    float m_fBlendInDuration;                                                         // 0x0004 (size: 0x4)
    TEnumAsByte<EEasingFunc::Type> m_eBlendInFunction;                                // 0x0008 (size: 0x1)
    float m_fBlendOutDuration;                                                        // 0x000C (size: 0x4)
    TEnumAsByte<EEasingFunc::Type> m_eBlendOutFunction;                               // 0x0010 (size: 0x1)
    FName m_CurveName;                                                                // 0x0014 (size: 0x8)

}; // Size: 0x1C

struct FIKPropertyEvaluation
{
    FSCUserDefinedEnumHandler m_Mirror;                                               // 0x0000 (size: 0x50)
    FBoneReference m_RootLimbBone;                                                    // 0x0050 (size: 0x10)
    FBoneReference m_TipBone;                                                         // 0x0060 (size: 0x10)
    float m_fBoneLocationAlpha;                                                       // 0x0070 (size: 0x4)
    float m_fBoneRotationAlpha;                                                       // 0x0074 (size: 0x4)
    float m_fLimbRotationAlpha;                                                       // 0x0078 (size: 0x4)
    FVector m_vSelfReferenceBonePosition;                                             // 0x007C (size: 0xC)
    FVector m_vTargetBonePosition;                                                    // 0x0088 (size: 0xC)
    FRotator m_TargetBoneRotation;                                                    // 0x0094 (size: 0xC)
    FTransform m_TipBoneWantedTransform;                                              // 0x00A0 (size: 0x30)
    FRotator m_LimbLocalRotation;                                                     // 0x00D0 (size: 0xC)

}; // Size: 0xE0

struct FIconTextures
{
    class UTexture2D* m_Textures;                                                     // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FIdleAnimAndTransition
{
    FAnimContainer m_IdleAnimation;                                                   // 0x0000 (size: 0x18)
    FAnimContainer m_IdleExitTransition;                                              // 0x0018 (size: 0x60)

}; // Size: 0x78

struct FIdleAnimPerSex
{
    FAnimContainer m_AnimsPerSex;                                                     // 0x0000 (size: 0x30)

}; // Size: 0x30

struct FImpactResult
{
    bool m_bIsValid;                                                                  // 0x0000 (size: 0x1)
    float m_fDamage;                                                                  // 0x0004 (size: 0x4)
    bool m_bGuardBreak;                                                               // 0x0008 (size: 0x1)
    bool m_bSuperDizzyAlreadyAvailable;                                               // 0x0009 (size: 0x1)
    bool m_bSuperDizzyAvailable;                                                      // 0x000A (size: 0x1)
    class AActor* m_Victim;                                                           // 0x0010 (size: 0x8)
    ESCCardinalPoints m_eImpactCardinalPoint;                                         // 0x0018 (size: 0x1)
    ESCCardinalPoints m_eImpactCardinalPointInVictimSpace;                            // 0x0019 (size: 0x1)
    bool m_bAlreadyGuardBroken;                                                       // 0x001A (size: 0x1)
    bool m_bCriticalHit;                                                              // 0x001B (size: 0x1)
    EHeight m_eHeight;                                                                // 0x001C (size: 0x1)
    EImpactType m_eImpactType;                                                        // 0x001D (size: 0x1)
    EGuardType m_eGuardType;                                                          // 0x001E (size: 0x1)
    FAppliedHitImpact m_HitImpact;                                                    // 0x0020 (size: 0x18)
    FAppliedDeflectImpact m_DeflectImpact;                                            // 0x0038 (size: 0x28)
    float m_fInstigatorStructureBeforeImpact;                                         // 0x0060 (size: 0x4)
    float m_fHitAnimationTimeElapsedDuringFreeze;                                     // 0x0064 (size: 0x4)
    bool m_bLethal;                                                                   // 0x0068 (size: 0x1)
    FVector m_vKnockbackPosition;                                                     // 0x006C (size: 0xC)
    EQuadrantTypes m_eTowardInstigatorQuadrant;                                       // 0x0078 (size: 0x1)
    EQuadrantTypes m_eDefenderQuadrant;                                               // 0x0079 (size: 0x1)
    bool bPushedBlockForce;                                                           // 0x007A (size: 0x1)
    FVector m_vImpactLocation;                                                        // 0x007C (size: 0xC)
    FVector m_vImpactDir;                                                             // 0x0088 (size: 0xC)
    float m_fInstigatorFreezeDuration;                                                // 0x0094 (size: 0x4)
    float m_fStunTime;                                                                // 0x0098 (size: 0x4)
    bool m_bResilienceImpact;                                                         // 0x00A8 (size: 0x1)
    FBoneReference m_OptionalImpactBone;                                              // 0x00AC (size: 0x10)
    bool m_bPlaySFX;                                                                  // 0x00BC (size: 0x1)
    bool m_bPlayDeathSFX;                                                             // 0x00BD (size: 0x1)
    bool m_bPlayVFX;                                                                  // 0x00BE (size: 0x1)
    bool m_bAvoidDizzy;                                                               // 0x00BF (size: 0x1)

}; // Size: 0xC0

struct FInFightPlayersInfo
{
    TWeakObjectPtr<class AActor> m_EnemyActor;                                        // 0x0000 (size: 0x8)

}; // Size: 0xC

struct FInGameSequenceReplicationInfo
{
    class ULevelSequence* m_LevelSequenceToReplay;                                    // 0x0000 (size: 0x8)
    FMovieSceneSequencePlaybackParams m_playbackParams;                               // 0x0008 (size: 0x28)
    ESequenceState m_eSequenceState;                                                  // 0x0030 (size: 0x1)

}; // Size: 0x38

struct FInheritedBoolStruct : public FInheritedStruct
{
    bool m_bParentBool;                                                               // 0x0010 (size: 0x1)
    bool m_bFinalBool;                                                                // 0x0011 (size: 0x1)
    EInheritanceChoice m_eInheritanceChoice;                                          // 0x0012 (size: 0x1)

}; // Size: 0x18

struct FInheritedCurveFloatStruct : public FInheritedStruct
{
    class UCurveFloat* m_parentCurveFloat;                                            // 0x0010 (size: 0x8)
    class UCurveFloat* m_finalCurveFloat;                                             // 0x0018 (size: 0x8)
    EInheritanceChoice m_eInheritanceChoice;                                          // 0x0020 (size: 0x1)

}; // Size: 0x28

struct FInheritedFloatStruct : public FInheritedStruct
{
    float m_fParentValue;                                                             // 0x0010 (size: 0x4)
    float m_fFinalValue;                                                              // 0x0014 (size: 0x4)
    float m_fFactorValue;                                                             // 0x0018 (size: 0x4)
    float m_fOffsetValue;                                                             // 0x001C (size: 0x4)

}; // Size: 0x20

struct FInheritedStruct
{
    bool m_bOverrideParentValue;                                                      // 0x0008 (size: 0x1)
    bool m_bIsEditable;                                                               // 0x0009 (size: 0x1)

}; // Size: 0x10

struct FInheritedVec3Struct
{
    FInheritedFloatStruct m_X;                                                        // 0x0000 (size: 0x20)
    FInheritedFloatStruct m_Y;                                                        // 0x0020 (size: 0x20)
    FInheritedFloatStruct m_Z;                                                        // 0x0040 (size: 0x20)

}; // Size: 0x60

struct FInputActionData
{
    float m_fStackLifeSpan;                                                           // 0x0000 (size: 0x4)
    bool m_bUseScaledTime;                                                            // 0x0004 (size: 0x1)
    bool m_bBlockLowerContext;                                                        // 0x0005 (size: 0x1)

}; // Size: 0x8

struct FInputBehaviourStruct
{
    InputBehavior m_Behavior;                                                         // 0x0000 (size: 0x1)
    float m_fTimePressed;                                                             // 0x0004 (size: 0x4)
    bool m_bAutoReset;                                                                // 0x0008 (size: 0x1)
    bool m_bRegisterPressTimeOnStack;                                                 // 0x0009 (size: 0x1)
    bool m_bRemovePressedTimeFromTimeLeft;                                            // 0x000A (size: 0x1)

}; // Size: 0xC

struct FInputDataTutorialStruct
{
    FText m_PrefixText;                                                               // 0x0000 (size: 0x18)
    InputAction m_eInputAction;                                                       // 0x0018 (size: 0x1)
    class UGenericInputData* m_InputDataPad;                                          // 0x0020 (size: 0x8)
    class UGenericInputData* m_InputDataMouse;                                        // 0x0028 (size: 0x8)
    EControllerIconAxisTypes m_eAxisType;                                             // 0x0030 (size: 0x1)
    FText m_SuffixText;                                                               // 0x0038 (size: 0x18)
    EInputDataTutorialDisplayConstraints m_InputDataTutorialDisplayConstraint;        // 0x0050 (size: 0x1)

}; // Size: 0x58

struct FInputDetection
{
    InputAction m_eInput;                                                             // 0x0000 (size: 0x1)
    bool m_bValidateOnEnterStack;                                                     // 0x0001 (size: 0x1)
    int32 m_iEnterStackValidation;                                                    // 0x0004 (size: 0x4)
    bool m_bValidateOnExitStack;                                                      // 0x0008 (size: 0x1)
    FBaseActorConditionInstance m_BaseCondition;                                      // 0x0010 (size: 0x10)
    class UTargetActionTypeRequest* m_TargetActionTypeRequest;                        // 0x0020 (size: 0x8)
    EActionType m_eTarget;                                                            // 0x0028 (size: 0x1)
    bool m_bIgnoreTargetOnPriorityResolution;                                         // 0x0029 (size: 0x1)
    int32 m_iNoTargetPriority;                                                        // 0x002C (size: 0x4)
    bool m_bRequiresTarget;                                                           // 0x0030 (size: 0x1)
    bool m_bRequiresTargetOnStack;                                                    // 0x0031 (size: 0x1)
    FBaseActorConditionInstance m_bRequiresTargetCondition;                           // 0x0038 (size: 0x10)
    bool m_bUpdateTargetOnExitStack;                                                  // 0x0048 (size: 0x1)
    EUpdateTargetCondition m_eUpdateTargetOnExitStackCondition;                       // 0x0049 (size: 0x1)
    bool m_bResetInputOnDismiss;                                                      // 0x004A (size: 0x1)
    bool m_bResetInputOnActivation;                                                   // 0x004B (size: 0x1)
    bool m_bResetHoldToggleInputOnAbilityEnd;                                         // 0x004C (size: 0x1)

}; // Size: 0x50

struct FInputHandleContainer
{
    FInputHandleContainer_Delegate m_Delegate;                                        // 0x0000 (size: 0x10)
    bool BPInputHandleSignature();
    InputAction m_eAction;                                                            // 0x0010 (size: 0x1)

}; // Size: 0x14

struct FInputKeyMappingHandler
{
    FKey m_Key;                                                                       // 0x0000 (size: 0x18)
    FName m_ActionName;                                                               // 0x0018 (size: 0x8)
    FName m_AxisName;                                                                 // 0x0020 (size: 0x8)
    bool m_bShift;                                                                    // 0x0028 (size: 0x1)
    bool m_bAlt;                                                                      // 0x0029 (size: 0x1)
    bool m_bCmd;                                                                      // 0x002A (size: 0x1)
    bool m_bCtrl;                                                                     // 0x002B (size: 0x1)
    float m_fScale;                                                                   // 0x002C (size: 0x4)

}; // Size: 0x30

struct FInputMapping
{
    FInputMappingData m_MappingData;                                                  // 0x0000 (size: 0x68)

}; // Size: 0x68

struct FInputMappingCompatibilityRule
{
    EInputMappingCompatibilityRuleType m_eRule;                                       // 0x0000 (size: 0x4)
    TArray<TSoftObjectPtr<UGenericInputData>> m_Classes;                              // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FInputMappingData
{
    FInputPresetsEnumHandler m_PresetID;                                              // 0x0000 (size: 0x50)
    class UGenericInputData* m_InputData;                                             // 0x0050 (size: 0x8)
    TArray<FInputMappingKeySlotContainer> m_Slots;                                    // 0x0058 (size: 0x10)

}; // Size: 0x68

struct FInputMappingGroup
{
    TMap<class InputAction, class FInputMapping> m_Mapping;                           // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FInputMappingKeySlot
{
    EVirtualAction m_eVirtualAction;                                                  // 0x0000 (size: 0x4)
    TArray<FInputActionKeyMapping> m_Actions;                                         // 0x0008 (size: 0x10)
    TArray<FInputAxisKeyMapping> m_Axis;                                              // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FInputMappingKeySlotContainer
{
    FInputPresetsEnumHandler m_PresetID;                                              // 0x0000 (size: 0x50)
    class UGenericInputData* m_SubInputData;                                          // 0x0050 (size: 0x8)
    FInputMappingKeySlot m_Key;                                                       // 0x0058 (size: 0x28)
    FSaveGameInputMappingKeySlot m_SaveGameKey;                                       // 0x0080 (size: 0x28)

}; // Size: 0xA8

struct FInputMappingNode
{
    class UGenericInputData* m_InputData;                                             // 0x0000 (size: 0x8)
    FInputPresetsEnumHandler m_Preset;                                                // 0x0008 (size: 0x50)
    FInputMappingKeySlot m_KeySlot;                                                   // 0x0058 (size: 0x28)

}; // Size: 0x90

struct FInputMappingProfileData
{
    bool m_IsSet;                                                                     // 0x0000 (size: 0x1)
    TMap<class FInputPresetsEnumHandler, class FInputMappingData> m_Presets;          // 0x0008 (size: 0x50)
    TMap<class InputContext, class FInputMappingGroup> m_MappingPerContext;           // 0x0058 (size: 0x50)

}; // Size: 0xA8

struct FInputMappingProfileEnumHandler : public FSCUserDefinedEnumHandler
{
}; // Size: 0x50

struct FInputMappingTree
{
    TMap<class InputAction, class FInputMappingNode> m_NodePerAction;                 // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FInputPresetsEnumHandler : public FSCUserDefinedEnumHandler
{
}; // Size: 0x50

struct FInputPriorityGroup
{
    TSet<TSoftObjectPtr<UGenericInputData>> m_Data;                                   // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FInputSequenceStep
{
    class UGenericInputData* m_Input;                                                 // 0x0000 (size: 0x8)
    FFloatRange m_DelayBeforeNextAction;                                              // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FInputTutorialStruct
{
    TArray<FInputDataTutorialStruct> m_InputSequence;                                 // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FIntStatBinding : public FBaseStatBindings
{
    int32 m_iValue;                                                                   // 0x0048 (size: 0x4)

}; // Size: 0x50

struct FInteractionHintInfo
{
    bool m_bIsVisible;                                                                // 0x0000 (size: 0x1)
    bool m_bIsUsable;                                                                 // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FInteractionTextStruct
{
    FText m_FirstText;                                                                // 0x0000 (size: 0x18)
    InputAction m_eInputAction;                                                       // 0x0018 (size: 0x1)
    FText m_SecondText;                                                               // 0x0020 (size: 0x18)

}; // Size: 0x38

struct FInterchangeableData
{
    FBaseActorConditionInstance m_condition;                                          // 0x0000 (size: 0x10)
    class UGenericInputData* m_Data;                                                  // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FIntroShopDataRow : public FTableRowBase
{
    FName m_RowName;                                                                  // 0x0008 (size: 0x8)
    int32 m_iGMLevelRequired;                                                         // 0x0010 (size: 0x4)
    int32 m_iGleamLevelRequired;                                                      // 0x0014 (size: 0x4)
    int32 m_iFragmentPrice;                                                           // 0x0018 (size: 0x4)
    int32 m_iPrestigePointPrice;                                                      // 0x001C (size: 0x4)

}; // Size: 0x20

struct FInventoryItem
{
    FEquipmentStruct m_Item;                                                          // 0x0000 (size: 0x78)
    int32 m_iItemCount;                                                               // 0x0078 (size: 0x4)
    bool m_bIsEquipped;                                                               // 0x007C (size: 0x1)
    int8 m_iEquippedItemSlot;                                                         // 0x007D (size: 0x1)
    float m_fDurability;                                                              // 0x0084 (size: 0x4)
    bool m_bBroken;                                                                   // 0x0089 (size: 0x1)
    bool m_bIsNew;                                                                    // 0x008A (size: 0x1)

}; // Size: 0x90

struct FInventoryItemArray
{
    TArray<FInventoryItem> m_ItemList;                                                // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FInventorySearchFilter
{
    EEquipmentSlot m_eSlot;                                                           // 0x0000 (size: 0x1)
    bool m_bOutfitsOnly;                                                              // 0x0001 (size: 0x1)
    bool m_bOnlyNewItems;                                                             // 0x0002 (size: 0x1)
    bool m_bIgnoreMentoringItems;                                                     // 0x0003 (size: 0x1)

}; // Size: 0x4

struct FItemEffects
{
    EEffectTarget m_eEffectTarget;                                                    // 0x0000 (size: 0x1)
    class UEffectData* m_EffectData;                                                  // 0x0008 (size: 0x8)
    int32 m_iAOEWantedRelations;                                                      // 0x0010 (size: 0x4)

}; // Size: 0x28

struct FJiggleAnimContainer
{
    FCardinalAnimContainer m_JiggleAnimations;                                        // 0x0000 (size: 0x60)
    bool m_bAllowWeapons;                                                             // 0x0060 (size: 0x1)

}; // Size: 0x68

struct FLockMoveAnimQuadrant
{
    FAnimContainer m_LockMoveAnimContainer;                                           // 0x0000 (size: 0x60)
    FBlendSpaceDirectionContainer m_LockMoveBlendSpace;                               // 0x0060 (size: 0x20)
    FBlendSpaceDirectionContainer m_LockMoveUpperBodyBlendSpace;                      // 0x0080 (size: 0x20)

}; // Size: 0xA0

struct FLocomotionPaceSelector
{
    FSpeedStateFromGoalDistSelector m_speedStateFromGoalDistSelectors;                // 0x0000 (size: 0x24)

}; // Size: 0x24

struct FLocomotionRotationParams
{
    ELocomotionRotationType m_eRotationType;                                          // 0x0000 (size: 0x1)
    float m_fSnapDuration;                                                            // 0x0004 (size: 0x4)
    float m_fLerpFactor;                                                              // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FLocomotionTransitionsAnimContainer
{
    FCombatSpeedTransitionsAnimContainer m_V1;                                        // 0x0000 (size: 0x8A0)
    FSpeedTransitionsAnimContainer m_V2;                                              // 0x08A0 (size: 0x2D0)
    FSpeedTransitionsAnimContainer m_V3;                                              // 0x0B70 (size: 0x2D0)
    FOrientedRotationAnimContainer m_TurnInPlace;                                     // 0x0E40 (size: 0x120)

}; // Size: 0xF60

struct FLocomotionTransitionsResultCache
{
    bool m_bToV0;                                                                     // 0x0000 (size: 0x1)
    bool m_bToV1;                                                                     // 0x0001 (size: 0x1)
    bool m_bToV2;                                                                     // 0x0002 (size: 0x1)
    bool m_bTransitionToV0;                                                           // 0x0003 (size: 0x1)
    bool m_bTransitionToV1;                                                           // 0x0004 (size: 0x1)
    bool m_bTransitionToV1_MoveStatusCombat;                                          // 0x0005 (size: 0x1)
    bool m_bTransitionToV1_AIHack;                                                    // 0x0006 (size: 0x1)
    bool m_bTransitionToV2;                                                           // 0x0007 (size: 0x1)
    bool m_bTransitionToV3;                                                           // 0x0008 (size: 0x1)
    bool m_bIsInTransition;                                                           // 0x0009 (size: 0x1)

}; // Size: 0xA

struct FLookAtAnimHandler
{
    FAimOffsetStruct m_aimOffset0;                                                    // 0x0000 (size: 0x18)
    FAimOffsetStruct m_aimOffset1;                                                    // 0x0018 (size: 0x18)
    int32 m_iAimOffsetIndex;                                                          // 0x0030 (size: 0x4)
    bool m_bLookAtEnabled;                                                            // 0x0034 (size: 0x1)
    FVector2D m_vRawBlendSpaceParams;                                                 // 0x0038 (size: 0x8)
    FVector2D m_vBlendSpaceParams;                                                    // 0x0040 (size: 0x8)
    FVector2D m_vEyeBlendSpaceParams;                                                 // 0x0048 (size: 0x8)
    FRotator m_BoneModifierRot;                                                       // 0x0050 (size: 0xC)
    FRotator m_CompensationRot;                                                       // 0x005C (size: 0xC)
    bool m_bIsTargetLocationValid;                                                    // 0x0068 (size: 0x1)
    FVector m_vTargetLocation;                                                        // 0x006C (size: 0xC)
    bool m_bEnableAnimationCompensation;                                              // 0x0078 (size: 0x1)
    float m_fMaxHeadDiffYaw;                                                          // 0x007C (size: 0x4)
    float m_fMaxHeadDiffPitch;                                                        // 0x0080 (size: 0x4)
    FName m_headInWorldSpaceSaveBoneName;                                             // 0x0084 (size: 0x8)
    FName m_headComparaisonInWorldSpaceSaveBoneName;                                  // 0x008C (size: 0x8)
    FName m_headInWorldSpacePostLookAtSaveBoneName;                                   // 0x0094 (size: 0x8)
    bool m_bEyesLookAtSpecificBone;                                                   // 0x009C (size: 0x1)
    FName m_EyesLookAtSpecificBoneName;                                               // 0x00A0 (size: 0x8)
    ELookAtApplyMode m_eApplyMode;                                                    // 0x00A8 (size: 0x1)
    ELookAtRefDirMode m_eRefDirMode;                                                  // 0x00A9 (size: 0x1)
    float m_fAngleThreshold;                                                          // 0x00C8 (size: 0x4)
    float m_fMaxFrontAngle;                                                           // 0x00CC (size: 0x4)
    bool m_bLookInCameraDir;                                                          // 0x00D0 (size: 0x1)
    TSubclassOf<class ULookAtAnimRequest2> m_animRequest;                             // 0x00D8 (size: 0x8)
    FLookAtConfig m_lookAtConfigs;                                                    // 0x00E0 (size: 0x78)
    TArray<ELookAtTargetType> m_targetPriorities;                                     // 0x0158 (size: 0x10)
    FLookAtModifierParams m_defaultModifierParams;                                    // 0x0168 (size: 0x14)
    FLookAtLimits m_boneModifierLimits;                                               // 0x0180 (size: 0x90)
    bool m_bInverseValuesOnBoneModifier;                                              // 0x0210 (size: 0x1)
    FVector2D m_vBoneModifierOffset;                                                  // 0x0214 (size: 0x8)
    FVector2D m_vBoneModifierMultiplier;                                              // 0x021C (size: 0x8)
    FLookAtLimits m_defaultLimits;                                                    // 0x0228 (size: 0x90)
    TArray<FLookAtLocomotionLimits> m_locomotionLimits;                               // 0x02B8 (size: 0x10)
    TMap<class ETransitionGlobalType, class FLookAtLimits> m_transitionLimits;        // 0x02C8 (size: 0x50)
    FLookAtModifierParams m_friendlyModifierParams;                                   // 0x0318 (size: 0x14)
    FLookAtModifierParams m_hostileInIdleModifierParams;                              // 0x032C (size: 0x14)
    uint32 m_uiFirstLocalPlayerAIBehavior;                                            // 0x0340 (size: 0x4)
    float m_fMaxDistFromFirstLocalPlayer;                                             // 0x0344 (size: 0x4)

}; // Size: 0x488

struct FLookAtConfig
{
    bool m_bCanHaveInteractionComponent;                                              // 0x0000 (size: 0x1)
    class ULookAtConfigData* m_configData;                                            // 0x0008 (size: 0x8)
    float m_fValidDuration;                                                           // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FLookAtLimits
{
    bool m_bEnabled;                                                                  // 0x0000 (size: 0x1)
    float m_fYawLimit;                                                                // 0x0004 (size: 0x4)
    FRuntimeFloatCurve m_pitchLimitByYaw;                                             // 0x0008 (size: 0x88)

}; // Size: 0x90

struct FLookAtLocomotionLimits
{
    ESpeedState m_eSpeedState;                                                        // 0x0000 (size: 0x1)
    EMoveStatus m_eMoveStatus;                                                        // 0x0001 (size: 0x1)
    FLookAtLimits m_limits;                                                           // 0x0008 (size: 0x90)

}; // Size: 0x98

struct FLookAtModifierParams
{
    bool m_bOverrideSpringSpeed;                                                      // 0x0000 (size: 0x1)
    float m_fOverridenSpringSpeed;                                                    // 0x0004 (size: 0x4)
    float m_fRotationMultiplier;                                                      // 0x0008 (size: 0x4)
    float m_fMaxClampedYaw;                                                           // 0x000C (size: 0x4)
    float m_fMaxClampedPitch;                                                         // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FLootBaseItemStruct
{
    class UBaseItemData* m_Item;                                                      // 0x0000 (size: 0x8)
    uint16 m_uiItemNumber;                                                            // 0x0008 (size: 0x2)
    uint8 m_uiMaterialIndex;                                                          // 0x000A (size: 0x1)

}; // Size: 0x10

struct FLootBoxDataRow : public FTableRowBase
{
    class UBaseItemData* m_Item;                                                      // 0x0008 (size: 0x8)
    TArray<int32> m_Materials;                                                        // 0x0010 (size: 0x10)
    int32 m_iGMLevelRequired;                                                         // 0x0020 (size: 0x4)
    int32 m_iGleamLevelRequired;                                                      // 0x0024 (size: 0x4)
    int32 m_iWeight;                                                                  // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FLootBoxInstancedData
{
    int32 m_iGMLevel;                                                                 // 0x0000 (size: 0x4)
    ELootBoxType m_Type;                                                              // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FLootBoxRewardStruct
{
    TArray<FLootBoxTypeCountStruct> m_LootBoxes;                                      // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FLootBoxStaticData
{
    FName m_Name;                                                                     // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FLootBoxTypeCountStruct
{
    ELootBoxType m_Type;                                                              // 0x0000 (size: 0x1)
    int32 m_iCount;                                                                   // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FMainAttackComboDB
{
    TArray<FName> m_ComboQuadrantsFrontLeftXls;                                       // 0x0000 (size: 0x10)
    TArray<FName> m_ComboQuadrantsFrontRightXls;                                      // 0x0010 (size: 0x10)
    TArray<FName> m_ComboQuadrantsBackRightXls;                                       // 0x0020 (size: 0x10)
    TArray<FName> m_ComboQuadrantsBackLeftXls;                                        // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FMainAttackComboRealNamesDB
{
    TArray<FText> m_ComboQuadrantsFrontLeftXls;                                       // 0x0000 (size: 0x10)
    TArray<FText> m_ComboQuadrantsFrontRightXls;                                      // 0x0010 (size: 0x10)
    TArray<FText> m_ComboQuadrantsBackRightXls;                                       // 0x0020 (size: 0x10)
    TArray<FText> m_ComboQuadrantsBackLeftXls;                                        // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FMainCharWeaponOverrideInfo : public FBaseWeaponOverrideInfo
{
    class UCombo* m_MainCharCombo;                                                    // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FMappableInputStruct
{
    FName m_UnrealMappingName;                                                        // 0x0000 (size: 0x8)
    ERemappingAllowedInputTypes m_eRemappingAllowedInputType;                         // 0x0008 (size: 0x1)
    FText m_DisplayedMappingNameText;                                                 // 0x0010 (size: 0x30)
    bool m_bIsAxisMappingAllowed;                                                     // 0x0040 (size: 0x1)
    bool m_bCheckDuplicateKey;                                                        // 0x0041 (size: 0x1)
    bool m_bForceDisplayAsSingleField;                                                // 0x0042 (size: 0x1)
    float m_fKeyToAxisMultScaleFactor;                                                // 0x0044 (size: 0x4)

}; // Size: 0x48

struct FMappingID
{
    FInputPresetsEnumHandler m_PresetID;                                              // 0x0000 (size: 0x50)
    InputAction m_eAction;                                                            // 0x0050 (size: 0x1)
    InputContext m_eContext;                                                          // 0x0051 (size: 0x1)
    bool m_bUsePreset;                                                                // 0x0052 (size: 0x1)

}; // Size: 0x58

struct FMappingProfileInfos
{
    EKeyboardLayout m_eKeyboardLayout;                                                // 0x0000 (size: 0x1)
    TSoftObjectPtr<UInputMappingProfileDB> m_Profile;                                 // 0x0008 (size: 0x28)

}; // Size: 0x30

struct FMappingProfileList
{
    TArray<FMappingProfileInfos> m_MappingProfiles;                                   // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FMappingValidationError
{
    EMappingValidationErrorType m_eResult;                                            // 0x0000 (size: 0x1)
    FMappingID m_ID;                                                                  // 0x0008 (size: 0x58)
    FMappingID m_CollideID;                                                           // 0x0060 (size: 0x58)
    class UGenericInputData* m_CollideWithData;                                       // 0x00B8 (size: 0x8)

}; // Size: 0xC0

struct FMatchmakingZoneStatus
{
    uint8 m_uiZoneID;                                                                 // 0x0000 (size: 0x1)
    uint8 m_uiSubZoneID;                                                              // 0x0001 (size: 0x1)
    uint8 m_uiOpenedGates;                                                            // 0x0002 (size: 0x1)
    uint8 m_uiOpenedGhostGates;                                                       // 0x0003 (size: 0x1)

}; // Size: 0x4

struct FMenuOptionData
{
    float m_fMin;                                                                     // 0x0000 (size: 0x4)
    float m_fMax;                                                                     // 0x0004 (size: 0x4)
    float m_fDefaultValue;                                                            // 0x0008 (size: 0x4)
    bool m_bApplyOnSet;                                                               // 0x000C (size: 0x1)

}; // Size: 0x14

struct FMenuReferenceWithRequiredTags
{
    TSoftClassPtr<UMenuWidget> m_Menu;                                                // 0x0000 (size: 0x28)
    FGameplayTagContainer m_RequiredGameFlowTags;                                     // 0x0028 (size: 0x20)
    bool m_bLoadSyncAtInit;                                                           // 0x0048 (size: 0x1)

}; // Size: 0x50

struct FMenuStackInfos
{
    EMenuEnum m_eMenu;                                                                // 0x0000 (size: 0x1)
    TWeakObjectPtr<class UPanelWidget> m_Container;                                   // 0x0004 (size: 0x8)
    TWeakObjectPtr<class UWidget> m_FocusedButton;                                    // 0x000C (size: 0x8)

}; // Size: 0x14

struct FMoveStatus
{
    bool m_bExploration;                                                              // 0x0000 (size: 0x1)
    bool m_bCombat;                                                                   // 0x0001 (size: 0x1)
    bool m_bNone;                                                                     // 0x0002 (size: 0x1)
    EMoveStatus m_eMoveStatus;                                                        // 0x0003 (size: 0x1)

}; // Size: 0x4

struct FMovementMode
{
    bool m_bNone;                                                                     // 0x0000 (size: 0x1)
    bool m_bWalking;                                                                  // 0x0001 (size: 0x1)
    bool m_bNavWalking;                                                               // 0x0002 (size: 0x1)
    bool m_bFalling;                                                                  // 0x0003 (size: 0x1)
    bool m_bSwimming;                                                                 // 0x0004 (size: 0x1)
    bool m_bFlying;                                                                   // 0x0005 (size: 0x1)
    bool m_bCustom;                                                                   // 0x0006 (size: 0x1)
    uint8 m_replicatedMvtMode;                                                        // 0x0007 (size: 0x1)

}; // Size: 0xC

struct FMovieSceneRetargetingOverrideTemplate : public FMovieSceneEvalTemplate
{
    class UMovieSceneRetargetingOverrideSection* Section;                             // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FMovieSceneSubtitlesTemplate : public FMovieSceneAkAudioEventTemplate
{
    class UMovieSceneSubtitlesSection* SubtitleSection;                               // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FNameArray
{
    TArray<FName> m_Array;                                                            // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FNavAreaPerRange
{
    FFloatRange m_Range;                                                              // 0x0000 (size: 0x10)
    TSubclassOf<class UNavArea> m_associatedArea;                                     // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FNavMeshFreeRange
{
    ESCCardinalPoints m_eOrientation;                                                 // 0x0000 (size: 0x1)
    float m_fRange;                                                                   // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FNavMeshFreeSquare
{
    FVector m_OffsetToInstigator;                                                     // 0x0000 (size: 0xC)
    float m_fSquareSize;                                                              // 0x000C (size: 0x4)
    float m_fRaycastHeight;                                                           // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FNetOrderDropObject : public FNetOrderStructPlayAnimVariableWeight
{
    EDropReason m_eDropReason;                                                        // 0x00A0 (size: 0x1)

}; // Size: 0xA8

struct FNetOrderStruct
{
    TWeakObjectPtr<class AActor> m_TargetActor;                                       // 0x0008 (size: 0x8)
    TWeakObjectPtr<class UAbilityPayload> m_Payload;                                  // 0x0010 (size: 0x8)

}; // Size: 0x20

struct FNetOrderStructAttack : public FNetOrderStruct
{
    FAttackRequest m_AttackRequest;                                                   // 0x0020 (size: 0x48)
    FAttackDataRow m_AttackData;                                                      // 0x0068 (size: 0x78)
    bool m_bIsMirrorAnimToUse;                                                        // 0x00E1 (size: 0x1)

}; // Size: 0xF8

struct FNetOrderStructAttackEnv : public FNetOrderStructSnapAnim
{
    FTransform m_Snap;                                                                // 0x0170 (size: 0x30)
    TWeakObjectPtr<class UBaseEnvironmentalInteractionComponent> m_EnvironementalTakedownComponent; // 0x01A0 (size: 0x8)
    EOrderType m_eTargetOrder;                                                        // 0x01A8 (size: 0x1)
    FHitResult m_Impact;                                                              // 0x01AC (size: 0x8C)
    FHitBox m_Hit;                                                                    // 0x0238 (size: 0x298)
    FHitBox m_EnvHit;                                                                 // 0x04D0 (size: 0x298)

}; // Size: 0x770

struct FNetOrderStructAvoid : public FNetOrderStructPlayAnim
{
    uint8 m_uiAvoidType;                                                              // 0x0160 (size: 0x1)

}; // Size: 0x168

struct FNetOrderStructAvoided : public FNetOrderStruct
{
    FOrderOverAttackInfo m_AvoidInfo;                                                 // 0x0020 (size: 0x440)

}; // Size: 0x470

struct FNetOrderStructCancel : public FNetOrderStruct
{
}; // Size: 0x38

struct FNetOrderStructChargeBuildUp : public FNetOrderStructPlayAnim
{
    uint8 m_uiCapLevel;                                                               // 0x0160 (size: 0x1)
    EQuadrantTypes m_eAttackQuadrant;                                                 // 0x0161 (size: 0x1)

}; // Size: 0x168

struct FNetOrderStructDash : public FNetOrderStructPlayAnim
{
    FVector m_vDirection;                                                             // 0x0160 (size: 0xC)

}; // Size: 0x178

struct FNetOrderStructDefenseSuccess : public FNetOrderStructPlayAnim
{
    FHitResult m_Hit;                                                                 // 0x0160 (size: 0x8C)
    FImpactResult m_Impact;                                                           // 0x01F0 (size: 0xC0)
    FHitRequest m_Request;                                                            // 0x02B0 (size: 0x418)
    bool m_OpponentGoingStructureBroken;                                              // 0x06C8 (size: 0x1)
    bool m_bReorientToAttacker;                                                       // 0x06C9 (size: 0x1)

}; // Size: 0x6D0

struct FNetOrderStructDeflected : public FNetOrderStruct
{
}; // Size: 0x30

struct FNetOrderStructDodge : public FNetOrderStruct
{
    EDodgeType m_eDodgeType;                                                          // 0x0020 (size: 0x1)
    FVector m_vDirection;                                                             // 0x0024 (size: 0xC)
    FVector m_vOrientation;                                                           // 0x0030 (size: 0xC)
    TWeakObjectPtr<class AActor> m_Target;                                            // 0x0044 (size: 0x8)
    FVector2D m_vDirOnStick;                                                          // 0x0058 (size: 0x8)
    InputAction m_eInputAction;                                                       // 0x0060 (size: 0x1)

}; // Size: 0x68

struct FNetOrderStructFallFromPush : public FNetOrderStructPlayAnim
{
    FVector m_vDirection;                                                             // 0x0160 (size: 0xC)
    bool m_bLethal;                                                                   // 0x016C (size: 0x1)
    bool m_bFromSlope;                                                                // 0x016D (size: 0x1)
    FVector m_vSlopeNormal;                                                           // 0x0170 (size: 0xC)

}; // Size: 0x180

struct FNetOrderStructFallOnSlope : public FNetOrderStruct
{
    FFallOnSlopeSetup m_Setup;                                                        // 0x0020 (size: 0x468)

}; // Size: 0x490

struct FNetOrderStructFallOnSlopeEntry : public FNetOrderStructPlayAnim
{
    FFallOnSlopeSetup m_Setup;                                                        // 0x0168 (size: 0x468)
    FVector m_vSlopeDir;                                                              // 0x05D0 (size: 0xC)
    FHitRequest m_HitRequest;                                                         // 0x05E0 (size: 0x418)

}; // Size: 0x9F8

struct FNetOrderStructFidget : public FNetOrderStructPlayAnimVariableWeight
{
    FBlendProfileBySpeedStateStruct m_BlendProfiles;                                  // 0x00A0 (size: 0x20)
    EFidgetMirroringTypes m_eMirrorHandling;                                          // 0x00C0 (size: 0x1)

}; // Size: 0xC8

struct FNetOrderStructFightingState : public FNetOrderStructPlayAnim
{
    TWeakObjectPtr<class AActor> m_Instigator;                                        // 0x0160 (size: 0x8)
    FHitRequest m_Hit;                                                                // 0x0168 (size: 0x418)

}; // Size: 0x588

struct FNetOrderStructFightingStateRecovery : public FNetOrderStructPlayAnim
{
    EFightingState m_eFightingState;                                                  // 0x0161 (size: 0x1)

}; // Size: 0x168

struct FNetOrderStructFreezeFrame : public FNetOrderStruct
{
}; // Size: 0x30

struct FNetOrderStructGrab : public FNetOrderStructSnapAnim
{
    bool m_bFromParry;                                                                // 0x0170 (size: 0x1)
    FHitResult m_Hit;                                                                 // 0x0174 (size: 0x8C)
    FImpactResult m_Impact;                                                           // 0x0200 (size: 0xC0)
    FHitRequest m_HitRequest;                                                         // 0x02C0 (size: 0x418)
    FDefenseAnimInfos m_GrabAnimInfos;                                                // 0x06D8 (size: 0x1A8)

}; // Size: 0x880

struct FNetOrderStructGuard : public FNetOrderStruct
{
}; // Size: 0x28

struct FNetOrderStructHitted : public FNetOrderStructPlayAnim
{
    FHitRequest m_Request;                                                            // 0x0168 (size: 0x418)
    FImpactResult m_ImpactResult;                                                     // 0x0580 (size: 0xC0)
    FHitResult m_HitResult;                                                           // 0x0640 (size: 0x8C)
    FHittedAnimContainer m_HittedAnimContainer;                                       // 0x06E0 (size: 0x68)

}; // Size: 0x748

struct FNetOrderStructParried : public FNetOrderStructAttackEnv
{
    FHitDescription m_AttackHitDescription;                                           // 0x0768 (size: 0x568)

}; // Size: 0xCD0

struct FNetOrderStructPlayAnim : public FNetOrderStruct
{
    FAnimContainer m_AnimContainerToPlay;                                             // 0x0020 (size: 0x18)
    FWeaponAnimInfo m_weaponAnimInfoAssociated;                                       // 0x0038 (size: 0x90)
    bool m_bUseRootMotion;                                                            // 0x00C8 (size: 0x1)
    bool m_bOverrideDynamic;                                                          // 0x00C9 (size: 0x1)
    class UCurveFloat* m_OverrideDynamicCurve;                                        // 0x00D0 (size: 0x8)
    bool m_bBlendPreviousSpeed;                                                       // 0x00D8 (size: 0x1)
    float m_fBlendPreviousSpeedDuration;                                              // 0x00DC (size: 0x4)
    bool m_bOverrideDuration;                                                         // 0x00E0 (size: 0x1)
    float m_fOverrideDuration;                                                        // 0x00E4 (size: 0x4)
    bool m_bInterruptAfterDelay;                                                      // 0x00E8 (size: 0x1)
    float m_fInterruptDelay;                                                          // 0x00EC (size: 0x4)
    bool m_bOverrideDistance;                                                         // 0x00F0 (size: 0x1)
    float m_fOverrideDistance;                                                        // 0x00F4 (size: 0x4)
    bool m_bIsOverrideDistanceAbsolute;                                               // 0x00F8 (size: 0x1)
    bool m_bOverrideDirection;                                                        // 0x00F9 (size: 0x1)
    FVector m_vOverrideDirection;                                                     // 0x00FC (size: 0xC)
    bool m_bOverrideOrientation;                                                      // 0x0108 (size: 0x1)
    FVector m_vOverrideOrientation;                                                   // 0x010C (size: 0xC)
    bool m_bOverridePlayRate;                                                         // 0x0148 (size: 0x1)
    float m_fOverridePlayRate;                                                        // 0x014C (size: 0x4)
    float m_fFrozenPlayRate;                                                          // 0x0150 (size: 0x4)
    bool m_bIsInfinite;                                                               // 0x0154 (size: 0x1)
    bool m_bIsMovingOrder;                                                            // 0x0155 (size: 0x1)
    bool m_bUseStartRatioOnNewLoop;                                                   // 0x0156 (size: 0x1)
    bool m_bAllowMirroringOnWeapon;                                                   // 0x0157 (size: 0x1)
    EQuadrantTypes m_eForcedQuadrant;                                                 // 0x0158 (size: 0x1)

}; // Size: 0x160

struct FNetOrderStructPlayAnimVariableWeight : public FNetOrderStruct
{
    FAnimContainer m_AnimContainerToPlay;                                             // 0x0020 (size: 0x18)
    FSCUserDefinedEnumHandler m_VariableWeightLayer;                                  // 0x0038 (size: 0x50)
    ELookAtApplyMode m_eLookAtApplyMode;                                              // 0x0088 (size: 0x1)

}; // Size: 0xA0

struct FNetOrderStructPlayBlendSpace : public FNetOrderStruct
{
    class UBlendSpaceBase* m_BlendSpace;                                              // 0x0020 (size: 0x8)
    FVector m_vDefaultCoordinates;                                                    // 0x0028 (size: 0xC)
    float m_fDuration;                                                                // 0x0034 (size: 0x4)
    float m_fPlayRate;                                                                // 0x0038 (size: 0x4)
    bool m_bIsInfinite;                                                               // 0x003C (size: 0x1)

}; // Size: 0x40

struct FNetOrderStructPushFromGrab : public FNetOrderStructSnapAnim
{
    TWeakObjectPtr<class AActor> m_ThrowTarget;                                       // 0x0170 (size: 0x8)
    FVector m_ThrowTargetDir;                                                         // 0x0178 (size: 0xC)

}; // Size: 0x188

struct FNetOrderStructRagingBull : public FNetOrderStructPlayAnim
{
    ERagingBullPhase m_ePhase;                                                        // 0x0160 (size: 0x1)
    FHitBox m_HitBox;                                                                 // 0x0168 (size: 0x298)
    float m_fMaxAngularSpeed;                                                         // 0x0400 (size: 0x4)
    FAnimContainer m_wallSplashFrontAnim;                                             // 0x0408 (size: 0x18)
    bool m_bHasMissedTarget;                                                          // 0x0420 (size: 0x1)

}; // Size: 0x428

struct FNetOrderStructSnapAnim : public FNetOrderStructPlayAnim
{
    bool m_bIsSnapper;                                                                // 0x0160 (size: 0x1)
    bool m_bSnapOnTarget;                                                             // 0x0161 (size: 0x1)
    int32 m_iSyncID;                                                                  // 0x0164 (size: 0x4)
    bool m_bIsInstigator;                                                             // 0x0168 (size: 0x1)

}; // Size: 0x170

struct FNetOrderStructSpawn : public FNetOrderStruct
{
}; // Size: 0x28

struct FNetOrderStructSynchronizedAttackVictim : public FNetOrderStructSnapAnim
{
    TArray<FOverridingHitBox> m_Hits;                                                 // 0x0170 (size: 0x10)
    bool m_bCanCounterGrab;                                                           // 0x0180 (size: 0x1)

}; // Size: 0x188

struct FNetOrderStructTakedown : public FNetOrderStructAttackEnv
{
    bool m_bFromParry;                                                                // 0x0768 (size: 0x1)
    bool m_bEnvironementalTakedown;                                                   // 0x0769 (size: 0x1)
    FHitResult m_ParryHit;                                                            // 0x076C (size: 0x8C)
    FImpactResult m_ParryImpact;                                                      // 0x07F8 (size: 0xC0)
    FHitRequest m_ParryHitRequest;                                                    // 0x08B8 (size: 0x418)
    FHitResult m_ImpactOnEnv;                                                         // 0x0CD0 (size: 0x8C)

}; // Size: 0xD60

struct FNetOrderStructTraversal : public FNetOrderStruct
{
    FTraversalInfo m_TraversalInfo;                                                   // 0x0020 (size: 0xC8)
    FHitBox m_FallHit;                                                                // 0x00E8 (size: 0x298)

}; // Size: 0x428

struct FNetOrderStructTraversalCine : public FNetOrderStructPlayAnim
{
    FTraversalInfo m_TraversalInfo;                                                   // 0x0160 (size: 0xC8)

}; // Size: 0x228

struct FNetOrderStructUseMovable : public FNetOrderStructAttack
{
}; // Size: 0x110

struct FNetOrderStructWallJumpAttack : public FNetOrderStructPlayAnim
{
    EWallJumpAttackPhase m_eCurrentWallJumpPhase;                                     // 0x0160 (size: 0x1)

}; // Size: 0x1C0

struct FNetStructMoveToWithPhysWalking : public FNetOrderStruct
{
    class UNavLinkCustomComponent* m_NavLinkComponent;                                // 0x0030 (size: 0x8)

}; // Size: 0x38

struct FNetStructOpeningDoor : public FNetOrderStructPlayAnimVariableWeight
{
    class UAnimationAsset* m_OpeningDoorAnimAsset;                                    // 0x00A0 (size: 0x8)
    class UAnimationAsset* m_ClosingDoorAnimAsset;                                    // 0x00A8 (size: 0x8)
    bool m_bInteraction1;                                                             // 0x00B0 (size: 0x1)
    FAnimContainer m_AnimContainerToPlayWhenCarryingWeapon;                           // 0x00B8 (size: 0x18)
    FSCUserDefinedEnumHandler m_VariableWeightLayerWhenCarryingWeapon;                // 0x00D0 (size: 0x50)

}; // Size: 0x120

struct FNetStructPickUpObject : public FNetOrderStructPlayAnimVariableWeight
{
    TWeakObjectPtr<class AActor> m_PickUpObject;                                      // 0x00A0 (size: 0x8)

}; // Size: 0xA8

struct FOnHitDelayed
{
    FHitDescription m_Hit;                                                            // 0x0008 (size: 0x568)

}; // Size: 0x570

struct FOrderInfosInstance
{
    TArray<FOrderServiceInfos> m_Services;                                            // 0x0000 (size: 0x10)
    class UOrderDB* m_DB;                                                             // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FOrderInfosInstanceMap
{
    TMap<class EOrderType, class FOrderInfosInstance> m_OrderServiceInstances;        // 0x0000 (size: 0x50)
    TMap<class FName, class FOrderInfosInstance> m_BPOrderServiceInstances;           // 0x0050 (size: 0x50)

}; // Size: 0xA0

struct FOrderOverAttackInfo
{
    TWeakObjectPtr<class AActor> m_Instigator;                                        // 0x0000 (size: 0x8)
    FHitDefenseResult m_DefenseResult;                                                // 0x0008 (size: 0x10)
    FHitRequest m_HitRequest;                                                         // 0x0018 (size: 0x418)
    EOrderType m_eOrderType;                                                          // 0x0430 (size: 0x1)
    uint8 m_uiOrderID;                                                                // 0x0431 (size: 0x1)

}; // Size: 0x440

struct FOrderServiceClassInstance
{
    TSubclassOf<class UOrderService> m_DefaultClassObject;                            // 0x0000 (size: 0x8)
    class UOrderService* m_Instance;                                                  // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FOrderServiceFrameRange
{
    bool m_bBoundToAnim;                                                              // 0x0000 (size: 0x1)
    class UOrderServiceFrameRangeRequest* m_FrameRangeRequest;                        // 0x0008 (size: 0x8)
    FFloatRange m_FrameRange;                                                         // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FOrderServiceInfos
{
    bool m_bDisabled;                                                                 // 0x0000 (size: 0x1)
    EOrderServiceFreezeFrameHandling m_eFreezeFrameHandling;                          // 0x0001 (size: 0x1)
    bool m_bActivateFromFrameRange;                                                   // 0x0008 (size: 0x1)
    bool m_bActivateWhenMissingFromAnim;                                              // 0x0009 (size: 0x1)
    TSubclassOf<class UOrderServiceActivationConditions> m_activationCondition;       // 0x0010 (size: 0x8)
    bool m_bInvertCondition;                                                          // 0x0018 (size: 0x1)
    FOrderServiceFrameRange m_FrameRangeInfos;                                        // 0x0020 (size: 0x20)
    FOrderServiceClassInstance m_OrderServiceInstance;                                // 0x0040 (size: 0x10)

}; // Size: 0x60

struct FOrderServiceInfosList
{
    TArray<class TSubclassOf<UOrderPresetDB>> m_Presets;                              // 0x0000 (size: 0x10)
    TArray<FOrderServiceInfos> m_Services;                                            // 0x0010 (size: 0x10)
    TArray<FOrderServiceInserted> m_InsertedServices;                                 // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FOrderServiceInserted
{
    int32 m_iInsertionIndex;                                                          // 0x0000 (size: 0x4)
    FOrderServiceInfos m_OrderService;                                                // 0x0008 (size: 0x60)

}; // Size: 0x68

struct FOrderTransformData
{
    float m_fPosX;                                                                    // 0x0000 (size: 0x4)
    float m_fPosY;                                                                    // 0x0004 (size: 0x4)
    float m_fOrientation;                                                             // 0x0008 (size: 0x4)
    float m_fOrderRatio;                                                              // 0x000C (size: 0x4)

}; // Size: 0x10

struct FOrderType
{
    EOrderType m_eOrderType;                                                          // 0x0000 (size: 0x1)
    FName m_BPOrderID;                                                                // 0x0004 (size: 0x8)

}; // Size: 0xC

struct FOrientedRotationAnimContainer
{
    FRotationAnimContainer m_leftAnims;                                               // 0x0000 (size: 0x48)
    FRotationAnimContainer m_rightAnims;                                              // 0x0048 (size: 0x48)

}; // Size: 0x90

struct FOutfitData
{
    TSoftObjectPtr<USkeletalMesh> m_Mesh;                                             // 0x0000 (size: 0x28)
    TMap<int32, TSoftObjectPtr<UMaterialInstance>> m_OverrideMaterial;                // 0x0028 (size: 0x50)
    FDataTableRowHandle m_props;                                                      // 0x0078 (size: 0x10)

}; // Size: 0x88

struct FOverridenVariableWeightInfo
{
    FName m_Name;                                                                     // 0x0000 (size: 0x8)
    float m_fOverridenAlpha;                                                          // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FOverridingHitBox
{
    FHitBox m_HitBox;                                                                 // 0x0000 (size: 0x298)
    class UAttackPropertiesResistanceDB* m_ResistanceDB;                              // 0x0298 (size: 0x8)
    FAnimContainer m_FightingStateLoopAnimToPlay;                                     // 0x02A0 (size: 0x18)
    FAnimContainer m_FightingStateRecoveryAnimToPlay;                                 // 0x02B8 (size: 0x18)
    FHittedAnimContainer m_LethalHittedAnimToPlay;                                    // 0x02D0 (size: 0x68)
    bool m_bIsLethalHittedAnimPlayerOnly;                                             // 0x0338 (size: 0x1)

}; // Size: 0x340

struct FParriedProfile
{
    float m_fParriedDuration;                                                         // 0x0000 (size: 0x4)
    ESCBlendType m_eParriedReorientationBlendType;                                    // 0x0004 (size: 0x1)
    class UCurveFloat* m_ParriedReorientationCurve;                                   // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FParryAnimationCharacterQuadrantArray
{
    FParryAnimationParryQuadrantArray m_Array;                                        // 0x0000 (size: 0x180)

}; // Size: 0x180

struct FParryAnimationParryQuadrantArray
{
    FAnimContainer m_Array;                                                           // 0x0000 (size: 0x60)

}; // Size: 0x60

struct FParryRequestInfos
{
    EQuadrantTypes m_eQuadrant;                                                       // 0x0000 (size: 0x1)
    ESCCardinalPoints m_eCardinal;                                                    // 0x0001 (size: 0x1)
    bool m_bFromDown;                                                                 // 0x0002 (size: 0x1)
    bool m_bHasAWeapon;                                                               // 0x0003 (size: 0x1)
    bool m_bIsWeaponOnOppositeHand;                                                   // 0x0004 (size: 0x1)

}; // Size: 0x5

struct FParryType
{
    EParryDirection m_eParryDirection;                                                // 0x0000 (size: 0x1)
    EParrySide m_eParrySide;                                                          // 0x0001 (size: 0x1)
    EParryHeight m_eParryHeight;                                                      // 0x0002 (size: 0x1)

}; // Size: 0x3

struct FPatrolActivity
{
    FAnimContainer m_animContainer;                                                   // 0x0000 (size: 0x18)
    float m_fActivityDuration;                                                        // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FPatrolControlPoint
{
    FVector m_vLocalPosition;                                                         // 0x0000 (size: 0xC)
    bool m_bOverrideActivityAnimation;                                                // 0x000C (size: 0x1)
    FName m_ActivityName;                                                             // 0x0010 (size: 0x8)
    FAnimContainer m_ActivityAnimContainer;                                           // 0x0018 (size: 0x18)
    bool m_bOverrideActivityDuration;                                                 // 0x0030 (size: 0x1)
    float m_fOverridenActivityDuration;                                               // 0x0034 (size: 0x4)
    ESpeedState m_eSpeedStateToUse;                                                   // 0x0038 (size: 0x1)

}; // Size: 0x40

struct FPelvisDirectionComputationParams
{
    bool m_bUseFeetLocation;                                                          // 0x0012 (size: 0x1)
    bool m_bInverseAxis;                                                              // 0x0013 (size: 0x1)
    FName m_boneName;                                                                 // 0x0014 (size: 0x8)
    TEnumAsByte<EAxis::Type> m_eAxis;                                                 // 0x001C (size: 0x1)

}; // Size: 0x38

struct FPendingAttackXP
{
}; // Size: 0x1

struct FPendingOrderStruct
{
    EOrderType OrderType;                                                             // 0x0000 (size: 0x1)
    class UOrderComponent* OrderComponent;                                            // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FPhaseNodeHandler
{
    FGuid m_Guid;                                                                     // 0x0000 (size: 0x10)
    FName m_Name;                                                                     // 0x0010 (size: 0x8)
    FAIPhaseNodeHardLink m_Link;                                                      // 0x0018 (size: 0x20)
    TSubclassOf<class UArchetypeAsset> m_PhaseArchetype;                              // 0x0038 (size: 0x8)
    TSubclassOf<class UArchetypeAsset> m_WeakerPhaseArchetype;                        // 0x0040 (size: 0x8)
    TSubclassOf<class UArchetypeAsset> m_StrongerPhaseArchetype;                      // 0x0048 (size: 0x8)
    class USkeletalMesh* m_OverrideSkeletalMesh;                                      // 0x0050 (size: 0x8)
    EAIPhaseNodeType m_eType;                                                         // 0x0058 (size: 0x4)
    FAICustomBehaviorTreeList m_CustomBehaviorTrees;                                  // 0x0060 (size: 0x10)
    FName m_DialogToLaunch;                                                           // 0x0070 (size: 0x8)
    TArray<FPhaseTransitionNodeHandler> m_PhaseTransitions;                           // 0x0078 (size: 0x10)

}; // Size: 0x88

struct FPhaseTransitionNodeHandler
{
    class UAIPhaseTransition* m_TransitionObject;                                     // 0x0000 (size: 0x8)
    bool m_bNeedsLastManGaugeFull;                                                    // 0x0008 (size: 0x1)
    FAnimContainer m_PhaseTransitionAnimContainer;                                    // 0x0010 (size: 0x18)
    TSubclassOf<class USynchronizedAttackHitActionLauncher> m_SyncHitActionLauncher;  // 0x0028 (size: 0x8)
    class ULevelSequence* m_LevelSequence;                                            // 0x0030 (size: 0x8)
    EAIPhaseLevelSequenceTransform m_LevelSequenceTransform;                          // 0x0038 (size: 0x4)
    FAISituationNamedActor m_LevelSequenceTransformActor;                             // 0x003C (size: 0x8)
    int32 m_iChildNodeIndex;                                                          // 0x0044 (size: 0x4)
    bool m_bResetHealth;                                                              // 0x0048 (size: 0x1)
    bool m_bResetStructure;                                                           // 0x0049 (size: 0x1)
    bool m_bResetSuperDizzy;                                                          // 0x004A (size: 0x1)
    bool m_bResetCurrentAIActions;                                                    // 0x004B (size: 0x1)

}; // Size: 0x50

struct FPhasesTransitionObjectCache
{
    TArray<FPhasesTransitionObjectCacheEntry> m_Cache;                                // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPhasesTransitionObjectCacheEntry
{
    class UAIPhaseTransition* m_Object;                                               // 0x0000 (size: 0x8)

}; // Size: 0x18

struct FPictoData
{
    FLinearColor m_color;                                                             // 0x0000 (size: 0x10)
    float m_fGlow;                                                                    // 0x0010 (size: 0x4)
    float m_fIntensity;                                                               // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FPlayOrderInfos
{
    uint8 m_uiAfterOrder;                                                             // 0x0000 (size: 0x1)
    float m_fDelay;                                                                   // 0x0004 (size: 0x4)

}; // Size: 0x40

struct FPlayerGenderSpecificData
{
    TArray<FOutfitData> m_Outfits;                                                    // 0x0000 (size: 0x10)
    TSoftObjectPtr<UBaseMovementDB> m_BaseMovementDB;                                 // 0x0010 (size: 0x28)
    TSoftClassPtr<USCCharacterPoseData> m_PoseData;                                   // 0x0038 (size: 0x28)

}; // Size: 0x60

struct FPlayerKill
{
    class AFightingPlayerState* m_PlayerState;                                        // 0x0000 (size: 0x8)
    uint32 m_uiNbKills;                                                               // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FPlayerStatesStatus
{
    bool m_bWasActive;                                                                // 0x0000 (size: 0x1)
    bool m_bIsActive;                                                                 // 0x0001 (size: 0x1)
    float m_fActiveSince;                                                             // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FPowerShopDataRow : public FTableRowBase
{
    class UBaseItemData* m_Power;                                                     // 0x0008 (size: 0x8)
    int32 m_iGMLevelRequired;                                                         // 0x0010 (size: 0x4)
    int32 m_iGleamLevelRequired;                                                      // 0x0014 (size: 0x4)
    int32 m_iFragmentPrice;                                                           // 0x0018 (size: 0x4)
    int32 m_iPrestigePointPrice;                                                      // 0x001C (size: 0x4)

}; // Size: 0x20

struct FProfileData
{
    TArray<FFilterProperties> m_FilterPresets;                                        // 0x0000 (size: 0x10)
    float m_GameOptions;                                                              // 0x0010 (size: 0xA4)
    TMap<class FString, class FSaveAdditionalInfos> m_SaveAdditionalInfoMap;          // 0x00B8 (size: 0x50)
    FInputMappingProfileEnumHandler m_GamepadProfile;                                 // 0x0108 (size: 0x50)
    FInputMappingProfileEnumHandler m_KeyboardProfile;                                // 0x0158 (size: 0x50)
    FInputMappingProfileData m_GamepadCustomMapping;                                  // 0x01A8 (size: 0xA8)
    FInputMappingProfileData m_KeyboardCustomMapping;                                 // 0x0250 (size: 0xA8)
    bool m_bInputHoldToggleActivated;                                                 // 0x02F8 (size: 0x1)
    FGameplayTagContainer m_UnlockedCheats;                                           // 0x0300 (size: 0x20)
    TMap<TSubclassOf<USkillGameplayEffect>, int32> m_SkillConsolidationLevel;         // 0x0320 (size: 0x50)
    int32 m_iCheatUnlockPoints;                                                       // 0x0370 (size: 0x4)
    TMap<class FName, class FArenaChallengeSave> m_aArenaSavePerChallenge;            // 0x0378 (size: 0x50)
    ECharacterGender m_eChallengeGender;                                              // 0x03C8 (size: 0x1)

}; // Size: 0x3D0

struct FProgressionDoorStruct
{
    class UProgressionDoorData* m_ProgressionDoorData;                                // 0x0000 (size: 0x8)
    TArray<class UQuestItemData*> m_Conditions;                                       // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FProgressionRewardArray
{
    TArray<ECharacterProgressionRewardTypes> m_WeaponRewards;                         // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPropertyFloorBoneRepartition
{
    FBoneReference m_Bone;                                                            // 0x0000 (size: 0x10)
    FFloatRange m_DegreeFloorAngleRange;                                              // 0x0010 (size: 0x10)
    float m_fRepartitionAlpha;                                                        // 0x0020 (size: 0x4)
    float m_fResultAlpha;                                                             // 0x0024 (size: 0x4)
    FTransform m_BoneResultTransform;                                                 // 0x0030 (size: 0x30)

}; // Size: 0x70

struct FPropertyReaction : public FBaseFightingStateBehavior
{
    FPropertyReactionMovement m_Movement;                                             // 0x0010 (size: 0x10)
    FAnimContainer m_RecoveryAnims;                                                   // 0x0020 (size: 0x60)
    bool m_bUseRootMotion;                                                            // 0x0080 (size: 0x1)
    FPropertyReactionHit m_HitReaction;                                               // 0x0088 (size: 0x18)
    bool m_bAlwayKeepCurrentStateDurationOnHit;                                       // 0x00A0 (size: 0x1)
    bool m_bPauseGuardBreak;                                                          // 0x00A1 (size: 0x1)
    bool m_bHoldDuringStructureBroken;                                                // 0x00A2 (size: 0x1)
    float m_fMaxAccumulatedDamage;                                                    // 0x00A4 (size: 0x4)
    int32 m_iMaxAccumatedHits;                                                        // 0x00A8 (size: 0x4)
    bool m_bGroupMaxAccumulatedHitsByAttack;                                          // 0x00AC (size: 0x1)
    FAIResistanceActions m_Actions;                                                   // 0x00B0 (size: 0x20)

}; // Size: 0xD0

struct FPropertyReactionHit
{
    float m_fHittedDuration;                                                          // 0x0000 (size: 0x4)
    class UCurveFloat* m_HittedDynamic;                                               // 0x0008 (size: 0x8)
    float m_fHittedKnockBackDistance;                                                 // 0x0010 (size: 0x4)
    float m_fHittedToStateBlendDuration;                                              // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FPropertyReactionMovement
{
    class UCurveFloat* m_StateMoveDynamic;                                            // 0x0000 (size: 0x8)
    float m_fStateDistance;                                                           // 0x0008 (size: 0x4)
    float m_fDuration;                                                                // 0x000C (size: 0x4)

}; // Size: 0x10

struct FPushAnims
{
    TMap<class ESCCardinalPoints, class FAnimContainer> m_GrabberAnims;               // 0x0000 (size: 0x50)
    TMap<class ESCCardinalPoints, class FAnimContainer> m_GrabbedAnims;               // 0x0050 (size: 0x50)
    bool m_bSouthMirrorPositiveAngle;                                                 // 0x00A0 (size: 0x1)
    bool m_bNorthMirrorPositiveAngle;                                                 // 0x00A1 (size: 0x1)

}; // Size: 0xA8

struct FPushPropertyReaction
{
    FHitBox m_WallSplashHit;                                                          // 0x0000 (size: 0x298)
    FHitBox m_WallSplashCloseHit;                                                     // 0x0298 (size: 0x298)
    FHitBox m_WallSplashHitOnWall;                                                    // 0x0530 (size: 0x298)
    FHitBox m_HitBox;                                                                 // 0x07C8 (size: 0x298)
    FPropertyReaction m_BasePushReaction;                                             // 0x0A60 (size: 0xD0)
    FPushedFromGrabbedReaction m_PushedFromGrabbedReaction;                           // 0x0B30 (size: 0x28)
    float m_EnvAttackRanges;                                                          // 0x0B58 (size: 0x10)
    float m_fAttackEnvCapsuleExtent;                                                  // 0x0B68 (size: 0x4)
    float m_fEnvAttackMaxAngleDeg;                                                    // 0x0B6C (size: 0x4)
    float m_fEnvAttackMaxAngleWitoutSnapDeg;                                          // 0x0B70 (size: 0x4)
    float m_fNavigationCostHeuristicScale;                                            // 0x0B74 (size: 0x4)
    float m_fNavigationMaxPathCost;                                                   // 0x0B78 (size: 0x4)
    FName m_EnvAttackImpactBoneName;                                                  // 0x0B7C (size: 0x8)

}; // Size: 0xB90

struct FPushTraversalAnimContainer : public FTraversalAnimContainer
{
    FAnimContainer m_InstigatorAnim;                                                  // 0x0080 (size: 0x18)

}; // Size: 0x98

struct FPushedFromGrabbedReaction
{
    FAnimContainer m_Loop;                                                            // 0x0000 (size: 0x18)
    FPropertyReactionMovement m_Movement;                                             // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FQuadrantAnimContainer
{
    FAnimContainer m_Anims;                                                           // 0x0000 (size: 0x60)

}; // Size: 0x60

struct FRagingBullAnimContainer
{
    class UAnimSequence* m_animation;                                                 // 0x0000 (size: 0x8)
    float m_fAnimSpeed;                                                               // 0x0008 (size: 0x4)
    bool m_bUseRootMotion;                                                            // 0x000C (size: 0x1)
    float m_fAnimPlayRate;                                                            // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FRarityData
{
    FText m_Name;                                                                     // 0x0000 (size: 0x18)
    FLinearColor m_color;                                                             // 0x0018 (size: 0x10)
    class UMaterial* m_Material;                                                      // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FRelationshipActionArray
{
    ELockActionCondition m_Array;                                                     // 0x0000 (size: 0xA)

}; // Size: 0xA

struct FRelationshipActionConditionArray
{
    FRelationshipActionArray m_Array;                                                 // 0x0000 (size: 0x3C)

}; // Size: 0x3C

struct FRemappingClasses
{
    TArray<TSoftObjectPtr<UGenericInputData>> m_Classes;                              // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FRemappingIncompatibilityGroup
{
    bool m_bDetectChildCollisions;                                                    // 0x0000 (size: 0x1)
    TArray<TSoftObjectPtr<UGenericInputData>> m_Classes;                              // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FRemappingSectionStruct
{
    FText m_SectionDisplayText;                                                       // 0x0000 (size: 0x18)
    TArray<FMappableInputStruct> m_RemappableActions;                                 // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FReplayAnimGraphCachedContext
{
}; // Size: 0x60

struct FReplayAnimGraphPlayerAssetVersioning
{
    int32 m_iAnimInstanceIndex;                                                       // 0x0000 (size: 0x4)
    int32 m_iStateMachineIndex;                                                       // 0x0004 (size: 0x4)
    int32 m_iStateMachineStateIndex;                                                  // 0x0008 (size: 0x4)
    int32 m_iPlayerAssetIndex;                                                        // 0x000C (size: 0x4)
    FString m_UniqueID;                                                               // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FReplayAnimGraphVersioning
{
    TArray<FName> m_StateMachineNames;                                                // 0x0000 (size: 0x10)
    TArray<FReplayAnimGraphPlayerAssetVersioning> m_AssetPlayers;                     // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FReplayAvailabilityLayerCache
{
    FAvailabilityLayerCaches m_TimeControl;                                           // 0x0000 (size: 0x18)
    FAvailabilityLayerCaches m_KeyEdition;                                            // 0x0018 (size: 0x18)
    FAvailabilityLayerCaches m_FreeFly;                                               // 0x0030 (size: 0x18)
    FAvailabilityLayerCaches m_KeySelected;                                           // 0x0048 (size: 0x18)
    FAvailabilityLayerCaches m_HoveringKey;                                           // 0x0060 (size: 0x18)
    FAvailabilityLayerCaches m_Scrubbing;                                             // 0x0078 (size: 0x18)
    FAvailabilityLayerCaches m_GoToTime;                                              // 0x0090 (size: 0x18)
    FAvailabilityLayerCaches m_MovingKey;                                             // 0x00A8 (size: 0x18)
    FAvailabilityLayerCaches m_MoveKey;                                               // 0x00C0 (size: 0x18)
    FAvailabilityLayerCaches m_ReplayPreview;                                         // 0x00D8 (size: 0x18)
    FAvailabilityLayerCaches m_ReplayEdit;                                            // 0x00F0 (size: 0x18)
    FAvailabilityLayerCaches m_KeyCopied;                                             // 0x0108 (size: 0x18)

}; // Size: 0x120

struct FReplayCachedAnimInstanceAssetPlayers
{
    int32 m_iAnimInstanceIndex;                                                       // 0x0000 (size: 0x4)

}; // Size: 0x18

struct FReplayCachedStateMachine
{
}; // Size: 0x28

struct FReplayCameraMeshFadingData
{
    bool m_bEnabledByDefault;                                                         // 0x0000 (size: 0x1)
    class UMaterialParameterCollection* m_Collection;                                 // 0x0008 (size: 0x8)
    FName m_ParameterName;                                                            // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FReplayCameraSettings
{
    FCameraLensSettings m_Lens;                                                       // 0x0000 (size: 0x18)
    FCameraFilmbackSettings m_Filmback;                                               // 0x0018 (size: 0xC)

}; // Size: 0x28

struct FReplayCameraTransform
{
    FVector m_vLocation;                                                              // 0x0000 (size: 0xC)
    FQuat m_qRotation;                                                                // 0x0010 (size: 0x10)
    FVector m_vSensorSettings;                                                        // 0x0020 (size: 0xC)
    bool m_bInterpolate;                                                              // 0x002C (size: 0x1)
    bool m_bCanEdit;                                                                  // 0x002D (size: 0x1)

}; // Size: 0x50

struct FReplayCurrentRecordingData
{
    int64 m_iRecordingArchiveSize;                                                    // 0x0000 (size: 0x8)
    int32 m_iRecordingDuration;                                                       // 0x0008 (size: 0x4)
    FReplaySizeManagement m_SizeManagementData;                                       // 0x0010 (size: 0x28)
    float m_fBytesPerSeconds;                                                         // 0x0038 (size: 0x4)
    float m_fTimeleftInSecondsAvg;                                                    // 0x003C (size: 0x4)

}; // Size: 0x40

struct FReplayCutInfo
{
    class UReplayKey* m_FirstKey;                                                     // 0x0000 (size: 0x8)
    class UReplayKey* m_SecondKey;                                                    // 0x0008 (size: 0x8)
    class UReplayKey* m_CurrentKey;                                                   // 0x0010 (size: 0x8)

}; // Size: 0x20

struct FReplayGameplayCameraRecordEvent : public FReplaySerializedEvent
{
    FReplayCameraTransform m_FirstFrameCameraTransform;                               // 0x0010 (size: 0x50)
    FReplayCameraTransform m_LastFrameCameraTransform;                                // 0x0060 (size: 0x50)

}; // Size: 0xB0

struct FReplayInfo
{
    FString m_ReplayName;                                                             // 0x0000 (size: 0x10)
    FString m_ReplayFriendlyNameLocalized;                                            // 0x0010 (size: 0x10)
    FString m_ReplayFriendlyName;                                                     // 0x0020 (size: 0x10)
    FDateTime m_Date;                                                                 // 0x0030 (size: 0x8)
    FReplayInfoUpdateTime m_LastReplayEditorUpdateTime;                               // 0x0038 (size: 0x10)
    int32 m_iChangeList;                                                              // 0x0048 (size: 0x4)
    int32 m_iReplayVersion;                                                           // 0x004C (size: 0x4)
    int32 m_iLength;                                                                  // 0x0050 (size: 0x4)
    int64 m_iSizeInBytes;                                                             // 0x0058 (size: 0x8)
    bool m_bIsCorrupted;                                                              // 0x0060 (size: 0x1)

}; // Size: 0x68

struct FReplayInfoUpdateTime
{
    FDateTime m_LastReplayEditorUpdateTime;                                           // 0x0000 (size: 0x8)
    bool m_bHasLastReplayEditorUpdateTime;                                            // 0x0008 (size: 0x1)

}; // Size: 0x10

struct FReplayInitialStateToggleEvent
{
    FReplayInitialStateToggleEvent_Event m_Event;                                     // 0x0000 (size: 0x10)
    void ReplayInitialStateToggleEventDelegate(bool _bToggle);
    FReplayInitialStateToggleEvent_GetValueDelegate m_GetValueDelegate;               // 0x0010 (size: 0x10)
    bool ReplayInitialStateToggleGetValueEventDelegate();
    class AActor* m_Actor;                                                            // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FReplayKeyCameraTransitionContextCameraTarget
{
}; // Size: 0xC

struct FReplayKeyCutData
{
    EReplayKeyCutType m_eCutType;                                                     // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FReplayKeyData
{
    int32 m_iKeyIndex;                                                                // 0x0000 (size: 0x4)
    int32 m_iKeyFrameIndex;                                                           // 0x0004 (size: 0x4)
    float m_fTime;                                                                    // 0x0008 (size: 0x4)
    float m_fDilatedTime;                                                             // 0x000C (size: 0x4)
    float m_fTimeDilation;                                                            // 0x0010 (size: 0x4)
    int32 m_eTypeFlags;                                                               // 0x0014 (size: 0x4)
    EReplayKeyTransition m_eTransition;                                               // 0x0018 (size: 0x1)
    EReplayKeyCameraMode m_eCameraMode;                                               // 0x0019 (size: 0x1)
    EReplayKeyCameraMeshFading m_eCameraMeshFading;                                   // 0x001A (size: 0x1)
    FVector m_vCameraLocation;                                                        // 0x001C (size: 0xC)
    FQuat m_qCameraRotation;                                                          // 0x0030 (size: 0x10)
    FReplayKeyDataCameraTransitionOverrideSettings m_CameraTransformSettings;         // 0x0040 (size: 0x40)
    FReplayKeyDataCameraSettings m_CameraSettings;                                    // 0x0080 (size: 0x28)
    FReplayKeyCutData m_CutData;                                                      // 0x00A8 (size: 0x1)
    FReplayKeyScreenFading m_ScreenFading;                                            // 0x00AC (size: 0x8)

}; // Size: 0xC0

struct FReplayKeyDataCameraSettings
{
    FReplayKeyDataFocusSettings m_FocusSettings;                                      // 0x0000 (size: 0x20)
    FReplayKeyDataLensSettings m_LensSettings;                                        // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FReplayKeyDataCameraTarget
{
    FReplayKeyDataWorldTarget m_Target;                                               // 0x0000 (size: 0x10)
    FVector m_vInitialTargetLocation;                                                 // 0x0010 (size: 0xC)

}; // Size: 0x20

struct FReplayKeyDataCameraTransitionOverrideSettings
{
    FReplayKeyDataCameraTarget m_FollowSettings;                                      // 0x0000 (size: 0x20)
    FReplayKeyDataCameraTarget m_LookAtSettings;                                      // 0x0020 (size: 0x20)

}; // Size: 0x40

struct FReplayKeyDataFocusSettings
{
    EReplayKeyCameraFocus m_eFocusMode;                                               // 0x0000 (size: 0x1)
    float m_fAperture;                                                                // 0x0004 (size: 0x4)
    float m_fFocusDistance;                                                           // 0x0008 (size: 0x4)
    FReplayKeyDataWorldTarget m_Target;                                               // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FReplayKeyDataLensSettings
{
    float m_fFocalLength;                                                             // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FReplayKeyDataWorldTarget
{
    FString m_ID;                                                                     // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FReplayKeyScreenFading
{
    EReplayKeyFadeType m_bFadingType;                                                 // 0x0000 (size: 0x1)
    float m_fFadingTime;                                                              // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FReplayKeyTransitionContext
{
}; // Size: 0x70

struct FReplayKeyWidgetVisualData
{
    class UTexture2D* m_Texture;                                                      // 0x0000 (size: 0x8)
    float m_fAngle;                                                                   // 0x0008 (size: 0x4)
    FVector2D m_vSize;                                                                // 0x000C (size: 0x8)

}; // Size: 0x18

struct FReplayKeyWidgetVisualKey
{
    EReplayKeyCameraMode m_eCameraMode;                                               // 0x0000 (size: 0x1)
    EReplayKeyCutType m_eCutType;                                                     // 0x0001 (size: 0x1)
    int32 m_iKeyTypeFlag;                                                             // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FReplayListInfo
{
    FReplaySizeManagement m_ReplaySizeManagement;                                     // 0x0000 (size: 0x28)
    TArray<FReplayInfo> m_ReplayInfos;                                                // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FReplayOverrideMPCParameter
{
    class UMaterialParameterCollection* m_MPC;                                        // 0x0000 (size: 0x8)
    FName m_ParameterName;                                                            // 0x0008 (size: 0x8)
    float m_fValue;                                                                   // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FReplayPlayerAssetAccumulatedTime
{
    float m_fAccumulatedTime;                                                         // 0x0000 (size: 0x4)
    int32 m_iCachedContainerIndex;                                                    // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FReplayReplicatedAnimInstanceAssetPlayers
{
    int32 m_iAnimInstanceIndex;                                                       // 0x0000 (size: 0x4)
    TArray<FReplayPlayerAssetAccumulatedTime> m_AssetPlayers;                         // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FReplayReplicatedStateMachine
{
    int32 m_iStateIndex;                                                              // 0x0000 (size: 0x4)
    int32 m_iAnimInstanceIndex;                                                       // 0x0004 (size: 0x4)
    int32 m_iStateMachineIndex;                                                       // 0x0008 (size: 0x4)
    TArray<FReplayPlayerAssetAccumulatedTime> m_ReplicatedPlayerAssets;               // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FReplaySerializedEvent
{
}; // Size: 0x8

struct FReplaySizeManagement
{
    int64 m_iTotalSpaceOccupied;                                                      // 0x0000 (size: 0x8)
    int64 m_iTotalSpaceAvailable;                                                     // 0x0008 (size: 0x8)
    int64 m_iTotalMaxSpace;                                                           // 0x0010 (size: 0x8)
    int64 m_iMaxReplaySize;                                                           // 0x0018 (size: 0x8)
    int32 m_iCurrentReplaySlotCount;                                                  // 0x0020 (size: 0x4)
    int32 m_iMaxReplaySlotCount;                                                      // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FReplaySoundEvent : public FReplaySerializedEvent
{
}; // Size: 0x10

struct FReplayStreamingEvent : public FReplaySerializedEvent
{
}; // Size: 0x10

struct FReplayTimelineControl
{
    float m_fMinInputTimeS;                                                           // 0x0018 (size: 0x4)
    float m_fCursorMaxSpeed;                                                          // 0x001C (size: 0x4)
    float m_fCursorBaseSpeed;                                                         // 0x0020 (size: 0x4)
    class UCurveFloat* m_Curve;                                                       // 0x0028 (size: 0x8)
    float m_fCursorMaxSpeedReachedTimeS;                                              // 0x0030 (size: 0x4)

}; // Size: 0x38

struct FReplayTimelineControllerData
{
    FReplayCameraMeshFadingData m_CameraMeshFadingData;                               // 0x0000 (size: 0x18)
    float m_fCameraFollowDampingValue;                                                // 0x0018 (size: 0x4)
    float m_fCameraFollowMaxDistanceLerp;                                             // 0x001C (size: 0x4)
    float m_fSavekeyModelFrequency;                                                   // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FReplayTimelineCurrentTransitionContext
{
    FVector2D m_vStartPosition;                                                       // 0x0000 (size: 0x8)
    FVector2D m_vEndPosition;                                                         // 0x0008 (size: 0x8)
    bool m_bHighlighted;                                                              // 0x0010 (size: 0x1)

}; // Size: 0x1C

struct FReplayTimelineIndicatorDisplayProperties
{
    class UCurveFloat* m_TimeDilationIndicatorWidthPerDilationValueCurve;             // 0x0000 (size: 0x8)
    float m_fIndicatorsAlignment;                                                     // 0x0008 (size: 0x4)
    float m_fIndicatorsHeight;                                                        // 0x000C (size: 0x4)
    bool m_bAntiAlias;                                                                // 0x0010 (size: 0x1)
    float m_fIndicatorsThickness;                                                     // 0x0014 (size: 0x4)
    float m_fTransitionThickness;                                                     // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FReplayTimelineTimeDilationContext
{
    TArray<FReplayTimelineTimeDilationData> m_Transitions;                            // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FReplayTimelineTimeDilationData
{
    FVector2D m_vStartPosition;                                                       // 0x0010 (size: 0x8)
    FVector2D m_vEndPosition;                                                         // 0x0018 (size: 0x8)
    bool m_bTransitionVisible;                                                        // 0x0020 (size: 0x1)
    TArray<float> m_IndicatorDilatedTimes;                                            // 0x0028 (size: 0x10)
    float m_fTimeDilation;                                                            // 0x0058 (size: 0x4)

}; // Size: 0x60

struct FReplayVoiceReplication
{
    ECharacterGender m_eGender;                                                       // 0x0000 (size: 0x1)
    FName m_VoiceArchetypeSwitchName;                                                 // 0x0004 (size: 0x8)
    FName m_VoiceVariationSwitchName;                                                 // 0x000C (size: 0x8)

}; // Size: 0x14

struct FReplicatedBoxSphereBounds
{
    bool m_bIsValid;                                                                  // 0x0000 (size: 0x1)
    FBoxSphereBounds m_Bounds;                                                        // 0x0004 (size: 0x1C)

}; // Size: 0x20

struct FReplicatedDamageEvent
{
    FVector m_vHurtOrigin;                                                            // 0x0000 (size: 0xC)
    float m_fDemoTimeS;                                                               // 0x000C (size: 0x4)
    float m_fBaseDamage;                                                              // 0x0010 (size: 0x4)
    float m_fDamageRadius;                                                            // 0x0014 (size: 0x4)
    float m_fImpulseStrength;                                                         // 0x0018 (size: 0x4)
    bool m_bFullDamage;                                                               // 0x001C (size: 0x1)

}; // Size: 0x20

struct FReplicatedDestructibleChunks
{
    TArray<FTransform> m_ChunkTransforms;                                             // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FReplicatedSequencerAnimMontage
{
    int32 m_iMontageId;                                                               // 0x0000 (size: 0x4)
    class UAnimSequenceBase* m_AnimSequence;                                          // 0x0008 (size: 0x8)
    uint8 m_uiCinematicSlot;                                                          // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FReplicatedSequencerAnimMontagePosition
{
    int32 m_iMontageId;                                                               // 0x0000 (size: 0x4)
    float m_fPosition;                                                                // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FRetrieveLostItemStruct
{
    class UBaseItemData* m_ItemOwned;                                                 // 0x0000 (size: 0x8)
    class UBaseItemData* m_ItemToGetIfOwned;                                          // 0x0008 (size: 0x8)
    bool m_bCheckReciprocity;                                                         // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FRotationAnimContainer
{
    FAnimContainer m_Anims;                                                           // 0x0000 (size: 0x48)

}; // Size: 0x48

struct FSCAITicketEnum : public FSCUserDefinedEnumHandler
{
}; // Size: 0x50

struct FSCAITriggerableActionsArray
{
    TArray<class USCAITriggerableActions*> m_Actions;                                 // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FSCAnimNode_AimIK : public FAnimNode_SkeletalControlBase
{
    TArray<FBoneIK> mIKBoneChain;                                                     // 0x00C8 (size: 0x10)
    FName mSocketNameToTransform;                                                     // 0x00D8 (size: 0x8)
    FVector mvTargetPosition;                                                         // 0x00E0 (size: 0xC)
    float mfMinDistanceRatio;                                                         // 0x00EC (size: 0x4)
    float mfMaxDistanceRatio;                                                         // 0x00F0 (size: 0x4)
    FBoneReference mBoneAnimTargetted;                                                // 0x00F4 (size: 0x10)
    bool mbUseDirectWorldPositionForHitTarget;                                        // 0x0104 (size: 0x1)
    FVector mvHitTargetPosition;                                                      // 0x0108 (size: 0xC)
    uint8 muiNbIterations;                                                            // 0x0114 (size: 0x1)
    float mfAbsoluteAngleTolerance;                                                   // 0x0118 (size: 0x4)
    bool mbDebugActivated;                                                            // 0x011C (size: 0x1)
    EAimIKSolverType meIKSolverType;                                                  // 0x011D (size: 0x1)

}; // Size: 0x230

struct FSCAnimNode_CCDIK : public FAnimNode_CCDIK
{
    FName mSaveBone;                                                                  // 0x0180 (size: 0x8)
    FVector mvEffectorComponentSpaceOffset;                                           // 0x0188 (size: 0xC)
    bool mbMirror;                                                                    // 0x0194 (size: 0x1)
    class UMirrorAnimDB* mMirrorAnimDB;                                               // 0x0198 (size: 0x8)

}; // Size: 0x220

struct FSCAnimNode_ComputeVariableWeight : public FAnimNode_Base
{
    FPoseLink mBasePose;                                                              // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FSCAnimNode_MirrorPose : public FAnimNode_Base
{
    FPoseLink mBasePose;                                                              // 0x0010 (size: 0x10)
    bool mbMirrorAnimation;                                                           // 0x0020 (size: 0x1)
    class UMirrorAnimDB* mMirrorAnimDB;                                               // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FSCAnimNode_MultiVariableWeightBlender : public FAnimNode_Base
{
    TArray<FPoseLink> VariableWeightPoses;                                            // 0x0010 (size: 0x10)
    TArray<FVariableWeightEnumHandler> Layers;                                        // 0x0020 (size: 0x10)
    bool bFullOverrideAlpha;                                                          // 0x0030 (size: 0x1)
    bool bFullOverrideMirrorAlpha;                                                    // 0x0031 (size: 0x1)
    float fMirrorOverrideAlpha;                                                       // 0x0034 (size: 0x4)
    bool bMute;                                                                       // 0x0038 (size: 0x1)

}; // Size: 0xC8

struct FSCAnimNode_PlayAnim : public FAnimNode_SequencePlayer
{
    bool mbMirrorAnimation;                                                           // 0x0090 (size: 0x1)
    int32 miAnimSubStateID;                                                           // 0x0094 (size: 0x4)
    uint8 muiTransitionGlobalType;                                                    // 0x0098 (size: 0x1)
    uint8 muiOrderID;                                                                 // 0x0099 (size: 0x1)
    bool mbIgnoreOrderID;                                                             // 0x009A (size: 0x1)
    bool mbUseStartCursor;                                                            // 0x009B (size: 0x1)
    float mfStartCursor;                                                              // 0x009C (size: 0x4)
    bool mbIgnoreTimeAccumulator;                                                     // 0x00A0 (size: 0x1)
    class UMirrorAnimDB* mMirrorAnimDB;                                               // 0x00A8 (size: 0x8)
    bool mbRecordedForReplay;                                                         // 0x00B0 (size: 0x1)

}; // Size: 0xB8

struct FSCAnimNode_PlayBlendSpace : public FAnimNode_BlendSpacePlayer
{
    bool mbMirrorAnimation;                                                           // 0x00F8 (size: 0x1)
    int32 miAnimSubStateID;                                                           // 0x00FC (size: 0x4)
    uint8 muiTransitionGlobalType;                                                    // 0x0100 (size: 0x1)
    uint8 muiOrderID;                                                                 // 0x0101 (size: 0x1)
    bool mbIgnoreOrderID;                                                             // 0x0102 (size: 0x1)
    class UMirrorAnimDB* mMirrorAnimDB;                                               // 0x0108 (size: 0x8)

}; // Size: 0x110

struct FSCAnimNode_RotationOffsetBlendSpace : public FAnimNode_BlendSpacePlayer
{
    FPoseLink BasePose;                                                               // 0x00F8 (size: 0x10)
    int32 LODThreshold;                                                               // 0x0108 (size: 0x4)
    float Alpha;                                                                      // 0x010C (size: 0x4)
    FInputScaleBias AlphaScaleBias;                                                   // 0x0110 (size: 0x8)
    FInputAlphaBoolBlend AlphaBoolBlend;                                              // 0x0118 (size: 0x48)
    FName AlphaCurveName;                                                             // 0x0160 (size: 0x8)
    FInputScaleBiasClamp AlphaScaleBiasClamp;                                         // 0x0168 (size: 0x30)
    EAnimAlphaInputType AlphaInputType;                                               // 0x019C (size: 0x1)
    bool bAlphaBoolEnabled;                                                           // 0x019D (size: 0x1)
    bool mbMirrorAnimation;                                                           // 0x019F (size: 0x1)
    class UMirrorAnimDB* mMirrorAnimDB;                                               // 0x01A0 (size: 0x8)

}; // Size: 0x1A8

struct FSCAnimNode_SaveBoneTransform : public FAnimNode_Base
{
    FPoseLink mBasePose;                                                              // 0x0010 (size: 0x10)
    FBoneReference mBone;                                                             // 0x0020 (size: 0x10)
    ECoordinateSystem meTransformSpace;                                               // 0x0040 (size: 0x1)
    bool mbMirror;                                                                    // 0x0041 (size: 0x1)
    class UMirrorAnimDB* mMirrorAnimDB;                                               // 0x0048 (size: 0x8)

}; // Size: 0x50

struct FSCAnimNode_SaveBoneTransformByEnum : public FSCAnimNode_SaveBoneTransform
{
    ESaveBone meSaveBone;                                                             // 0x0050 (size: 0x1)

}; // Size: 0x60

struct FSCAnimNode_SaveBoneTransformByName : public FSCAnimNode_SaveBoneTransform
{
    FName mSaveBone;                                                                  // 0x0050 (size: 0x8)

}; // Size: 0x58

struct FSCAnimNode_SetVariableWeightLayers : public FAnimNode_Base
{
    FPoseLink mBasePose;                                                              // 0x0010 (size: 0x10)
    TArray<FVariableWeightLayerToBoneMask> mVariableWeightLayerToBoneMaskRuntime;     // 0x0020 (size: 0x10)
    FVariableWeightInfo mVariableWeightLayerToBoneMaskFromOrderDB;                    // 0x0030 (size: 0x20)
    TArray<FVariableWeightLayerToBoneMask> mFillerLayers;                             // 0x0050 (size: 0x10)
    TArray<FVariableWeightLayerToBoneMask> mVariableWeightLayerToBoneMask;            // 0x0060 (size: 0x10)
    float mBlendTimeWhenSwitchingProfile;                                             // 0x0070 (size: 0x4)
    ESCBlendType mBlendModeWhenSwitchingProfile;                                      // 0x0074 (size: 0x1)
    TArray<FVariableWeightLayerToBoneMask> m_PrevVariableWeightLayerToBoneMaskRuntime; // 0x00B0 (size: 0x10)

}; // Size: 0xD0

struct FSCAnimNode_VariableWeightBlender : public FAnimNode_Base
{
    FPoseLink mMasterPose;                                                            // 0x0010 (size: 0x10)
    FPoseLink mVariableWeightPose;                                                    // 0x0020 (size: 0x10)
    FSCUserDefinedEnumHandler mLayer;                                                 // 0x0030 (size: 0x50)
    bool mbMeshSpaceBlend;                                                            // 0x0080 (size: 0x1)
    bool mbFullOverrideAlpha;                                                         // 0x0081 (size: 0x1)
    float mfLayerOverrideAlpha;                                                       // 0x0084 (size: 0x4)
    bool mbFullOverrideMirrorAlpha;                                                   // 0x0088 (size: 0x1)
    float mfMirrorOverrideAlpha;                                                      // 0x008C (size: 0x4)
    bool mbMute;                                                                      // 0x0090 (size: 0x1)

}; // Size: 0x98

struct FSCAnimNotifyExtraInfo
{
    bool m_bMirrorAnim;                                                               // 0x0000 (size: 0x1)
    int32 m_iSubAnimState;                                                            // 0x0004 (size: 0x4)
    uint8 m_uiTransitionGlobalType;                                                   // 0x0008 (size: 0x1)
    uint8 m_uiOrderID;                                                                // 0x0009 (size: 0x1)

}; // Size: 0xC

struct FSCAnimOrderServiceSettings
{
    TSubclassOf<class UOrderService> m_OrderService;                                  // 0x0000 (size: 0x8)
    bool m_bDisable;                                                                  // 0x0008 (size: 0x1)

}; // Size: 0x10

struct FSCBoneMask
{
}; // Size: 0x68

struct FSCConditionnalAnimContainer
{
    FAnimContainer m_animContainer;                                                   // 0x0000 (size: 0x18)
    TArray<FBaseActorConditionInstance> m_Conditions;                                 // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FSCConditionnalGestureAndBlendProfile
{
    EFidgetMirroringTypes m_eMirrorWithQuadrantHandling;                              // 0x0000 (size: 0x1)
    FSCGestureAndBlendProfile m_animContainer;                                        // 0x0008 (size: 0x38)
    EQuadrantTypes m_eQuadrant;                                                       // 0x0040 (size: 0x1)
    TArray<FBaseActorConditionInstance> m_Conditions;                                 // 0x0048 (size: 0x10)

}; // Size: 0x58

struct FSCDeathAnimTypeEnum : public FSCUserDefinedEnumHandler
{
}; // Size: 0x50

struct FSCFloatRange
{
    float m_fMin;                                                                     // 0x0000 (size: 0x4)
    float m_fMax;                                                                     // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FSCGameplayAbilityActivationInfo
{
    FGameplayAbilitySpecHandle m_Handle;                                              // 0x0000 (size: 0x4)
    FSCGameplayAbilityActorInfo m_ActorInfos;                                         // 0x0008 (size: 0x48)
    FGameplayAbilityActivationInfo m_ActivationInfo;                                  // 0x0050 (size: 0x18)
    FGameplayEventData m_EventData;                                                   // 0x0068 (size: 0xB0)
    class UAbilityPayload* m_Payload;                                                 // 0x0118 (size: 0x8)
    TWeakObjectPtr<class AActor> m_Target;                                            // 0x0120 (size: 0x8)

}; // Size: 0x128

struct FSCGameplayAbilityActorInfo : public FGameplayAbilityActorInfo
{
}; // Size: 0x48

struct FSCGameplayAbilityTargetData : public FGameplayAbilityTargetData
{
    TWeakObjectPtr<class AActor> m_Target;                                            // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FSCImpostorForSave
{
    FName m_PoolName;                                                                 // 0x0000 (size: 0x8)
    TSoftObjectPtr<USkeletalMesh> m_ImpostorSkeletalMesh;                             // 0x0008 (size: 0x28)
    FTransform m_Transform;                                                           // 0x0030 (size: 0x30)
    FName m_StreamLevelName;                                                          // 0x0060 (size: 0x8)
    FName m_VoiceArchetypeSwitchName;                                                 // 0x0068 (size: 0x8)
    ECharacterGender m_eGender;                                                       // 0x0070 (size: 0x1)
    FName m_VoiceVariationSwitchValue;                                                // 0x0074 (size: 0x8)

}; // Size: 0x80

struct FSCInt32Range
{
    int32 m_iMin;                                                                     // 0x0000 (size: 0x4)
    int32 m_iMax;                                                                     // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FSCRangeFloatCurve
{
    FFloatRange m_Range;                                                              // 0x0000 (size: 0x10)
    bool m_bUseCurve;                                                                 // 0x0010 (size: 0x1)
    class UCurveFloat* m_CurveMax;                                                    // 0x0018 (size: 0x8)
    class UCurveFloat* m_CurveMin;                                                    // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FSCWuguanUserEnumSetting
{
    FSoftObjectPath m_Enum;                                                           // 0x0000 (size: 0x18)
    TSoftClassPtr<USCUserDefinedEnumBinding> m_Bindings;                              // 0x0018 (size: 0x28)

}; // Size: 0x40

struct FSafeZoneBonePair
{
    FName m_bone1;                                                                    // 0x0000 (size: 0x8)
    FName m_bone2;                                                                    // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FSaveAdditionalInfos
{
    int32 m_iAge;                                                                     // 0x0000 (size: 0x4)
    ECharacterGender m_eGender;                                                       // 0x0004 (size: 0x1)
    FName m_MapTag;                                                                   // 0x0008 (size: 0x8)
    EGameDifficulty m_eDifficulty;                                                    // 0x0010 (size: 0x1)

}; // Size: 0x14

struct FSaveGameInputMappingKeySlot
{
    EVirtualAction m_eVirtualAction;                                                  // 0x0000 (size: 0x4)
    TArray<FName> m_Actions;                                                          // 0x0008 (size: 0x10)
    TArray<FSaveInputAxisKeyMapping> m_Axis;                                          // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FSaveInputAxisKeyMapping
{
    FName m_Key;                                                                      // 0x0000 (size: 0x8)
    float m_fScale;                                                                   // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FScreenTextureData
{
    TSoftObjectPtr<UTexture2D> m_Texture;                                             // 0x0000 (size: 0x28)
    FText m_DisplayText;                                                              // 0x0028 (size: 0x18)
    FVector2D m_vSize;                                                                // 0x0040 (size: 0x8)
    FVector2D m_vMargin;                                                              // 0x0048 (size: 0x8)
    FVector2D m_vUV;                                                                  // 0x0050 (size: 0x8)
    FVector2D m_vUVSize;                                                              // 0x0058 (size: 0x8)
    FLinearColor m_TintColor;                                                         // 0x0060 (size: 0x10)
    TEnumAsByte<EBlendMode> m_eBlendMode;                                             // 0x0070 (size: 0x1)
    float m_fScale;                                                                   // 0x0074 (size: 0x4)
    bool m_bScalePosition;                                                            // 0x0078 (size: 0x1)
    float m_fRotation;                                                                // 0x007C (size: 0x4)
    FVector2D m_vRotationPivot;                                                       // 0x0080 (size: 0x8)

}; // Size: 0x88

struct FSequenceBinding
{
    FName m_RoleName;                                                                 // 0x0000 (size: 0x8)
    TSoftObjectPtr<AActor> m_Actor;                                                   // 0x0008 (size: 0x28)

}; // Size: 0x30

struct FSequenceCheckPointData
{
    float m_fPlayBackPosition;                                                        // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FSetVariableWeightInfo
{
    FName m_Name;                                                                     // 0x0000 (size: 0x8)
    bool m_bBlendOut;                                                                 // 0x0008 (size: 0x1)
    bool m_bOverride;                                                                 // 0x0009 (size: 0x1)
    float m_fOverrideDuration;                                                        // 0x000C (size: 0x4)

}; // Size: 0x10

struct FSkillFilter
{
    ENullableCondition m_eAcquired;                                                   // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FSkillTreeNode
{
    FName m_Socket;                                                                   // 0x0000 (size: 0x8)
    TSubclassOf<class USkillGameplayEffect> m_Skill;                                  // 0x0008 (size: 0x8)
    class USkillsChilds* m_Childs;                                                    // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FSkinToneGender
{
    class UMaterialInterface* m_SkinTones;                                            // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FSlotEquipmentValues
{
    TMap<class EGearRarity, class FEquipmentValues> m_EquipmentsValues;               // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FSocialRequestInfo
{
}; // Size: 0x14

struct FSocketIK : public FBoneIK
{
}; // Size: 0xE0

struct FSortMethodData
{
    FText m_Name;                                                                     // 0x0000 (size: 0x18)

}; // Size: 0x18

struct FSoundMoodMeleeState
{
    int32 m_iMeleeDifficultyLevel;                                                    // 0x0010 (size: 0x4)
    bool m_bIsFightActive;                                                            // 0x0014 (size: 0x1)
    TWeakObjectPtr<class AAISituationActor> m_AiSituation;                            // 0x0018 (size: 0x8)
    TWeakObjectPtr<class AAISituationActor> m_LastEncounteredSituation;               // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FSoundMoodState
{
    ESoundMoodGameplayState m_eGameplayState;                                         // 0x0000 (size: 0x1)
    int32 m_iLevel;                                                                   // 0x0004 (size: 0x4)
    FSoundMoodMeleeState m_meleeState;                                                // 0x0008 (size: 0x28)

}; // Size: 0x30

struct FSoundReplicationData
{
}; // Size: 0xA0

struct FSoundStateInfo
{
    uint32 m_uiStateValue;                                                            // 0x0000 (size: 0x4)
    bool m_bReplicates;                                                               // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FSoundTensionThreat
{
    TArray<class AAISituationActor*> m_AiSituations;                                  // 0x0000 (size: 0x10)
    int32 m_iBehaviorsMask;                                                           // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FSpawnerGroupLayer
{
    int32 m_iLevelMin;                                                                // 0x0000 (size: 0x4)
    int32 m_iLevelMax;                                                                // 0x0004 (size: 0x4)
    bool m_bFixedSituation;                                                           // 0x0008 (size: 0x1)
    TArray<class AAISpawner*> m_Spawners;                                             // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FSpawnerGroupSoundData
{
    float m_FightStateOffDelay;                                                       // 0x0000 (size: 0x4)
    TArray<int32> m_MeleeStateLvlSplits;                                              // 0x0008 (size: 0x10)
    TArray<int32> m_MeleeDangerLvlSplits;                                             // 0x0018 (size: 0x10)
    float m_MeleeFightStateOffDelay;                                                  // 0x0028 (size: 0x4)
    int32 m_iMeleeThreshold;                                                          // 0x002C (size: 0x4)
    bool m_bIsThreatEnabled;                                                          // 0x0030 (size: 0x1)
    TArray<class ASpawnerGroup*> m_DependantGroups;                                   // 0x0038 (size: 0x10)
    TArray<class AAISituationActor*> m_DependantSituations;                           // 0x0048 (size: 0x10)

}; // Size: 0x58

struct FSpawnerPerZone
{
    TWeakObjectPtr<class AAISpawner> m_Spawner;                                       // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FSpawningClassContainer
{
    TSubclassOf<class ABaseCharacter> m_SpawningClass;                                // 0x0000 (size: 0x8)
    FName m_ImpostorCustomName;                                                       // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FSpecialAbilityDelayedLayer
{
    class UAvailabilityLayerData* m_PushLayerOnSuccess;                               // 0x0000 (size: 0x8)
    float m_fPushLayerDelay;                                                          // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FSpeedDescriptionStruct
{
    float m_fBaseSpeed;                                                               // 0x0040 (size: 0x4)
    float m_fOverrAll;                                                                // 0x0044 (size: 0x4)
    float m_fPlayRate;                                                                // 0x0048 (size: 0x4)

}; // Size: 0x50

struct FSpeedState
{
    bool m_bV0;                                                                       // 0x0000 (size: 0x1)
    bool m_bV1;                                                                       // 0x0001 (size: 0x1)
    bool m_bV2;                                                                       // 0x0002 (size: 0x1)
    bool m_bV3;                                                                       // 0x0003 (size: 0x1)
    ESpeedState m_eSpeedState;                                                        // 0x0004 (size: 0x1)

}; // Size: 0x5

struct FSpeedStateAnimContainer
{
    FAnimContainer m_Anims;                                                           // 0x0000 (size: 0x60)

}; // Size: 0x60

struct FSpeedStateBlendDescription
{
    float m_BlendTime;                                                                // 0x0000 (size: 0x4)
    class UCurveFloat* m_BlendCurve;                                                  // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FSpeedStateBlendTo
{
    FSpeedStateBlendDescription m_BlendDescription;                                   // 0x0000 (size: 0x40)

}; // Size: 0x40

struct FSpeedStateFromGoalDistSelector
{
    ESpeedState m_eNearFromGoalSpeedState;                                            // 0x0000 (size: 0x1)
    float m_fDistToGoalThresold;                                                      // 0x0004 (size: 0x4)
    ESpeedState m_eFarFromGoalSpeedState;                                             // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FSpeedTransitionsAnimContainer
{
    FCardinalChangementAnimContainer m_Start_FL;                                      // 0x0000 (size: 0x180)
    FCardinalAnimContainer m_Stop_FL;                                                 // 0x0180 (size: 0x60)
    FOrientedRotationAnimContainer m_UTurn;                                           // 0x01E0 (size: 0x90)
    FCardinalAnimContainer m_Strafe;                                                  // 0x0270 (size: 0x60)

}; // Size: 0x2D0

struct FStarUnlockConditionClassInstance
{
    TSubclassOf<class UStarUnlockCondition> m_DefaultClassObject;                     // 0x0000 (size: 0x8)
    class UStarUnlockCondition* m_Instance;                                           // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FStateWeight
{
    float m_fTargetWeight;                                                            // 0x0000 (size: 0x4)
    float m_fInDuration;                                                              // 0x0004 (size: 0x4)
    float m_fOutDuration;                                                             // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FStructureBrokenReaction : public FBaseFightingStateBehavior
{
    float m_fDuration;                                                                // 0x0010 (size: 0x4)
    FAnimContainer m_Loop;                                                            // 0x0018 (size: 0x18)
    bool m_bMirrorableLoop;                                                           // 0x0030 (size: 0x1)
    float m_fGuardCoefRecoveredAtEnd;                                                 // 0x0034 (size: 0x4)
    float m_fGuardRecoveredAtEnd;                                                     // 0x0038 (size: 0x4)

}; // Size: 0x40

struct FSubZoneShortcutStruct
{
    bool m_bIsAShortCut;                                                              // 0x0000 (size: 0x1)
    int32 m_iZone;                                                                    // 0x0004 (size: 0x4)
    int32 m_iSubZone;                                                                 // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FSuperDizzyReaction
{
    float m_fMandatoryDuration;                                                       // 0x0000 (size: 0x4)
    float m_fMaxAccumulatedDamage;                                                    // 0x0004 (size: 0x4)
    int32 m_iMaxAccumatedHits;                                                        // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FSwapperStructBase
{
    bool m_bInProgress1Or2;                                                           // 0x0050 (size: 0x1)
    bool m_bInProgress1;                                                              // 0x0051 (size: 0x1)
    bool m_bInProgress2;                                                              // 0x0052 (size: 0x1)

}; // Size: 0x60

struct FTargetEvaluationDBInstance
{
    TSubclassOf<class UBaseTargetEvaluation> m_DefaultClassObject;                    // 0x0000 (size: 0x8)
    class UBaseTargetEvaluation* m_Instance;                                          // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FTargetEvaluationSettings
{
    FTargetEvaluationDBInstance m_TargetEvaluationInstance;                           // 0x0000 (size: 0x10)
    float m_fRange;                                                                   // 0x0010 (size: 0x4)
    bool m_bMute;                                                                     // 0x0014 (size: 0x1)

}; // Size: 0x18

struct FTargetForSlotsEnumHandler : public FSCUserDefinedEnumHandler
{
}; // Size: 0x50

struct FTargetResult
{
    TWeakObjectPtr<class AActor> m_Target;                                            // 0x0000 (size: 0x8)
    uint8 m_uiPriority;                                                               // 0x0008 (size: 0x1)
    EActionType m_eActionType;                                                        // 0x0009 (size: 0x1)

}; // Size: 0xC

struct FTargetSettings
{
    float m_fUpdateFrequency;                                                         // 0x0000 (size: 0x4)
    TArray<class UEvaluateTargetCondition*> m_Conditions;                             // 0x0008 (size: 0x10)
    TArray<FTargetEvaluationSettings> m_Evaluations;                                  // 0x0018 (size: 0x10)
    FString m_DebugConsoleVariable;                                                   // 0x0028 (size: 0x10)
    ETargetingPrio m_eDebugConsoleVariableMinTargettingPrio;                          // 0x0038 (size: 0x1)
    FColor m_DebugActionColor;                                                        // 0x003C (size: 0x4)

}; // Size: 0x40

struct FTargetableConditions
{
    TMap<class ETargetingPrio, class FFloatRange> m_Ranges;                           // 0x0000 (size: 0x50)
    TArray<class UEvaluateTargetCondition*> m_Conditions;                             // 0x0050 (size: 0x10)
    TArray<class TSubclassOf<UEvaluateTargetCondition>> m_ClassConditions;            // 0x0060 (size: 0x10)

}; // Size: 0x70

struct FTargetableFactions
{
    uint8 m_TargetableFactions;                                                       // 0x0000 (size: 0x6)

}; // Size: 0x6

struct FTensionVolumesContainer
{
    TArray<TWeakObjectPtr<ASoundTensionVolume>> m_overlappedTensionVolumes;           // 0x0000 (size: 0x10)
    TMap<class TWeakObjectPtr<ASoundTensionPortal>, class bool> m_TensionPortalsCrossed; // 0x0010 (size: 0x50)

}; // Size: 0x60

struct FTimelineChangeState
{
    int32 m_iKeyCountChange;                                                          // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FTimerAndOffset
{
    float m_fTime;                                                                    // 0x0000 (size: 0x4)
    float m_fOffset;                                                                  // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FTintData
{
    FText m_Name;                                                                     // 0x0000 (size: 0x18)
    FLinearColor m_inventoryIconColor;                                                // 0x0018 (size: 0x10)
    FLinearColor m_dyeIconColor;                                                      // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FTrackingPayloadActivateTimedMetric
{
    int64 offsetPlaytime;                                                             // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FTrackingPayloadChallenges
{
    FString m_sChallengeName;                                                         // 0x0000 (size: 0x10)
    int32 m_iHighScore;                                                               // 0x0010 (size: 0x4)
    uint8 m_uiNumberStars;                                                            // 0x0014 (size: 0x1)

}; // Size: 0x18

struct FTrackingPayloadEmpty
{
}; // Size: 0x1

struct FTrackingPayloadOptions
{
    FString Theme;                                                                    // 0x0000 (size: 0x10)
    int32 HighCont;                                                                   // 0x0010 (size: 0x4)
    FString HUDDisplay;                                                               // 0x0018 (size: 0x10)
    int32 HUDSize;                                                                    // 0x0028 (size: 0x4)
    int32 sub;                                                                        // 0x002C (size: 0x4)
    int32 subOpacity;                                                                 // 0x0030 (size: 0x4)
    FString GameInput;                                                                // 0x0038 (size: 0x10)
    FString remapProfile;                                                             // 0x0048 (size: 0x10)
    FString InputPress;                                                               // 0x0058 (size: 0x10)
    int32 HideVFX;                                                                    // 0x0068 (size: 0x4)
    int32 CameraShake;                                                                // 0x006C (size: 0x4)
    int32 HudFraming;                                                                 // 0x0070 (size: 0x4)
    int32 BlinkingEffect;                                                             // 0x0074 (size: 0x4)
    FString AudioOut;                                                                 // 0x0078 (size: 0x10)

}; // Size: 0x88

struct FTrackingPayloadStartPlaying
{
    FString m_AudioLanguage;                                                          // 0x0000 (size: 0x10)
    FString m_TextLanguage;                                                           // 0x0010 (size: 0x10)
    FString m_Platform;                                                               // 0x0020 (size: 0x10)
    FString ver;                                                                      // 0x0030 (size: 0x10)
    FString difficulty;                                                               // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FTrackingPayloadStopTimedMetric
{
    int64 offsetPlaytime;                                                             // 0x0000 (size: 0x8)
    FString Type;                                                                     // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FTrackingPayloadWithInt
{
    int64 m_Int;                                                                      // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FTrackingPayloadWithText
{
    FString m_Text;                                                                   // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FTransitionRequest
{
    ESpeedState m_eInSpeedState;                                                      // 0x0000 (size: 0x1)
    ESCCardinalPoints m_eInCardinalPoint;                                             // 0x0001 (size: 0x1)
    ESpeedState m_eOutSpeedState;                                                     // 0x0002 (size: 0x1)
    ESCCardinalPoints m_eOutCardinalPoint;                                            // 0x0003 (size: 0x1)
    ETransitionRotation m_eVelocityRotation;                                          // 0x0004 (size: 0x1)
    float m_fAbsVelocityAngle;                                                        // 0x0008 (size: 0x4)
    bool m_bIsRotationLeft;                                                           // 0x000C (size: 0x1)

}; // Size: 0x10

struct FTraversalAnimContainer
{
    FAnimContainer m_AnimEntry;                                                       // 0x0000 (size: 0x18)
    FAnimContainer m_AnimLoop;                                                        // 0x0018 (size: 0x18)
    FAnimContainer m_AnimPreExit;                                                     // 0x0030 (size: 0x18)
    FAnimContainer m_AnimExitLoop;                                                    // 0x0048 (size: 0x18)
    FAnimContainer m_AnimLanding;                                                     // 0x0060 (size: 0x18)
    bool m_bHandleDamageOnAnimLanding;                                                // 0x0078 (size: 0x1)

}; // Size: 0x80

struct FTraversalAxisConstraint
{
    ESimpleAxis m_eAxis;                                                              // 0x0000 (size: 0x1)
    ESimpleAxisSide m_eForbiddenAxisSide;                                             // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FTraversalComponentMargin
{
    float m_fNegAxisMargin;                                                           // 0x0000 (size: 0x4)
    float m_fPosAxisMargin;                                                           // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FTraversalInfo
{
    TWeakObjectPtr<class UTraversalComponent> m_traversalComponent;                   // 0x0000 (size: 0x8)
    FVector m_vTraversalStartPos;                                                     // 0x0008 (size: 0xC)
    FVector m_vTraversalEndPos;                                                       // 0x0014 (size: 0xC)
    float m_fTraversalLength;                                                         // 0x0020 (size: 0x4)
    float m_fTraversalHeight;                                                         // 0x0024 (size: 0x4)
    ETraversalEntryType m_eEntryType;                                                 // 0x0028 (size: 0x1)
    ECharacterTraversalType m_eType;                                                  // 0x0029 (size: 0x1)
    bool m_bClimbWithFence;                                                           // 0x002A (size: 0x1)
    TWeakObjectPtr<class UTraversalComponent> m_TraversalFenceOnTop;                  // 0x002C (size: 0x8)
    bool m_bTraversalOnStaticMesh;                                                    // 0x0034 (size: 0x1)
    FHitResult m_FirstImpactOnTraversal;                                              // 0x0038 (size: 0x8C)
    bool m_bValidStartPos;                                                            // 0x00C4 (size: 0x1)

}; // Size: 0xC8

struct FTraversalInputBehavior
{
    bool m_bUseCharacterVelocityInsteadOfDirOnStick;                                  // 0x0000 (size: 0x1)
    float m_fMaxAngleBetweenVelocityAndStickDir;                                      // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FTraversalTypeSettings
{
    float m_fEntryAngleAllowance;                                                     // 0x0000 (size: 0x4)
    float m_fExitAngleClampValue;                                                     // 0x0004 (size: 0x4)
    float m_fMinTraversalDist;                                                        // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FTurnAnimation
{
    FAnimContainer m_animContainer;                                                   // 0x0000 (size: 0x18)
    ESCRotationWay m_eRotationWay;                                                    // 0x0018 (size: 0x1)

}; // Size: 0x20

struct FTurnAnimationArray
{
    TArray<FTurnAnimation> m_TurnAnimations;                                          // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FTutorialDataRow : public FTableRowBase
{
    FName m_Name;                                                                     // 0x0008 (size: 0x8)
    FText m_Title;                                                                    // 0x0010 (size: 0x18)
    FText m_Subtitle;                                                                 // 0x0028 (size: 0x18)
    TArray<FInputTutorialStruct> m_Inputs;                                            // 0x0040 (size: 0x10)
    FText m_Description;                                                              // 0x0050 (size: 0x18)
    FText m_Details;                                                                  // 0x0068 (size: 0x18)
    bool m_bIsUnlockedByDefault;                                                      // 0x0080 (size: 0x1)
    bool m_bIsUnlockable;                                                             // 0x0081 (size: 0x1)

}; // Size: 0x88

struct FTutorialUnlockStruct
{
    ETutorialUnlockState m_eUnlockState;                                              // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FUOrderParamsClassInstance
{
    TSubclassOf<class UOrderParams> m_DefaultClassObject;                             // 0x0000 (size: 0x8)
    class UOrderParams* m_Instance;                                                   // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FUOrderParamsInstanceStruct
{
    class UOrderParams* m_Instance;                                                   // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FUsableWeaponInfo
{
    TSubclassOf<class UWeaponGameplayData> m_weaponGameplayData;                      // 0x0000 (size: 0x8)
    TMap<class TSubclassOf<ABaseWeapon>, class TSubclassOf<UBaseWeaponData>> m_WeaponAnimInfos; // 0x0008 (size: 0x50)

}; // Size: 0x58

struct FVariableWeightActivation
{
}; // Size: 0x38

struct FVariableWeightEnumHandler : public FSCUserDefinedEnumHandler
{
}; // Size: 0x50

struct FVariableWeightInfo
{
    TArray<FVariableWeightLayerToBoneMask> m_layers;                                  // 0x0000 (size: 0x10)
    TArray<FVariableWeightLayerToBoneMask> m_pendingDelete;                           // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FVariableWeightLayerToBoneMask
{
    FSCUserDefinedEnumHandler m_LayerEnum;                                            // 0x0000 (size: 0x50)
    class UBlendProfile* m_BoneMask;                                                  // 0x0050 (size: 0x8)

}; // Size: 0x58

struct FVitalPointDataDefinition
{
    FName m_BoneToAttachBillboard;                                                    // 0x0000 (size: 0x8)
    bool m_bOnWeapon;                                                                 // 0x0008 (size: 0x1)
    class UVitalPointData* m_VitalPointData;                                          // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FVoiceOver
{
    TSoftObjectPtr<ULevelSequence> m_AudioSequence;                                   // 0x0000 (size: 0x28)
    TArray<FText> m_Lines;                                                            // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FVoiceVariationsAkSwitchContainer
{
    TArray<FName> m_VoiceVariationsSwitchValues;                                      // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FVolumesArray
{
    TArray<class ASCVolume*> m_Volumes;                                               // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FWeaponAnimInfo : public FAssociatedPropsAnimInfo
{
    EWeaponAnimType m_eWeaponAnimType;                                                // 0x0008 (size: 0x1)
    class UAnimationAsset* m_weaponAnimAssociated;                                    // 0x0010 (size: 0x8)
    class UBlendSpaceBase* m_weaponBlendSpaceAssociated;                              // 0x0018 (size: 0x8)
    TMap<class FString, class FWeaponBlendSpaceParam> m_weaponBlendSpaceParam;        // 0x0020 (size: 0x50)
    class UCurveFloat* m_playRateCurve;                                               // 0x0070 (size: 0x8)
    EWeaponBlendSpaceComputeTime m_eBlendSpaceComputeTime;                            // 0x0078 (size: 0x1)
    EWeaponOrientationConstraint m_eOrientationConstraint;                            // 0x0079 (size: 0x1)

}; // Size: 0x90

struct FWeaponBlendSpaceParam
{
    EBlendSpaceParamComputeType m_eBlendSpaceParamComputeType;                        // 0x0000 (size: 0x1)
    FFloatRange m_customRange;                                                        // 0x0004 (size: 0x10)
    FName m_DistanceRefBone;                                                          // 0x0014 (size: 0x8)
    FName m_DistanceTargetBone;                                                       // 0x001C (size: 0x8)
    FVector m_vDistanceOffset;                                                        // 0x0024 (size: 0xC)

}; // Size: 0x30

struct FWeaponOverrideInfo : public FBaseWeaponOverrideInfo
{
    class UAIContextualDefense* m_ContextualDefenseOverride;                          // 0x0018 (size: 0x8)
    TArray<FComboOverride> m_ComboOverrides;                                          // 0x0020 (size: 0x10)
    TSubclassOf<class UAvoidAbility> m_AvoidAbility;                                  // 0x0030 (size: 0x8)
    class UBaseMovementDB* m_MovementDB;                                              // 0x0038 (size: 0x8)
    bool m_bActivateAttackTicketFactorsOverride;                                      // 0x0040 (size: 0x1)
    TMap<EAIWuguanTicketEvaluation, float> m_AttackTicketEvaluationFactorsOverride;   // 0x0048 (size: 0x50)
    bool m_bActivateCirclePerCombatRoleOverride;                                      // 0x0098 (size: 0x1)
    TMap<ESCAICombatRoles, int32> m_CirclePerCombatRolesOverride;                     // 0x00A0 (size: 0x50)
    bool m_bOverrideLocomotionPaceSelector;                                           // 0x00F0 (size: 0x1)
    FLocomotionPaceSelector m_OverridingLocomotionPaceSelector;                       // 0x00F4 (size: 0x24)

}; // Size: 0x118

struct FWeaponShopDataRow : public FTableRowBase
{
    class UBaseItemData* m_Weapon;                                                    // 0x0008 (size: 0x8)
    int32 m_iGMLevelRequired;                                                         // 0x0010 (size: 0x4)
    int32 m_iGleamLevelRequired;                                                      // 0x0014 (size: 0x4)
    int32 m_iFragmentPrice;                                                           // 0x0018 (size: 0x4)
    int32 m_iPrestigePointPrice;                                                      // 0x001C (size: 0x4)

}; // Size: 0x20

struct FWeaponSituationDescription
{
    int32 m_iLevelMin;                                                                // 0x0000 (size: 0x4)
    int32 m_iLevelMax;                                                                // 0x0004 (size: 0x4)
    TArray<class UVisibleWeaponData*> m_WeaponsData;                                  // 0x0008 (size: 0x10)
    uint32 m_uiAppearanceProbabilities;                                               // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FWeaponVisuals
{
    TSoftObjectPtr<USkeletalMesh> m_SkeletalMesh;                                     // 0x0000 (size: 0x28)
    TArray<TSoftObjectPtr<UMaterialInterface>> m_Materials;                           // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FWidgetPoolElement
{
    class USCUserWidget* m_Widget;                                                    // 0x0000 (size: 0x8)

}; // Size: 0x10

struct FWidgetPoolElementArray
{
    TArray<FWidgetPoolElement> m_Array;                                               // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FWidgetPoolEntryTemplate
{
    FSCUserDefinedEnumHandler m_LayerEnum;                                            // 0x0000 (size: 0x50)
    TSubclassOf<class USCUserWidget> m_WidgetClass;                                   // 0x0050 (size: 0x8)
    int32 m_iNumberOfInstances;                                                       // 0x0058 (size: 0x4)

}; // Size: 0x60

struct FreeMoveAnimQuadrant
{
    FBlendSpaceDirectionContainer m_FreeMoveBlendSpace;                               // 0x0000 (size: 0x20)

}; // Size: 0x20

class AAIDirectorActor : public AActor
{
    FAIDirectorActorOnGlobalBehaviorsChanged OnGlobalBehaviorsChanged;                // 0x02B0 (size: 0x10)
    void GlobalBehaviorChanged(EGlobalBehaviors EGlobalBehaviors);
    FAIDirectorActorOnAIDeathDetected OnAIDeathDetected;                              // 0x02C0 (size: 0x10)
    void OnAIDeathDetected(const class AFightingCharacter* _AICharacter, const FDamageInfos& _damageInfos);
    FAIDirectorActorOnDifficultyLevelChanged OnDifficultyLevelChanged;                // 0x02D0 (size: 0x10)
    void DynamicMulticast();

    void OnAIDeathDetected__DelegateSignature(const class AFightingCharacter* _AICharacter, const FDamageInfos& _damageInfos);
    void GlobalBehaviorChanged__DelegateSignature(EGlobalBehaviors EGlobalBehaviors);
    void BPF_UnbindFromAlertLevelChanged(FBPF_UnbindFromAlertLevelChangedDelegate Delegate);
    void BPF_RemoveGlobalAlertLevelThreshold(FName _name);
    EAlertLevel BPF_GlobalAlertLevel();
    EAlertLevel BPF_GetAlertLevel();
    void BPF_GetAIsForEnemy(const class AActor* _enemyActor, ESCAICombatRoles _eCombatRole, TArray<class AActor*>& _AICharactersOutArray);
    void BPF_BindToAlertLevelChanged(FBPF_BindToAlertLevelChangedDelegate Delegate);
    void BPF_AddGlobalAlertLevelThreshold(EAlertLevel _eLevel, EAlertLevelThreshold _eType, FName _name);
    void BPE_OnSituationDeactivated(const class AAISituationActor* _situationActor);
    void BPE_OnSituationActivated(const class AAISituationActor* _situationActor);
    void BPE_OnSafeSanctuaryBarkTrigger(const class AFightingCharacter* _Enemy);
    void BPE_OnMCDominationChanged(EMcDominationGaugeSteps _NewStep);
    void BPE_OnLastManPhaseStarted(const class UAIFightingComponent* _aiComponent);
    void BPE_OnGlobalBehaviorChanged(const class UAIFightingComponent* _aiComponent, EGlobalBehaviors _NewBehavior, EAlertedReason _AlertedReason, bool _SkipBark);
    void BPE_OnEnemyRevival(class ABaseCharacter* _Enemy);
    void BPE_OnEnemyPickedWeapon(const class AFightingCharacter* _Enemy);
    void BPE_OnEnemyOrderStateChanged(const class AFightingCharacter* _Enemy, EOrderType _OrderType, EOrderState _OrderState);
    void BPE_OnEnemyFightingStateChanged(EFightingState _eFightingState, bool _bPushed);
    void BPE_OnEnemyDeathDetected(const class AFightingCharacter* _Enemy, const FDamageInfos& _damageInfos);
    void BPE_OnCombatRolesChanged(ESCAICombatRolesChangeReason _eReason);
    void BPE_OnAIDeathDetected(const class AFightingCharacter* _AICharacter, const FDamageInfos& _damageInfos);
    void BPE_OnAIActionExecute(const class UAIFightingComponent* _aiComponent, const class USCAiAction* _AIAction);
    bool BPE_CanAICharacterSpeak(const class AFightingCharacter* Character);
    void AlertLevelChangedMulticastDynamic__DelegateSignature(EAlertLevel EAlertLevel);
    void AlertLevelChanged__DelegateSignature(EAlertLevel EAlertLevel);
}; // Size: 0x490

class AAISanctuaryVolume : public ASCVolume
{
    class UAISanctuaryComponent* m_SanctuaryComponent;                                // 0x0368 (size: 0x8)

    void OnSanctuaryAssignmentUpdated();
    void OnAlertLevelChanged(EAlertLevel _eNewLevel);
}; // Size: 0x390

class AAISituationActor : public AActor
{
    FAISituationActorOnSituationActivated OnSituationActivated;                       // 0x02B0 (size: 0x10)
    void AISituationDynamicMulticastDelegate(class AAISituationActor* SituationChanged);
    FAISituationActorOnSituationResolved OnSituationResolved;                         // 0x02C0 (size: 0x10)
    void AISituationDynamicMulticastDelegate(class AAISituationActor* SituationChanged);
    FAISituationActorOnAnyAiBehaviorChanged OnAnyAiBehaviorChanged;                   // 0x02D0 (size: 0x10)
    void AISituationGlobalBehaviorChangedDynamic(class AAISituationActor* SituationChanged, const class UAIFightingComponent* AI, EGlobalBehaviors NewBehavior);
    FAISituationActorOnSituationSpawnedDynamic OnSituationSpawnedDynamic;             // 0x02E0 (size: 0x10)
    void AISituationDynamicMulticastDelegate(class AAISituationActor* SituationChanged);
    FAISituationActorOnAISpawned OnAISpawned;                                         // 0x0320 (size: 0x10)
    void EventWithCharacterDynamic(class ABaseCharacter* _character);
    FAISituationActorOnAIDeath OnAIDeath;                                             // 0x0330 (size: 0x10)
    void EventWithCharacterDynamic(class ABaseCharacter* _character);
    bool m_bHasActiveLDVisibilityOverride;                                            // 0x0340 (size: 0x1)
    class USCSaveGameComponent* m_SaveComponent;                                      // 0x0360 (size: 0x8)
    TArray<class ASpawnerGroup*> m_AssociatedSpawnerGroups;                           // 0x0368 (size: 0x10)
    TArray<class ALockableDoor*> m_AssociatedLockableDoors;                           // 0x0378 (size: 0x10)
    TArray<class AActor*> m_PositioningPOIs;                                          // 0x0388 (size: 0x10)
    bool m_bIsLastManAllowed;                                                         // 0x0398 (size: 0x1)
    bool m_bForceLastMan;                                                             // 0x0399 (size: 0x1)
    int32 m_iMinKillBeforeLastMan;                                                    // 0x039C (size: 0x4)
    int32 m_iLastManGaugeIncrementValue;                                              // 0x03A0 (size: 0x4)
    int32 m_iLastManMaxOccuranceCount;                                                // 0x03A4 (size: 0x4)
    FSpawnerGroupSoundData m_SoundData;                                               // 0x03A8 (size: 0x58)
    bool m_bRepeatBarksWhenExhausted;                                                 // 0x0400 (size: 0x1)
    bool m_bEnableMaxImpostorsLimit;                                                  // 0x0401 (size: 0x1)
    TArray<FName> m_SpawnerGroupClearedPathName;                                      // 0x0408 (size: 0x10)
    TArray<FSCImpostorForSave> m_ImpostorToSpawnOnSaveLoaded;                         // 0x0418 (size: 0x10)
    bool m_bSpawnRequestedOnSaveLoaded;                                               // 0x0428 (size: 0x1)
    int32 m_iCurrentLastManOccuranceCount;                                            // 0x042C (size: 0x4)
    bool m_bAutoSpawnedOnSaveLoaded;                                                  // 0x0430 (size: 0x1)
    EGlobalBehaviors m_eBehaviorToSetOnSpawn;                                         // 0x0431 (size: 0x1)
    TWeakObjectPtr<class AActor> m_targetForHostileBehaviorsOnSpawn;                  // 0x0434 (size: 0x8)

    void OnUpdatedFromSaveCallback();
    void EventWithCharacterDynamic__DelegateSignature(class ABaseCharacter* _character);
    FAISituationNamedActor Conv_NameToAISituationNamedActor(FName _name);
    void BPF_UnSpawnSituation();
    void BPF_SwitchToFriendly(bool _bFriendly);
    void BPF_SwitchToAbandoning();
    void BPF_SpawnSituation(EGlobalBehaviors _eBehaviorToSetOnSpawn, class AActor* _targetForHostileBehaviors, bool _bForce, bool _bSkipBark);
    int32 BPF_GetSpawnersUsedCount(bool _bIncludeAlerted, bool _bOnlyCurrentlyUsed);
    void BPF_GetSpawnersUsed(TArray<class AAISpawner*>& _outSpawners, bool _bIncludeAlerted, bool _bOnlyCurrentlyUsed);
    void BPF_GetSpawnerGroupsUsed(TArray<class ASpawnerGroup*>& _outSpawnerGroups);
    class AActor* BPF_GetNamedActor(const FAISituationNamedActor& _namedActor);
    EGlobalBehaviors BPF_GetBehaviorOverride();
    int32 BPF_GetAis(TArray<class UAIFightingComponent*>& _outAiComponents, bool _bIncludeAlertedSpawners, bool _bAppendToArray, bool _bIncludeAbandonningAIs);
    void BPF_EnableHitOnAI(bool _bEnable);
    void BPF_ChangeAiPerception(bool _bActivate);
    bool BPF_AreAllSpawnerGroupsCleared();
    void BPF_AddNamedActor(class AActor* _actor, FName _name);
    void BPE_UpdateLDVisibilityOverride(bool _bVisibility);
    void BPE_OnStartAIPhaseChanged(class AFightingCharacter* _fightingChar, const FAIPhaseTransitionData& _phaseTransition);
    void BPE_OnInteractiveDialogInterrupted();
    void BPE_OnEndAIPhaseChanged(class AFightingCharacter* _fightingChar, int32 _iPreviousPhaseIndex, int32 _iCurrentPhaseIndex, FName _currentPhaseName);
    void BPE_OnAIPhaseChangeSequenceFinished(class AFightingCharacter* _fightingChar, const FAIPhaseTransitionData& _phaseTransition);
    void BPE_OnAIFightingStateChanged(class AFightingCharacter* _fightingChar, EFightingState _ePreviousFightingState, EFightingState _eNewFightingState);
    void AlertLevelChangedCallback(EAlertLevel _eNewLevel);
    void AISituationGlobalBehaviorChangedDynamic__DelegateSignature(class AAISituationActor* SituationChanged, const class UAIFightingComponent* AI, EGlobalBehaviors NewBehavior);
    void AISituationDynamicMulticastDelegate__DelegateSignature(class AAISituationActor* SituationChanged);
}; // Size: 0x490

class AAISpawner : public AActor
{
    FAISpawnerAIDownDelegateMulticast AIDownDelegateMulticast;                        // 0x02C8 (size: 0x10)
    void AIDownDynamic(class AAISpawner* Spawner);
    FAISpawnerAISpawnedDynamicDelegate AISpawnedDynamicDelegate;                      // 0x02D8 (size: 0x10)
    void AISpawnedDynamic(class ABaseCharacter* SpawnedCharacter);
    FAISpawnerOnPatrolCompleted OnPatrolCompleted;                                    // 0x0300 (size: 0x10)
    void AIPatrolCompleted(class UAIFightingComponent* AI, class APathPatrol* Patrol);
    FAISpawnerOnGenericDialogEvent OnGenericDialogEvent;                              // 0x0310 (size: 0x10)
    void GenericDialogEventDelegate(FName EventTriggered);
    FAISpawnerOnDialogCompleted OnDialogCompleted;                                    // 0x0320 (size: 0x10)
    void DynamicMulticast();
    FAISpawnerOnDialogCut OnDialogCut;                                                // 0x0330 (size: 0x10)
    void DynamicMulticast();
    FAISpawnerOnLineEnded OnLineEnded;                                                // 0x0340 (size: 0x10)
    void DialogLineEvent(int32 DialogNodeId);
    FAISpawnerOnGlobalBehaviorChanged OnGlobalBehaviorChanged;                        // 0x0350 (size: 0x10)
    void AICharacterGlobalBehaviorChanged(class ABaseCharacter* Character, EGlobalBehaviors NewBehavior);
    FAICharacterSpawnParams m_SpawnParams;                                            // 0x0360 (size: 0x58)
    FSCAiActionClassInstance m_SpawnAction;                                           // 0x03B8 (size: 0x10)
    TSubclassOf<class ABaseCharacter> m_SpawningClass;                                // 0x03C8 (size: 0x8)
    bool m_bForcedPreFightLookAtTarget;                                               // 0x03D0 (size: 0x1)
    class AActor* m_ForcedPreFightLookAtTarget;                                       // 0x03D8 (size: 0x8)
    class APathPatrol* m_pathPatrol;                                                  // 0x03E0 (size: 0x8)
    EPatrolLaunchMethod m_ePatrolLaunchMethod;                                        // 0x03E8 (size: 0x1)
    class UAIPhaseScenario* m_PhaseScenarios;                                         // 0x03F0 (size: 0x18)
    class UAIPhaseScenario* m_PhaseScenario;                                          // 0x0408 (size: 0x8)
    EFactionsEnums m_eFaction;                                                        // 0x0414 (size: 0x1)
    float m_fRespawnTime;                                                             // 0x0418 (size: 0x4)
    float m_fSpawnDelay;                                                              // 0x041C (size: 0x4)
    bool m_bCanRespawn;                                                               // 0x0420 (size: 0x1)
    bool m_bLowStructureOnSpawn;                                                      // 0x0421 (size: 0x1)
    bool m_bIsLoneWolf;                                                               // 0x0422 (size: 0x1)
    int32 m_iSoundTensionLevelOverride;                                               // 0x0424 (size: 0x4)
    FName m_VoiceVariationSwitchOverride;                                             // 0x0428 (size: 0x8)
    int32 m_iChargesToAddWhenKilled;                                                  // 0x0430 (size: 0x4)
    int32 m_iDeathCounterDecreaseWhenKilled;                                          // 0x0434 (size: 0x4)
    bool m_bDeathCounterResetWhenKilled;                                              // 0x0438 (size: 0x1)
    EFirstSpawnMethod m_eFirstSpawnMethod;                                            // 0x0448 (size: 0x1)
    bool m_bAllowPerceptionInstantOnSpawn;                                            // 0x0449 (size: 0x1)
    class USceneComponent* m_RootComp;                                                // 0x0450 (size: 0x8)
    TArray<FCarriedProps> m_carriedProps;                                             // 0x0458 (size: 0x10)
    TSubclassOf<class ABaseWeapon> m_carriedWeapon;                                   // 0x0468 (size: 0x8)
    FName m_CarriedWeaponPoolName;                                                    // 0x0470 (size: 0x8)
    bool m_bKeepIdleAnimDuringAlertedDialogs;                                         // 0x0478 (size: 0x1)
    TArray<FIdleAnimAndTransition> m_IdleAndExitAnimation;                            // 0x04D8 (size: 0x10)
    class UAIIdleDB* m_AIIdleDB;                                                      // 0x04E8 (size: 0x8)
    FAnimContainer m_AlertedAnimation;                                                // 0x04F0 (size: 0x18)
    TSubclassOf<class ABaseCharacter> m_EditorClass;                                  // 0x0508 (size: 0x8)
    class UAIPhaseScenario* m_PhaseScenarioOverride;                                  // 0x0510 (size: 0x8)
    TArray<float> m_rawCustomPrimitiveData;                                           // 0x0518 (size: 0x10)

    void OnAiBehaviorChanged(EGlobalBehaviors _eNewBehavior, const bool _bFromDialog);
    bool IsSpawnerBusy();
    TSubclassOf<class ABaseWeapon> GetCarriedWeapon();
    void BPF_WantsSpawn();
    void BPF_UnSpawnAIDelayed();
    void BPF_StartAssociatedPatrolOnSpawnedAI();
    void BPF_SetSpawningClass(TSubclassOf<class ABaseCharacter> _class);
    void BPF_SetPhaseScenario(class UAIPhaseScenario* _scenario);
    void BPF_SetForceSpawnerBusy(bool _bSpawnerBusy);
    void BPF_SetCanRespawn(bool _canRespawn);
    bool BPF_HasSpawnedAI();
    TSubclassOf<class ABaseCharacter> BPF_GetSpawningClass();
    class ABaseCharacter* BPF_GetSpawnedAI();
    FName BPF_GetCarriedWeaponPoolName();
    TArray<FCarriedProps> BPF_GetCarriedProps();
    void BPF_AskForRespawn();
    void BPE_OnRespawnFinished(class AActor* _ActorAIRespawned);
    void BPE_OnIADown(class AActor* _ActorAI);
    void AISpawnedDynamic__DelegateSignature(class ABaseCharacter* SpawnedCharacter);
    void AIPatrolCompleted__DelegateSignature(class UAIFightingComponent* AI, class APathPatrol* Patrol);
    void AIDownDynamic__DelegateSignature(class AAISpawner* Spawner);
    void AICharacterGlobalBehaviorChanged__DelegateSignature(class ABaseCharacter* Character, EGlobalBehaviors NewBehavior);
}; // Size: 0x530

class AAIWaveRefillDirector : public ASCActor
{
    TArray<TSoftObjectPtr<AAIWaveSpawner>> m_WaveSpawners;                            // 0x02D8 (size: 0x10)
    FAIWaveRefillDirectorOnWaveCompleteDelegate OnWaveCompleteDelegate;               // 0x02E8 (size: 0x10)
    void OnWaveRelatedEvent(int32 _iWaveIndex);
    FAIWaveRefillDirectorOnWaveStartedDelegate OnWaveStartedDelegate;                 // 0x02F8 (size: 0x10)
    void OnWaveRelatedEvent(int32 _iWaveIndex);
    FAIWaveRefillDirectorOnWaveRelatedSituationComplete OnWaveRelatedSituationComplete; // 0x0308 (size: 0x10)
    void OnWaveRelatedSituationComplete(int32 _iWaveIndex, class AAISituationActor* _relatedSituationActor);
    FAIWaveRefillDirectorOnWaveAndSituationComplete OnWaveAndSituationComplete;       // 0x0318 (size: 0x10)
    void OnWaveAndSituationComplete(int32 _iWaveIndex);
