#ifndef UE4SS_SDK_Struc_ProceduralFloors_HPP
#define UE4SS_SDK_Struc_ProceduralFloors_HPP

struct FStruc_ProceduralFloors
{
    TArray<class UStaticMesh*> Floor0_3_BE5A3DDC443B179CF2D2EB87F6E22CED;             // 0x0000 (size: 0x10)
    TArray<class UStaticMesh*> Floor1_5_E646D0E94B5AB28C4D6EF28B31E134B1;             // 0x0010 (size: 0x10)
    TArray<class UStaticMesh*> Floor2_16_D053C26E4752EA79AD63979B9AC748CF;            // 0x0020 (size: 0x10)
    TArray<class UStaticMesh*> MemberVar_7_25C7DD5940661855F7ED19BC75B9018C;          // 0x0030 (size: 0x10)
    TArray<class UStaticMesh*> MemberVar_8_753301F943F4E6DF06EA48A9B1CBFFEF;          // 0x0040 (size: 0x10)
    TArray<class UStaticMesh*> MemberVar_9_385821CE46ECC54A84E76ABE0338F5AA;          // 0x0050 (size: 0x10)
    TArray<class UStaticMesh*> MemberVar_10_CC35DBF7406BDD559877C48434B2FFE6;         // 0x0060 (size: 0x10)
    TArray<class UStaticMesh*> MemberVar_11_0C9E3D414E0A9251D50338AEF90AF9E5;         // 0x0070 (size: 0x10)
    TArray<class UStaticMesh*> MemberVar_12_A76B2FFD4377EF20C6E375A615E4EB8C;         // 0x0080 (size: 0x10)
    TArray<class UStaticMesh*> MemberVar_13_A19F7A2543DF341E61081DAB9409B0F0;         // 0x0090 (size: 0x10)
    TArray<class UStaticMesh*> MemberVar_14_019A667E4FADEF36964C85A04160DE34;         // 0x00A0 (size: 0x10)
    TArray<class UStaticMesh*> MemberVar_15_96F7A3CB4B7BBB26C3DEED92E21B12B6;         // 0x00B0 (size: 0x10)

}; // Size: 0xC0

#endif
