#ifndef UE4SS_SDK_UI_GameplayColors_HPP
#define UE4SS_SDK_UI_GameplayColors_HPP

struct FUI_GameplayColors
{
    FLinearColor StructureOn_41_CB3D4A8641ED993A527CF8A0534E2A32;                     // 0x0000 (size: 0x10)
    FLinearColor StructureOff_39_F670D0ED466378B4F7F32587AF64B920;                    // 0x0010 (size: 0x10)
    FLinearColor HealthOn_42_46E1C585400BD5284D0CAA89CFA72795;                        // 0x0020 (size: 0x10)
    FLinearColor HealthOff_43_FBCCBAF24C5D117FF355FEA67E77F908;                       // 0x0030 (size: 0x10)
    FLinearColor FocusOn_33_1363280049E5B39F9423229BBFB9DB76;                         // 0x0040 (size: 0x10)
    FLinearColor FocusOff_34_3E5D665B479C1450C620F190EAB1FDD8;                        // 0x0050 (size: 0x10)
    FLinearColor SkillsOn_46_1121AD6B485BB5677886F5AEAA02782B;                        // 0x0060 (size: 0x10)
    FLinearColor SkillsOff_45_3DCDB1F543C04B3259D3449ABAAA0081;                       // 0x0070 (size: 0x10)
    FLinearColor ChargesOn_47_56F6EF634E64238748AB81AFF1A56A9A;                       // 0x0080 (size: 0x10)
    FLinearColor ChargesOff_49_3E56448D4EE7D6E4EBC1C7B4B1CC3AE8;                      // 0x0090 (size: 0x10)
    FLinearColor AgeYoung_51_3B852843402DA3F35651289F24EC42E9;                        // 0x00A0 (size: 0x10)
    FLinearColor AgeOld_53_65E5729740546216B014A097C6795E42;                          // 0x00B0 (size: 0x10)
    FSlateColor TxtWhite_57_161B2DB54FA45AFA2EB4BC91AF283737;                         // 0x00C0 (size: 0x28)
    FSlateColor TxtBlack_59_00F23CCE4D64C141215030A117C6AA49;                         // 0x00E8 (size: 0x28)
    FLinearColor Disabled_62_4535C4C1414D55B4B537079E5A0707D0;                        // 0x0110 (size: 0x10)
    FLinearColor Essence_67_0832D72C428ED6CC55BC24A47788CA98;                         // 0x0120 (size: 0x10)
    FLinearColor Breath_68_7A87352C4A38156D52FE139CCDDE9027;                          // 0x0130 (size: 0x10)
    FLinearColor Mind_70_0E3BDAA04AEAC08D1A4C3CBE43F2F00A;                            // 0x0140 (size: 0x10)
    FLinearColor Goals_73_51B4113E456C7FA4253053AB3FDE3421;                           // 0x0150 (size: 0x10)

}; // Size: 0x160

#endif
