#ifndef UE4SS_SDK_UI_Base_Colors_HPP
#define UE4SS_SDK_UI_Base_Colors_HPP

struct FUI_Base_Colors
{
    FLinearColor LinearWhite_15_2B6C633A45A03A4EE963868079027752;                     // 0x0000 (size: 0x10)
    FLinearColor LinearBlack_16_76BE228442BCD596CACE958BA846CD86;                     // 0x0010 (size: 0x10)
    FLinearColor LinearGrey_21_D15486424D46CC9221FBA8B3564E25EF;                      // 0x0020 (size: 0x10)
    FSlateColor SlateWhite_17_2F19E6B548D5F18CC97C829F56CD546B;                       // 0x0030 (size: 0x28)
    FSlateColor SlateBlack_18_7B0A74EC46FEAF94F4E880822BD24789;                       // 0x0058 (size: 0x28)
    FSlateColor SlateGrey_24_114568A84933C6311AF97AAAD01253AD;                        // 0x0080 (size: 0x28)
    FLinearColor LinearRed_27_185BD1A74E7587E0924753A7FFB20E09;                       // 0x00A8 (size: 0x10)
    FLinearColor LinearYellow_29_BAEB86264B9F4917696E248393ECF39A;                    // 0x00B8 (size: 0x10)
    FLinearColor LinearGreen_32_71771C5A437D219BD5B1ABAA0F2AC716;                     // 0x00C8 (size: 0x10)
    FLinearColor LinearTransparent_36_5543E879487550D49DD1FD92D802DCA3;               // 0x00D8 (size: 0x10)

}; // Size: 0xE8

#endif
